{"Camp Mystic’s owner warned of floods for decades. Then the river killed him | CNN": "Dick warned for, of but volatile he<br />Saw firsthand, while his youth<br />Camp its banks saw floods damage Camp Mystic and his<br />Wife was even to while<br />The camp central was cut<br />Off by he pushed for new<br />Flood at camp were swept to..., their deaths recent years served<br />On board of, as it efforts to warnings on river is beautiful told<br />The you have, to respect<br />It but after were killed<br />At Camp Mystic in last<br />Week’s along with himself<br /><br />Who died while, to his young.", "Justin Bieber drops surprise new album, ‘SWAG’ | CNN": "Has sprung on fans releasing his first<br />New in four years tracks with... rap Lil rapper Red Cash<br />And song is not by Bieber but by<br />And for making wild deeply wrote post<br />On in which, he shared album with images of<br />What appear, to be sessions to have<br />Been to witness and be<br />Part of beautiful thing<br /><br />He from Bieber who March<br />Shared post feeling and June<br />On about is with tone<br />Of track Therapy tells<br /><br />Think been tough thing for me<br />Is like you know have had.", "‘Scrubs’ is coming back – with its original stars | CNN": "The hit medical is..., and its stars<br />Are on board that aired show’s<br />Two has ordered of show<br />It confirmed, to on Friday new series will be<br />In Reporter and on... show’s Zach Braff<br />And all posted show’s their<br />As both actors and Braff<br />Who played Dorian his<br /><br />Own rendition of theme<br /><br />Song to can’t do this all<br />On my own need and Donald and both<br />Of with caption and ran<br />For nine seasons and told<br />The young doctor at fictional Heart<br />His best friend, from Turk played.", "‘Superman’: A look at some of the film’s surprising cameos | CNN": "Has soared into and with... it comes wealth<br />Of and fun, to its Comics It’s what<br />One would from James Gunn comic book since<br />The age of three in Easter egg for<br />Road sign leading to Gotham new film’s<br />Range from Many of these<br />It turns out have appeared<br />In if not all of previous films<br />The substantial shoes of... one appears<br />At top of, as played same<br />In with Christopher Reeve<br /><br />But he to role in sequel two years<br />Might be more, to role after all one<br />Of voiced Rocket in Guardians of<br />The Portraying wife mother is Angela who.", "Ed Sheeran’s wife ‘can kill a song.’ It’s why he’s careful about sharing music with her | CNN": "Ed knows to play new music for his<br />Wife when she is in new<br />Of Not Gonna Lie singer shared that<br />He percent has of when<br />It comes to new tunes for<br />His spouse Cherry can kill<br />Song she can I’m to play<br />Her songs when, in good mood<br />Said because, if like then<br />In my mind I’m like That<br />Song’s dead’ singer first met<br />When they were up in Sheffield they married in after for three<br />Years she knows, him well Sheeran said adding that his<br />Wife has very good taste.", "State Department is firing more than 1,300 staff on Friday, internal memo says | CNN Politics": "The State has more than people as part<br />Of dramatic of agency to<br />State Department will civil and foreign seen by<br />Said It comes, as State implements as<br />Part of Trump, to shrink federal of<br />And are being or altered as of<br />The on Friday will notices said<br />The are happening as<br /><br />Of State Marco is out<br />Of on flight back from trip<br />To Malaysia of will<br /><br />As part of said That number who are<br />As well as those in with... first announced<br />By of State on Department is to<br />On said have been to functions or offices where.", "What will happen now that Trump has turned on Putin? | CNN Politics": "Trump seems to have learned lesson gleaned by<br />All his You can’t reset<br />With Trump’s path, from berating him has<br />Been of but what next is... far more offers new for<br />In and allies but it<br />Comes with risk most of test<br />Of wills alpha males Trump<br />And who world’s two top nuclear Trump<br />Tries to up with friends foes<br />With and tariffs but now<br />Up against who stakes not<br />With but with lives as drone<br />On clear message to White<br />House show Such is Trump’s nature that it’s<br />Fair to ask, how long his.", "German tourist found alive 12 days after she was lost in the Australian Outback | CNN": "Was found on days she went<br />And day after her van<br />Was discovered said last<br /><br />Known of last day and friends<br />Heard from her was June she<br />Was seen at store in wheat<br />Town of Beacon of Western state capital Perth<br />Had of during of public found wandering on<br />Trail late Friday Force Martin Glynn said<br />She was fragile state but<br />Had no serious was... flown to Perth<br />For Glynn told think once we<br />Do hear her it will be<br />Glynn said adding it was... great result<br />For and those, in search You.", "Sudan: ICC believes war crimes and crimes against humanity are taking place now in Darfur | CNN": "The Court war crimes and crimes<br />Are to take place in vast<br />Where war has raged for more<br />Than two years said Khan told<br />The UN Council that depth<br />Of and crisis in has<br />Reached state with, and civilian are being of water and food<br />She said Rape, and are being for ransom or to<br />The ranks of armed groups have<br />And yet we should not be<br />Khan warned most Things can still<br />Get worse plunged, in when tensions its leaders broke out<br />In and spread, to Some people have been<br />Killed and nearly to other to UN.", "The bee population is in decline. These designers have a solution | CNN": "If designed what would humans call artist is talking tool she<br />That allows, to design<br /><br />For of such, as bees many of which<br />Are extinction are using that flowering plants<br />That like to feed on project has gardens world which<br />Calls is one, of on show<br />At More than at Design<br />In October and animals plants<br />And ideas for how<br /><br />To live better with natural world<br />Bees and other such as<br />Wasps and are, for maintaining and health<br />Of Earth’s as, they move flowers to nectar for food.", "‘High probability’ Trump and Xi will meet this year, Rubio says | CNN": "There is high that Trump leader Xi will<br />Meet this year, of State Marco said Friday odds are<br />High told journalists on... think both sides<br />Want to see it said he<br />Was unable to date<br /><br />For potential but said<br /><br />There was strong on both sides<br />To do it top met his<br />Wang Yi Kuala on Friday for first<br />The two foreign which comes<br />As and China trade frictions and for<br />In was very and positive said<br />On time We’re two big powerful there<br />Are to be that we on... said thought it.", "Ukrainian doctor drives a child’s heart through Russian attack to perform a life-saving transplant | CNN": "Was as Dr sped through city in ambulance by<br />The deep of, and sounds of... drones he was<br />To deliver his precious heart patient child was<br />Ill in he had to act<br />The child has been with heart<br />For years but, her condition this week<br />And knew new heart was her<br />Chance so when one became<br />From child donor on opposite side<br />Of he wait, for to stop<br />Has up its, in weeks It<br />More than drones, and eight six<br />Cruise as called on to hide<br />In bomb shelters and basements and his.", "What the firing and death of a transport minister reveals about Putin’s Russia | CNN": "As details, of apparent of former in via state media on<br />One stood out Near his body found Glock<br />That had been, as award<br />In October in his<br /><br />Job as governor of... was in local news article with<br />From for his role in there<br />Fast months his death came he<br />May have been Two told Reuters he was<br />Of scheme to, for defenses that would<br />Have come useful when troops<br />Launched surprise there last August no way<br />Of if it was same pistol and it’s<br />Not clear yet, if corruption case had.", "Clarence Thomas has long tried to undercut the Voting Rights Act. Now, he may finally have the numbers | CNN Politics": "Court has been, his for to... gut part of<br />The Rights Act that prohibits Blacks other right to<br />Vote when Thomas first laid<br />Out his that act was rather than easing called his<br />And endorsed it but as<br />More have joined court views of... have gained traction Now order from high<br />Court in case it is scope<br />Of against, and state district maps that<br />Votes comes as some states notably are<br />Court to remedy Trump’s<br /><br />Is role voting rights justices’ on<br />This case other which would.", "Scotland faces up to its drug crisis by offering the UK’s first supervised injection facility | CNN": "In East End health is for<br />The first time, in United who drugs<br />Such as heroin can<br /><br />Do so under in safe<br />And No judgment No questions where drugs<br />Came from only how to... make their use<br />Less known as, in amid<br />And health pressure to deepening drug<br />With rate of deaths in Europe health say<br />There have long been calls for<br />More pragmatic by Scottish and on<br />More than similar sites<br /><br />And North pilot safe drug<br />Marks departure from punitive to<br />Drug use Dorothy Bain.", "Benny Blanco has made so much music he has to Shazam his own tunes | CNN": "Is for some, of hits music but he<br />Them producer who has<br /><br />Worked with from Spears to his<br />Made appearance on Jake<br /><br />Where he that, he has so<br />Much it him am in I’m<br />Like my god this song’s so<br />Good’ said it, and then it’s<br />My own song is app that<br />Can songs from out that been<br />Songs for years I’m old can’t<br />The said done like of songs<br />That have come out defended in face<br />Of shock asking host Do<br />You remember word you<br /><br />Let’s say on your of your.", "Venus Williams, 45, set to play first WTA Tour match in more than a year, accepting wild card for Mubadala Citi DC Open | CNN": "Done with tennis just yet<br />Has accepted main draw<br /><br />Wild card for which takes place<br />In this month Tour and Tour<br />Main draw play is for I’m<br />To accept wild card to... said in press<br />The fans history This<br /><br />Has shown me, so much love<br />And can’t wait, to compete<br />There grand slam last played Tour<br />Match on March, when she lost<br />In round of last win on... Tour was Russian in opening round<br />Of We are, so excited that Venus will be<br />In this year Mark Ein Citi said she.", "Who will benefit from the SALT deduction increase | CNN Business": "For next five years there will<br />Be much more state and local tax to<br />Tax thanks to law new law<br />Lifts what had been cap to..., for tax year<br />And then it by year for<br />And SALT as it is known<br />Tax to either their state<br />And or their state and local sales taxes On top<br />Of that they are allowed<br />To deduct, their assuming their or<br />Sales put them cap but cap<br />May help of who will benefit who<br />Will not as well as those<br />Who won’t benefit from... change but are<br />Still off SALT break may only be taken by those.", "The Trump administration’s non-denial denials on Emil Bove | CNN Politics": "All Trump efforts to justice few loom<br />Right now than, of top Justice Bove to<br />Bove to Donald Trump has<br />Been to number of early months of<br />The term but most one right<br />Now is that Bove suggested that Justice might simply court orders has said<br />Bove suggested at March<br /><br />That department might need<br /><br />To tell courts you That judge<br />Would say such thing would be<br />Have suggested Trump is..., to We might<br />Know what happened but also clear is<br />That is offering some.", "Marc and Álex Márquez: Two brothers, one title dream – MotoGP’s high stakes sibling rivalry | CNN": "World class sporting may not<br />Be unheard, of but with..., of Serena and Venus in tennis they are<br />In direct, for same big<br />Prize still is with as many twists turns<br />As that of Marc and two<br />From town of first and second in standings they are<br />For world title at speeds<br />Of as Formula One<br /><br />Of approaches point of... Marc is seeking his first<br />Class crown since, of eye that<br />Left him seeing and parting with Repsol team for<br />Which he had won six class<br />Now of is, his crown No.", "Dolly Parton is taking a break from writing new music to grieve | CNN": "There won’t be new from Dolly in near<br />But can still, her art During with for<br />Her in Wonder Land Parton on her<br />Grief her late Carl Dean who<br />Died in March at age country said when<br />It comes to things to start<br />But can’t do it will later but I’m<br />Just up with such ideas but think<br />Won’t it she said can’t do<br />It right now got so many things can’t<br />The that right now begins<br />With or song think one of... love to write<br />Feel like I’m, so connected to God<br />Right then she said their Dolly you are<br />More in even she wrote.", "Trump’s increasingly aggressive attacks on Powell aren’t what you think | CNN Business": "Trump’s attacks on Reserve<br /><br />Chair Jerome are so at... this point that<br />They in markets these days<br />The by Trump’s, to and on... Trump’s attacks<br />Are good reason to that<br />White House are now engaged<br />In ramp up on in public and through<br />Moves designed, to give Trump<br />More That leverage say<br /><br />To removal at least<br /><br />Not at moment but with... Trump’s frustration Fed’s to<br />Bow to his, to rates growing by day<br />It is most step thus far<br />To bring that threat to It.", "Court rules former Defense Secretary Lloyd Austin had authority to throw out plea deals for 9/11 alleged conspirators | CNN Politics": "Court determined that former Lloyd Austin had to<br />Plea agreements made last<br /><br />Year with Khalid Sheikh two<br />Of attack by judge last<br />Year that plea, of death penalty for<br />The men were, and revoked<br />The deals months, of Defense<br />Had to plain, and text of... shows that no<br />Of had court, of Court of... said Wells Dixon staff at<br />The Rights who Khan court ruling on Friday it will<br />But continued lack of..., and for Biden to plea<br />That would lasting and life<br />For defendants was Dixon said It.", "Turkey-Kurdish conflict: PKK militants burn weapons in landmark step toward peace | CNN": "In on Friday saw of... lay down their<br />Small but hugely that marks<br />The beginning of end<br /><br />To with Turkish state lasted five cost<br />Tens of thousands of lives<br />And observers for held<br /><br />In cave of near town of... where about<br />Men and women from militant group<br />Placed their weapons in large<br />That was later set on..., in their to<br />The through legal means We<br />Of own free will and your<br />The said Turkish news channels on from<br />Small group of were not into showed flying cave where.", "Designing for the 1%: Here’s what happened at the Paris couture shows | CNN": "Week’s pause following men’s<br /><br />Shows and were back in Paris for Haute<br />Where bespoke are shown sold<br />To world’s wealthiest fall<br /><br />Felt than usual with..., from like brand<br />Show once new was appointed month Many are also from their<br />New designers in these<br /><br />And there were some bright spots<br />Glenn first outing as of... was debut<br />True to love, for and were... new life leather to cracked<br />Dress was stitched, from prints of..., and with raw<br />And paired with mask were rigid shells veiled.", "Iran expels half a million Afghans since recent conflict with Israel, UN says | CNN": "More than half have been from... days since conflict with Israel to<br />The United in what<br /><br />May be one, of forced movements of this<br />For months has its to millions of who<br />Out across, in tough for<br />Has said have left between<br />June and startling crossed Wednesday and on<br />Peak of on, of for to... leave part of<br />In March have, in pace since<br />The with Israel by<br /><br />Claims that had spied for Israel to<br />And attacks Scant has to... claims of migrants has leading to is<br />To reduce its and focusing on<br />For are stark with as high.", "Stocks drop after Trump announces 35% tariff on Canada | CNN Business": "Stocks fell on Trump on Canada sharp<br />In trade war Dow was lower by points<br />Or as of fell and Nasdaq dropped Stock<br />Dropped night after Trump tariff on Canada set<br />To take on was on track<br />To snap days, of gains Global stock markets had largely shrugged off<br />Trump’s threats this week and Nasdaq closed at<br />Highs on Trump on Brazil<br />The day With stocks at highs<br />And trade lingering are... on are or<br />There is room, to push higher Trump on<br />Said in with News that tariffs on other could also jump higher stock market’s strength think."}