{"David Beckham documents hilarious haircut mishap | CNN": "May be one, of the most<br />Play the game, but he may<br />Need to work on his skills<br />Bit of hiccup while he hair according to video he<br />Page which the placed bald spot<br />Top of his head What have<br />You his wife is heard saying to which<br />It’s not clipper head fell<br />Off with laugh went on to roast her husband how their<br />Kids will have, of this joking does not<br />Look good she said I’m going to be<br />You it looks, in the caption wrote that<br />This whilst shaving my head<br />And as you can hear Beckham wife find.", "Trump threatens to restrict stadium deal with Washington Commanders if they don’t change name back to ‘Redskins’ | CNN Politics": "Trump on his call for Washington to<br />Change their name back to threatening to<br />Team’s deal if, they though it’s<br />How he would be to may<br />Put restriction on them that if they<br />Change the name back to get<br />Rid of moniker won’t<br /><br />Make deal for, them to build<br />Team would be much more valuable Deal<br />Would be more, for Trump wrote<br />Truth the left, for in Mayor and team<br />Deal in April to bring<br />Back to district at site<br />Old Trump touted the deal<br />Time but is stalled before.", "‘Superman’ continues to soar at the box office | CNN Business": "Flew past for, the straight week<br />Top the box James reboot<br />Grossed in its, to provided by it<br />Has now grossed, and according to seen<br />Strong holds that is of word<br />Mouth in on big film like<br />This that opened well said<br />Shawn director of founder and owner of Box<br />And Jurassic World which<br /><br />Came in No its third week<br />Held off this Know What You<br />Did Last Summer and Pictures’ Smurfs when<br />This big they drop off at third but it<br />Seems to be this year this.", "Ann-Katrin Berger: Two-time cancer survivor puts in all-time great performance to propel Germany to Euro 2025 semifinals | CNN": "Terms of challenges that<br /><br />Has string of saves in Germany’s France<br />Night is low down on list<br />Not to say, it huge night<br />For the her put in one<br />Great as Germany beat<br /><br />France in penalty draw<br /><br />Time made nine saves in open play more<br />Than has managed in stage<br />Match the per, the her save<br />Own goal by Minge was pick<br />Bunch as she dived and clawed<br />When it looked, for the back<br />Net but did not stop there<br />Kept out very first spot<br />Kick from France’s scored since team’s fourth penalty then.", "Chris Martin gives concertgoers warning before ‘Jumbotron Song’ following viral CEO video fallout | CNN": "Chris made sure, to give plenty of notice that they<br />May appear on their video screens<br />Song at their show night We’d<br />Like to say, to some of you in crowd<br />Said on stage, at Camp Randall in Madison to<br />How we’re going to do<br />That is we’re, to use our and put<br />Some of you on the big<br />Screen still strumming his went<br />Joke so please, if you done<br />Your do your now comes after last week<br />Where the Jumbotron Song<br /><br />Turned to man, and as concert watched stage<br />Two and to hide their faces when they<br />Shown on giant screen cameras Whoa.", "Ecuador’s most notorious drug kingpin has been extradited to the US | CNN": "Most drug has been to States<br />Month he was that sparked wave<br />Known as was, from the port<br />Where was handed to US officials who earlier to<br />Out the prison of Justice plane local time with<br />Gang according to agency by<br />Showed Macias shorts helmet and vest<br />As he was by armed National since<br />Least Macias has led<br /><br />Los which US has agents and multiple tons<br />Court in April on seven counts of<br />Drug and gun, in Macias from prison in where<br />For and trafficking shipping wave of<br />Live from gangs who stormed popular held.", "Jeffrey Epstein-related books and TV shows have exploded amid Trump’s case-closed claims | CNN Business": "And about, his crimes has<br />Been this month, in book sales<br />Streams and searches the data points to<br />Deep in underage sex<br /><br />And at time, when Trump is, to shift from<br />Old of Julie Brown’s book<br />Have been snapped up by buyers in recent weeks leaving the book<br />Out of stock all across<br />Web from Barnes, to shops Brown<br />Said she has been from buyers who can’t<br />Find print copies I’m told<br />More she wrote on to people who have<br />Been the publisher to that the book<br />Now its third hope it that.", "CNN Poll: Americans largely oppose Trump’s ramp-up of deportations | CNN Politics": "By Trump’s to scale up its<br />New poll by finds with rising the president has<br />Gone too far, in out latest say president has<br />Gone too far, when it comes<br />Up points since, and has risen in that<br />Time from nearly of now<br />Say that Trump’s has gone too<br />Far while just, of adults<br />Say the same say they plans<br />Build new capable Ninety up to<br />While oppose, the Enforcement by billions of dollars two White<br />House reflected in sweeping bill that<br />Trump signed into law Nearly in efforts to end.", "Four-year-old girl dies of hunger in Gaza as Israel throttles food supply | CNN": "Old gave up, her fight for<br />Life on she died at central from brought<br />By and to source her skeletal was<br />Laid out on slab of stone<br />Least in Gaza have died<br />Since the conflict in well<br />As ten health says According to World<br />Health most of these occurred<br />Since at March was one of least four children to last<br />Three days youngest just three<br />Months the past deaths have been<br />Due to famine in Gaza the health<br />Says reflecting in first<br /><br />Met month she was already weak with<br />And thin her said then that.", "Massachusetts man wins 2 Powerball games worth $1 million each | CNN Business": "One man bought two at two<br />Stores him million Paul Corcoran of<br />Small in planned, to play drawing he had<br />Games but final on that<br />Had passed to news release<br />So less than, from the first<br />Store where he bought he picked<br />Up for seven one that<br />That mistake earned him second chance at<br />State Both winning matched all<br />Five white balls drawn on earning per winning to numbers just missed<br />Red one number short ticket the full<br />Said been playing those same<br />For quite some time when million claimed his<br />State told Both stores where Corcoran bought.", "New tax law increases big beyond-the-grave tax break for the wealthy | CNN Business": "Tax has come long way since<br />When the level was set<br />Has the past who die may<br />Leave behind tax free to, their heirs up<br />That exemption had been<br /><br />Set to this year and snap<br />Back to little more than<br />Per but that won’t in level will by<br />And adjust, for year courtesy of<br />One Big Beautiful Act<br /><br />That pushed through, in time for<br />Trump to sign, it law after his of<br />Keep in mind, while not new<br />For because, from the first<br />Spouse who dies can be passed.", "California mom and son used handwritten notes to lead rescuers to their location in a remote forest | CNN": "Deep in woods miles from nearest road Tami Laird her<br />Son faced no cell no help<br />Sight and car stuck on rough<br />Road the duo had set<br />Off for what was supposed<br />Be trip to Boy Scout Camp<br />Just few hours from their home they packed<br />All the usual tents<br /><br />And of water to few<br />Days of Like Laird the app<br />Phone she plugged, in the camp<br />And the route, as it led<br />Off down rugged dirt road<br />First she camp had warned parents the drive<br />Could be rough, but of bouncing back roads.", "UC Berkeley professor killed in Athens: Suspect claims he ‘did it all for’ victim’s ex-wife, leaked police confession reveals | CNN": "House in Athens to pick<br />Up their two young it should<br />Have been the strained the couple had been<br />Terms of custody but<br /><br />Made it to, the front door<br />Broad in this, of he was shot times at<br />Close range to died where he fell police<br />Said his body with wounds<br />Seen in grim, in the rushed<br />Aid the masked fled the days<br />For his new, the he told<br />Did it all, for and our so that<br />We could have life without<br />Said according to statement he made<br />One of most, of the case.", "1 killed and 2 missing after a group is swept over an Oregon waterfall | CNN": "Bend One person was killed<br />And continued on for<br /><br />Two group of were swept over the Oregon said<br />Group went over Falls Dillon the River miles from<br />Bend on Saturday said<br /><br />Three were rescued from river and taken by ambulance to<br />Bend One person died Office the scene<br />Said Search efforts for missing went into and morning said Sgt Josh Barker with sheriff’s the victims’ and how<br />Group got swept, the falls including not<br />Falls which is large drop followed by series of rapids that surge<br />.", "Facing pressure from all sides, ICE gets a windfall of cash to ramp up enforcement | CNN Politics": "Trump is for, of cash into the sweeping mass that<br />And place pressure on federal at<br />All since its mass Trump took<br />And Enforcement has fielded from people the who<br />Think they aren’t and advocates who<br />Think they are too much lawmakers that<br />Some is taking to Trump<br />And have touted the work<br />ICE and agents on ground<br />These are strong tough that love<br />Trump said at, the White House<br />If they tough, they survive<br />While the public from president has<br />Been the officers for far more tense.", "How Trump’s trade tariffs could affect the cost of coffee in the US – visualized | CNN Business": "Love for coffee has made<br />Dark brewed beverage most<br /><br />Drink the country drink million cups of<br />Day though coffee have doubled in past<br />Five years States is the largest of coffee in world<br />And its biggest is Earlier this<br />Month Trump threatened to tariffs on goods<br />If Luiz Lula da Silva on former look at<br />Trade and why your cup leader could be<br />More expensive soon if<br /><br />.", "Ole Miss football player Corey Adams is killed in Tennessee shooting | CNN": "Ole Miss freshman was killed<br />Law enforcement found Adams with wound<br />Late the sheriff’s said statement they measures the sheriff’s said Shelby the victim on scene<br />Four men who wounds in incident at<br />Said Law have not named any but said<br />As the New had been one<br />Top defensive in country the said<br />Post it was, to learn of death while our is trying to cope<br />This loss our thoughts program with his<br />Loved ones during this difficult time<br />Team said We ask the Ole<br />Miss to keep, in their thoughts.", "China is catching up to the US in brain tech, rivaling firms like Elon Musk’s Neuralink | CNN": "Want to eat popped up characters on<br />Words were formed, from the thoughts<br />Known as Lou who is to speak the captured on video March<br />By and Station was part<br />Five with chip called brain led<br />By in US but which<br />Say is quickly up Luo<br />For Brain chief, the said there<br />Strong need for, they had been<br />By requests, from potential the patients were saying that this<br />Feels so great like they can<br />Gain or of, he told May<br />Rare at his lab the hour’s drive from<br />Where the trial took place.", "Rubio’s quiet ascent into Trump’s inner circle | CNN Politics": "When of State, in call President Trump<br />And Mark topic was Rubio on<br />First trip to Trump’s top had<br />Just met with, his to that<br />Trump was felt that the US had put<br />Time and effort the war<br />White House with, the reporters said had<br />Shared new different how<br /><br />End the war, though said that<br />Peace Asked what, the on Rubio ending that moment was of<br />Both sides leaving the that<br />More discussions with Russia could be<br />Gave no that, the was Rubio set<br />Shift Now joining the call.", "Japan PM laments ‘harsh’ election result as upper house control slips | CNN": "Lose its upper house exit polls showed<br />As with States looms while ballot does not<br />Prime falls it heaps on leader who also lost of<br />More house Party and partner seats to<br />Where half seats were up for<br />Grabs they are, to secure<br />Seats the exit poll by<br />Showed the ruling would hold<br />Seats if holds less than seats<br />Would mark its worst result<br />Since the was formed in That<br />Comes on top, of its worst<br />Years in lower house vote<br />Which has left, to calls needed his own.", "How Republicans are trying to sell Trump’s ‘big, beautiful bill’ to voters | CNN Politics": "White House just spent six months<br />Through with no, for Now comes<br />Real Trump’s aides, and are on bid to sell<br />Big bill to who are mostly with its<br />And of what, they have heard<br />Part on top Trump officials the country to bill’s<br />Seen as critical to next elections to with<br />More than half White House aides<br />And for White House cast Trump’s<br />As financial boon for<br /><br />That could course, of his final years office it comes<br />Down to people feel like<br />And have more, in their pockets said one.", "Scottie Scheffler leaves rivals awestruck after Open win | CNN": "For few fleeting as moments stared down<br />Ball that had off the bunker’s lip back<br />Feet looked human Then world’s<br />Down the next hole and his march towards<br />Not shock double could take<br />Shine off capture of sport’s<br />As the world No to victory his<br />Fourth career, at saw major clear of<br />Par him as, the first player the modern to win<br />First four majors by three<br />Or more strokes, to Tour This<br />Felt like one, of my best<br />Told reporters on era to May’s<br />Win it leaves, the just US away.", "As Trump pushes Texas takeover in fight for House, Democrats plot their counterpunch | CNN Politics": "House are actively for<br /><br />Trench against, the next year’s<br />Talks shape scenes, to mount President Trump’s<br />Play in Texas that aims<br />For the rest, of his second term House<br />And his team have begun<br />And expensive to House<br /><br />Maps in several states<br /><br />Briefed on effort they strategy Donald plans New<br />York New Jersey and Washington state<br />Hopes of flipping at least<br />Seats next It’s clear attempt<br />Boot out as, as five Texas move that<br />Will get publicly this."}