{"Israeli strike on cafe near Gaza City port kills dozens, hospital official says | CNN": "More than people have been<br />Killed in that hit near port<br />In according to head<br /><br />Of Dr Abu of said<br />In update on that at... least had been<br />Killed and injured in strike<br />By show thick smoke from scene<br />As well as, to and area they<br />Showed removed on Defense<br /><br />Told it was strike was spot<br />For and workers as it<br />And place to work by coast<br />Told that most, of are women and children who were<br />At cafe, for he also said was<br />Short of beds, and to treat.", "92-year-old British man convicted of rape and murder in 1967 cold case | CNN": "Man has been, of and rape<br />On that brought end to cold<br />Case that for years was found<br />By Crown Court, in rape murder of Dunne<br />Who was years old when Headley killed her<br />Dunne was found dead in her<br />Home in Easton in suburbs of Bristol in June<br />The police at time that<br />She had been raped and died<br />Of and local launched major they took<br />From men statements and made<br />More than calls, and Police<br />Said in statement on Monday yet none<br />Of it led, and case went.", "Warren Buffett donates record $6 billion Berkshire shares | CNN Business": "On another of Berkshire stock to<br />The Gates four, his donation since he<br />His two of Class shares boosted to charities to<br />Well he million shares to... Gates shares to<br />The shares to each of three<br />Led by his, and Foundation and NoVo still owns<br />Of stock based on shares his<br />Net worth prior to Friday’s made him<br />The world’s person to Forbes<br />Would rank sixth which surpassed<br />The he last June he billion to family last<br />In maintained, he does not<br />To sell any shares Now.", "Trump sends handwritten letter to Powell demanding ultra-low interest rates | CNN Business": "Trump on Monday his Federal Chair<br />And bank’s Board, of for rates<br />In campaign rate cuts Trump<br />On his social wrote that<br />The Fed’s board should be of..., for allowing this to<br />To United States who<br /><br />Sit on Fed’s board ones who<br />Vote on policy that<br /><br />Five Fed bank It’s unclear<br />If Trump meant, to attack<br />Just board or all of Fed<br />With he posted chart ranking of world’s<br />Banks by level of their<br />Key rates claiming has one<br />Of chart note, in Trump’s that.", "A$AP Rocky might have spilled a sweet detail about his and Rihanna’s third child – or trolled us | CNN": "May have given his new<br />To at Smurfs world premiere<br />In spoke their third child joking that he<br />And want to have big family much<br />Like Kim Damon Shawn Marlon as well<br />As next Damon and are... one of most<br />Then asked of new child Is... that girl been<br />It is man It is Rocky said with<br />Big grin he then doll which<br />Is in new film Right here<br />Right here You know what I’m<br />Laughed continued if true<br /><br />The new baby would be<br />The first daughter and Rocky are parents of two<br />Sons and Riot she was... third child on<br />The Met Gala red carpet their second her Super Bowl Smurfs.", "ICEBlock: This iPhone app alerts users to nearby ICE sightings | CNN Business": "Has worked tech, for around<br />Two decades, he built his<br />First app game at computer camp when<br />He was his app is for<br />To let users to sightings of Customs in their<br />Launched called early Trump’s its<br />The White House’s have sparked<br />Mass across poll in April showed of<br />Polled said Trump has gone too<br />Far in immigrants has<br /><br />More than users of whom<br />Are in Los where have taken place when<br />Saw what was, in this country to do<br />To fight back told that efforts feel to<br />Him of Nazi We’re watching is to<br />Be for users when ICE.", "Charlize Theron speaks out on immigration policies that have ‘destroyed the lives of families, not criminals’ | CNN": "Spoke out changing in country she has<br />Made her home At her annual Block<br />The thanked for time to be<br />Part of this, when world feels<br />Like it’s burning it is... Here in Los<br />In and globe we’re fast policy has<br />The lives of not rights are... less and less<br />Queer and trans lives are being and violence is<br />On rise Theron said to... is to star<br />Who from South, to United States US in her<br />Block is held, to raise funds<br />To help youth, in spoke out<br />Aid cuts have brought and AIDS.", "Trump administration finds Harvard in ‘violent violation’ of Civil Rights Act, threatens further loss of federal funds | CNN Politics": "Trump has found, in Rights Act<br />Once more its with school days<br />Trump suggested deal was..., in sight to<br />End its targeting of... Joint Task Force<br />To said Monday to Harvard that into school’s with<br />VI of Civil Rights Act<br />Which prohibits based on... race or national or<br />Is now Office for Civil Rights at<br />The Department of Health<br /><br />And finds that is in violent of<br />VI of Civil Rights Act<br />Reads obtained by which is... signed by General that<br />Has been some, and in others has been.", "Luckin comes to America: China’s biggest coffee chain opens its first US locations | CNN Business": "The chain that beat at its<br />Own game China is entering States<br />Its first two are both New<br />York in other chains such<br />As Dutch that have built loyal in targeting Gen<br />With drinks at, and accounts<br />Are promoting with stores<br /><br />Are in Greenwich near bustling New<br />York and to, for was founded in focuses on<br />To young people with mostly booths cashless Its beverages are<br />Than those offered by stores<br />The most basic which has<br />The expand at cost It<br />To use mobile phones to... place is also and loyalty which.", "WNBA expansion teams coming to Cleveland, Detroit and Philadelphia, league announces | CNN": "The announced on that Cleveland and will<br />Be expansion in coming years new<br />Team in Cleveland will play<br />In with following league<br /><br />Said in statement that of... three teams marks<br />In commitment to growing game for<br />And to new, and in more<br />The demand, for has never been higher and we<br />Are thrilled to, and to family said<br />In This is, of league’s depth<br />Of across game and surging for We<br />Are excited for what<br /><br />These will bring, to league are... that these new<br />Teams will of league Detroit.", "Trump aims to change the nation and further cement his power as deadline looms for ‘big, beautiful bill’ | CNN Politics": "Trump has chance, to his tighten his power grip on<br />The by driving his most<br />Piece of through, and Fourth victory lap<br />The dubbed One Big Bill Act<br />With is Trump’s, to change through<br />In that is huge and power will series of votes<br />On amendments through several to<br />Shore up narrow line tight<br />That could see sent back to... House and then<br />The desk by bill is for<br />Its own sake both and its<br />Blend of vast tax cuts social will have<br />For Trump’s legacy It.", "This could be the summer of economic hell | CNN Business": "In face of on United States plus<br />East United States has<br /><br />Held its ground has held steady while rate<br />Near historic lows Stocks<br /><br />Hit fresh highs last week That<br />Could soon change, as near first<br />Is which marks end of President Trump’s<br />Pause on what, he termed as<br />On of trading those countries reach trade<br />Deals with US they could<br />Face much higher Then just<br />The that is, when could on... its debt That<br />Will occur at some point<br />In Scott Bessent said recent to leaders of US defaulting on debt.", "SCOTUS orders judges to revisit decisions on transgender health plans, birth certificates in wake of blockbuster ruling | CNN Politics": "The Supreme Court on Monday tossed of<br />Court that sided with that<br />In those cases their wake<br />Of this month that upheld<br />Ban on care, for trans youth<br />The that blocked state excluding for care<br />In health plans high court also tossed out<br />An appeals court that went<br />In state’s effort to ban<br />From sex on, their birth loss<br />For who sued those decisions will now<br />Be reviewed courts must now<br />The again, in light of... Court’s decision on June<br />That upheld ban on puberty for.", "Supreme Court agrees to hear Republican-backed effort to lift caps on campaign spending | CNN Politics": "The Supreme Court agreed<br /><br />To take up case filed by<br />Vance and other to lift<br />The cap on, how much parties may spend<br />In with candidates case<br /><br />Will be heard, in fall or<br />And have argued that lifting caps would<br />On how much may give to... could give tens<br />Of each year, to committees with that<br />The be spent on in Vance<br />And committees which helps<br /><br />The law as, of First Vance<br />Would go on, to win Senate seat from<br />And was vice say caps are... with Supreme.", "Iran-Israel Conflict: After the War, Enter the Diplomats | CNN Politics": "Last week then, of it’s time<br />To step back, and assess<br />What has changed, in East chances of into gains national what<br />Does not happen can be<br />As what does That is true<br />The with for years predicted that strike<br />Would result, in war Middle East hundreds if not<br />Of and ladder of that<br />Might control through means such<br />As militias with weapons of striking and had<br />Thought those claims were and product of as<br />Much as sound been especially true this<br />Which unfolded of power by Israel to<br />To join war its attack.", "Iranian hackers could target American defense companies working in Israel, US agencies warn | CNN Politics": "In are at risk of agencies warned<br />Based on current may target and for<br />Said from Agency of... Crime defense<br />Those possessing or with..., and defense<br />Firms are at risk said Israel have<br />For years cyber each other are that<br />With ties to could be caught<br />In was sectors this month<br />Group stole million from largest it was<br />The dropped massive bombs on... sites week US such as<br />And plants have been on high<br />For in There been hacks of..., yet but history of<br />And has senior close has.", "Zohran Mamdani wants to build government supermarkets. America already has them | CNN Business": "The become New York next<br />The has plan, to create<br />Of stores but it’s less radical than<br />Some food policy say<br /><br />Has proposed five owned stores<br />One in each New York City to offer at lower to customers with<br />To some New York more than<br />Of are food has been blasted as style<br />And John owner of New<br />York chain threatened to close<br />Stores if is, for but is... on and models that States<br />Such as for that lease space<br />To and chefs, and stores rural such as<br />Paul Atlanta is opening two.", "Why do brides wear veils? | CNN": "One of oldest of bridal at least<br />As far back, as Greece veils<br />Have remained, for most modern brides when<br />At Las Vegas in she<br />An ornate gown in favor of but<br />Still wore tiered veil in her<br />And when singer Gwen Stefani on<br />Frock designed by John for<br />Her that was, in shock of..., so too was<br />Her veil Over bride her<br />Look with on top her lavish in Venice on her<br />Gown at her veil to head<br />Like crown to Vogue At her<br />In Queen swapped, her robe of... state in favor of white<br />Silk gown its wide trimmed with..., of lace On<br />The day she Prince she was... not but bride.", "Bob Vylan has US visas revoked after British rap punk duo’s chant against Israel’s military | CNN": "The State has, of Bob British rap punk<br />Group who led crowds to chant<br />Death against at this past<br />The has US for members of Bob<br />Band in light, of their hateful at leading crowd death<br />Chants who violence are... not to our of State<br />Said in post on group was..., to go on<br />Tour beginning in late<br /><br />To post on State Department has visa and policy for<br />Of and ban comes took to... West Holts Stage<br />On Free leading crowds to... chants against<br />The showed rapper mic but.", "Thousands of Norwegians mistakenly told they’d won life-changing sums in lottery error | CNN": "Has of players were told<br />That they had won large sums<br />In draw due, to Norsk Tipping prize from<br />In then them, to it was... that occurred<br />And were by than divided by said<br />In Norsk Tipping sent messages push<br />To that showed wrong before<br />Norsk sincerely to who<br /><br />Was of prize it said blamed<br />The on manual No<br /><br />Have been paid wrong prize it<br />In on Saturday Norsk<br /><br />For am terribly that<br /><br />We have so, and that people are angry with us<br />Said in statement have many from people who had.", "LeBron James: After picking up $52 million player option with the Lakers, what does the future hold for superstar? | CNN": "The this is, to be where<br />James will be next picked up<br />His to with Los his agent Rich Paul<br />Told on has reached out to... Paul and Lakers for comment of league<br />He is entering his<br /><br />James remains games last he<br />Points and as lost in first<br />Round of but on with Lakers for one<br />More where will be his trade<br />In doubt Speaking to James’<br />Left door open to all<br />Wants to for Paul told he<br />Knows are building for future he that<br />But he values chance of... it all We.", "Ayatollah Ali Khamenei: Iran’s supreme leader faces his greatest challenge | CNN": "For four Leader has crises and war<br />But strikes by, and United States on<br />Mark his greatest yet What<br />He next will have huge for<br />And rest of East but such<br />Is cost of, his are few<br />It’s huge test, for in health<br />With no of on regime<br />But it struck at heart of... its Guard Corps<br />Key force suffered loss of... string of seasoned where was<br />Were severely and key<br /><br />The advancement were regional armed<br />Groups were weakened by billions spent on<br />His regime’s were lost days.", "Two people rescued after going overboard on Disney cruise ship | CNN": "Two guests said, to be father and his<br />Young have been by crew after while Disney Dream cruise<br />Ship as it, from around<br />The Bahamas that rescue on June<br />That both were, to ship minutes of entering posts<br />From on board that pair were..., and his young<br />The is said, to have jumped<br />In his daughter she fell<br />From ship It’s, how she ended up crew<br />The Dream swiftly two guests<br />From said statement to We<br />Crew for their skills and prompt<br />Which ensured safe return.", "Wimbledon: Record heat has players and fans trying to keep their cool amid scorching conditions | CNN": "Baked in its day on Monday but London heat stop<br />From on show on grass Even near grounds<br />Rose to Celsius to... Met surpassing for warmest day grand<br />Slam’s Highs of, or degrees<br />Are expected on Monday and Tuesday day history on<br />For those toiling on court<br />The conditions were brutal Tough Really tough Germany’s told<br />In heat think one thing that<br />Helped me is, to know my<br />Has same as me was sweating lot so<br />My was very It’s first<br />Time with heat on grass feel.", "Rob McElhenney is about to make it easier to pronounce his name | CNN": "The Rob name has been source<br />Of amusement for while<br /><br />So much so, in his friend<br />And wrote song it up but<br />Give it try Mack of Mick<br />Then does trick wife sang on... song so get<br />The name show man some damn<br />Now It’s Sunny in has<br />Filed to legally change<br /><br />His name to Rob Mac to..., he and Olson who costar on also own bar<br />Called Mac’s Tavern nod to..., his name on<br />The show as, and is into of world<br />And in which, my name is..., to pronounce<br />I’m just going by Rob."}