{"China bans Wells Fargo banker from leaving the country | CNN Business": "For Wells has<br />Been prevented from leaving the latest that threatens to Western of visiting world’s<br />Said the exit ban placed<br />Wells Mao incident part<br />Ms Mao China in criminal case<br />By Chinese<br /><br />Who have lawfully on<br />For the Ministry of<br />Said press conference It’s<br />Not clear target of criminal case<br />Nor how Mao<br />Be linked exit it to<br />Law the case<br />And Ms Mao<br />Leave the country and is<br />For of Foreign said During the will<br />That her legal rights are<br />Mao has been.", "Venus Williams wishes sister Serena would come out of retirement to join her in competition | CNN": "As prepares<br /><br />Make her tennis at Open more than<br />Year away<br /><br />Sport she has<br />Looks as as did her crushing huge that<br />Such for after so is<br />There Serena on cards<br />Mean keep saying to my<br />Team thing that<br />Would make this<br />If she comeback here’ like<br />We did so<br />Course miss comeback told of<br />Per the Press<br />But if Venus comes back<br />I’m sure she’ll<br />Let know Williams went on<br />Tell reporters that her<br />Joined remarking at well<br />Still the ball.", "What to expect as Harvard takes on the Trump administration in federal court | CNN Politics": "Will be back<br />Court for hearing in its<br />Fight case Trump<br />Next step battle more than<br />For research<br /><br />By the White<br />House this spring<br />Judge is over hear oral from legal team lawyers for of<br />School’s request<br /><br />That she funding freeze it<br />Marks for arguments clash<br />And belief<br /><br />White House that<br />Most elite<br /><br />For Trump Harvard has warned<br />That the Trump<br />Freeze has put<br />And research<br /><br />Risk and that.", "Barcelona is shutting two of its cruise-ship terminals to cut tourist numbers | CNN": "Port is to close two of<br />Its as part<br />Fight the problem which will<br />Bring the number of terminals down<br />Five when closure takes next<br />Year is part<br />For to passengers move<br />Which the council says is<br />First step plan<br />Will the port<br />Make cruise more<br />For example by ships<br />Green supply<br /><br />While they of docked their engines can be<br />Switched off cutting the plan<br />Will in council it is<br />Part of wider to deal<br />Where to mass<br />Has been rising in recent years which.", "Starbucks reveals when it is bringing back the Pumpkin Spice Latte | CNN Business": "Might be coping with heat<br />But is getting for chilly fall temperatures with<br />Its most annual it<br />Could use boost<br />Chain revealed<br /><br />That its wildly Spice beverage will<br />Four days later than last<br />Year’s release<br /><br />Date and drink’s<br />Since this year’s<br />Marks the earliest date<br />That has date<br />For the Pumpkin Spice as<br />Fans call Pumpkin is best<br />And could be<br />Hit that could<br />Use to help<br />Turn its business has struggled the past<br />Years with slumping sales growing to point.", "A couple were accused of having an ‘illicit’ relationship. Their community allegedly shot them dead | CNN": "Have made multiple were<br />Broad on orders of tribal for having the latest in country last month<br />And persistent of such<br />Crimes across<br /><br />Parts of Central and South<br />Where and members they can<br />Through at least<br />Have been since<br />Went on social chief minister said<br />Shows about<br /><br />Men surrounding in desert her head<br />Wrapped in shawl<br />Can be seen<br />Front of one<br />As man follows her watched<br />By the group<br />You are only to fire at me<br />Else she can.", "Israeli tanks roll into Gazan city of Deir al-Balah for first time since war began | CNN": "Tanks on Monday rolled into part of<br />That has not<br />Seen ground war<br />Aid and witnesses to<br />Its said had<br />Said the had<br />Ground maneuver in southern which had<br />Been preceded by aerial strikes<br />Last night Army said that<br />This stage only one it<br />For weeks Radio ordered the area of<br />Square and dropped<br />Said the to great force terrorist it<br />Its in this<br />Where it has<br />Not before<br /><br />Has that been<br />Past to carry out ground<br />For fear has who may be.", "How much do Republicans care about the Epstein files? More than it might seem. | CNN Politics": "One of biggest Trump’s second term right<br />Now is how<br />Much his truly care Jeffrey files caring lot vs is critical could<br />Mean sustained<br /><br />For the president that<br />Bleeds the former base latter would mean<br />This is likely more than<br />That fades so<br />Now that had<br />Chunk of time<br />Since the Justice their how<br />Much do care<br />All of new<br />Polls show nothing how Trump<br />Has this scandal and it<br />Could be problem for base<br />Split on actions of than.", "NASA workers rebuke ‘rapid and wasteful changes’ at agency | CNN": "Group of scientists has<br />Cuts grant culture of silence that they<br />Say could pose<br />Risk to safety the document who<br />Lost their lives<br />Past is astronauts Sean<br />Staunch Trump loyalist who<br />Top role NASA the letter has public at least<br />Shifts at NASA must be<br />So that risks<br />States the letter to Duffy of Congress and who<br />Serves as last<br />Six months have<br />Seen and wasteful which have<br />And caused changes the letter to Technical of<br />Checks and balances at<br />Wake of shuttle that killed.", "Jess Carter: England defender steps back from social media after racist abuse, team condemns ‘online poison’ | CNN": "Jess says she will step back<br />Said she has<br />Lot of racist since Carter has started all four<br />For as team<br />Has reached stage<br />Where the of win their second while feel<br />Fan is to their opinion on or<br />Think it’s to race the said<br />As result<br /><br />This will be<br />Step back from it to team<br />Deal with Carter that she<br />Bid to keep<br />Team can Hopefully out<br />Will make people this think<br />Twice so others won’t have<br />Deal with writing We have<br />Made some changes with this.", "Ellen DeGeneres says Donald Trump is the reason she left the US | CNN": "Has confirmed<br /><br />That she to leave the States<br />Trump as well<br />As addressing the toxic work culture at her<br />Show according to British the her<br />Wife de Rossi moved to<br />Bought what media thought<br />Would be house<br />Told crowd of the town on<br />By the Guardian We<br />Got here day<br />And woke up<br />Lots of texts<br />Friends with crying and was<br />Like got However said<br />And we’re like<br />Here’ has reached<br />Out to White<br />House and for<br />Come week after she showed.", "US Marines mobilized to Los Angeles are being sent home, Pentagon says | CNN Politics": "Who were last<br />Month to Los<br />Sent home to the said Monday With Los<br />Has directed the whose<br />Sent clear message will not<br />Be chief spokesman Sean Parnell said statement on Monday that their<br />And were order last week<br />That of Pete<br />Had released<br /><br />Guard with Infantry Team<br />June and federal There<br />Still another Guard soldiers to mission who were<br />June This story is breaking and will<br />.", "Charli XCX is the anti-bride | CNN": "While evolving trends have<br />Made suits bright<br />And more common the image of woman in princess gown is<br />Still in western but on<br />Proved that going of style<br />It’s the At east Brat singer her drummer George Daniel in the<br />That was faithful to her<br />Girl style married dress most<br />Worn from mini most recent to out<br />Friends she donned<br />Pair of Jimmy Choo court<br />Heels but necklace or bracelet and wore<br />Just her ring<br />And two small<br />Hoops in Festival ears.", "This week’s big questions: Can Trump finally quell the Epstein storm — and is it hurting his presidency? | CNN Politics": "Trump seem to think his angry and efforts end storm<br />Sex offender will work<br />Warned in social post that<br />Will be good<br />What he claims<br />And the media by<br />Trump’s defensive his aides’<br />Quell they fueled the over death prison and client list but<br />Trump’s Truth Social post raises Will which<br />Most of questions since it<br />Set the president his<br />Own base be<br />By new over Trump’s past<br />Ties to tangles sex or<br />Two weeks important will<br />Its Wall Street.", "Bruce Springsteen made a surprise appearance at a Zach Bryan concert | CNN": "Boss performed<br /><br />Who has known<br />As his heir<br />Bruce surprised<br /><br />Zach night at East New Jersey to video shared<br />By on social One of<br />Men to ever New Jersey Bruce Bryan said as<br />Stage the two<br />By of Kings<br />Song Atlantic from his<br />Joined for City song Bryan’s style has<br />Been compared<br /><br />And the pair<br />Last performed<br /><br />Last at Bryan’s in Bryan is hailed<br />Scene for concert tone mix<br />That with folk<br />Way believe.", "Car flies through air, landing in barn roof in Germany, seriously injuring two | CNN": "Said that several were<br />When car veered<br />Off road hit<br />Boy on went<br />Barn roof people its side<br />Said that car<br />First collided with parked<br />Town of broke<br />Through hedge drove<br />Where it hit<br />Boy the car<br />Then went over ground it<br />Air and ended up crashing the roof<br />Barn about<br /><br />Off the ground<br />Boy was injured the statement said driver the man<br />And his wife<br />Two sons ages and passenger were<br />Board who like<br />As well dozen and two.", "‘The Sopranos’ shared studio space with ‘Sex and the City’ but not meatballs | CNN": "Some delicious lore During of her<br />You recalled<br /><br />When her former show Sex<br />And the City shared space<br />Days with popular who<br />Played on Sex<br />And the City has role<br />For the Just<br />Like revealed<br /><br />That while two<br />Shows were neighbors at Queens<br />New York only went so<br />Far Remember that middle of it<br />Had been bread<br />So it really asked her<br />Guest who Davis both Sex<br />And the City would have<br />And Sopranos’ would have<br />Craft which stages like going to best.", "Will AI really decimate human jobs? Tech industry insiders are split | CNN Business": "Have that will<br />Take their jobs<br />For as long<br />As been but<br />Those fears have<br />Felt more than<br />Past year as<br />Has begun<br /><br />Way work those<br />May when he warned could spike<br />Jobs to over the next<br />One to five<br />Years are AI to do<br />Some of work<br />Done by Meta and are<br />Code among<br /><br />Tasks and Microsoft ranging to have<br />Warned their human will shrink<br />Some of those<br />Dose of AI is so<br />Good it’s going to put<br />Out of jobs.", "Pepsi is making a bold bet that prebiotic sodas are here to stay | CNN Business": "As shun soda brands for<br />Lure them back<br />Its On Monday the is<br />Its called Pepsi the builds<br />Off its its brand entrenching in trend<br />Been hit itself Gen new<br />What is for<br />Needs Ram Krishnan of US told This<br />What’s next Pepsi hopes new<br />Which said has<br />Out of favor as are<br />And hydration drinks can<br />Shares traits CEO no<br />Same amount<br /><br />Grams of cane<br />And the same<br />And grams having the that<br />Has propelled<br /><br />Firm the new.", "Beef prices are the new egg prices. They’re soaring | CNN Business": "First it was eggs now it’s<br />Beef the last<br />Time at grocery store<br />When eggs reached<br />Since then egg<br />Have the deadly flu was<br />And producers built back<br />Now beef prices are hitting since to<br />And for pound<br />June’s consumer price index showed steak<br />And ground beef<br />Up and over the last<br />Year but lowering beef<br />Will be harder than lowering price<br />Eggs Beef almost way more<br />Than eggs said<br />Chief at Wells<br />Still the West’<br />Egg is more.", "Six months into Trump’s second term, John King finds voters ‘All Over the Map’ | CNN Politics": "And live on sides of Trump<br />That defines<br /><br />And divides<br /><br />Has made over the first<br />Six months is said in Iowa she<br />Grades the first<br />Six months of Trump’s new term<br />Nine out of was the grade<br />By professor in his<br />And in charge<br />Harm of life<br />Take at six<br />Months their polar one big<br />All the Map<br />Black or white<br />Views of Trump<br />That the now<br />How most voters view his<br />Those who voted for Trump<br />How New Hampshire Trump voter his standard of living since to<br />White House Lower costs Less.", "Someone has eaten artist Maurizio Cattelan’s $6 million banana – again | CNN": "Fresh banana taped to<br />Wall has been<br />By to France<br />Piece was eaten by at<br />Metz in eastern France on<br />Team and calmly to gallery said<br />Few it said<br />That the is on according to Metz<br />Said the artist was that<br />Had considered the fruit<br />Be the eating skin tape<br />That held of place as well<br />Has not filed<br />And the knowledge that art<br />Said This systems not first<br />Time the has<br />Been in Art<br />Art fair Florida grabbed<br />Wall before.", "For Chicago small businesses, ‘the pope economy’ is good | CNN Business": "Boost from pope<br />Since Pope Leo in May<br />Globe have worked<br />Stamp his likeness on from<br />Cold pint of beer but frenzy to own<br />Pope’s might be<br />Where grew up<br />South New can<br />Boom for certain said Elliot of<br />Small in president need<br />For types Richardson think<br />Will be able to on<br />That and more<br />That are better for bars<br />And said Richardson With<br />Church some small<br />Have sprung into to cash<br />Brent owns Burning Bush Brewery on<br />North side menu touts named.", "Malcolm-Jamal Warner, actor who starred as Theo in ‘The Cosby Show,’ dead at 54 | CNN": "And who rose<br />Fame as child<br />As on Cosby Show has<br />Died according to source<br />Close to actor he was<br />Died in drowning where he<br />Source said has<br />Reached out Rica for Warner of New<br />Age in shows<br />Like Fame native was young<br />Teen when further was cast<br />As the only son of<br />Bill in Cosby Show which<br />Ran from Warner on legacy of<br />Fact that Cosby Show for<br />Black and White<br />Black class which<br />Has been since<br />This but as<br />Not til it’s.", "Extreme weather caused by climate change is raising food prices worldwide, study says | CNN Business": "Caused by climate change is<br />Up the prices of basic food products and posing risks to<br />New has found<br />Cost of wide<br />Range of goods<br />Saw dramatic spikes recent years due<br />That were so<br />All to study led by<br />Kotz of Center have how<br />High have cost<br />Food produce<br /><br />Long term by<br />Yields and hitting chains new<br />Looked at countries the world<br />Where spiked short<br />Term as studies heat drought<br />Or between<br /><br />And in South<br />Last September than following price.", "Wyndham Clark feels ‘terrible’ about Oakmont locker damage and says he will make good | CNN": "Clark said he feels about<br />And that he wants to make<br />Good with country club US site president John<br />Lynch sent members last week<br />Clark would not<br />Be allowed<br /><br />Back on property he<br />Paid for got<br />For his anger were not<br />Room but Media leaked<br />Feel with what<br />I’m can letter try to<br />Clark said after he shot<br />Round and tied<br />For fourth British We’re trying to keep<br />And the I’m<br />We can get<br />Past this move<br />And hope no.", "Bangladesh: At least 20 killed as air force jet crashes into Dhaka school | CNN": "Air Force jet<br />Crashed in capital on<br />Least according to deadliest air<br />Crash at School<br />And in northern the Armed<br />Said Most others the injured are students who being in capital were<br />When the jet<br />Hit the campus time am<br />Fault according to state<br />News the armed<br />Plane’s made every to<br />More location the said<br />Those killed Press<br />Have launched effort the cause<br />Crash Scores into rushed site<br />Where crews could<br />Be seen trying to smoking of jet<br />Day of mourning and special prayers News.", "Western nations slam Israel’s ‘drip feeding of aid’ to Gaza as health ministry says 1,000 killed seeking supplies | CNN": "Have slammed Israel for<br />Drip aid into the Gaza Strip as<br />Health in said<br />That more than<br />Have been killed<br />There since late<br />May the health<br />Did not of the deaths but<br />Most occurred<br /><br />While were making their way<br />Aid sites by<br />And Foundation which on<br />May officials and witnesses have<br />Said the is, for most of<br />Those deaths Israel has<br />Shots toward<br /><br />Crowds in some<br />And denied<br /><br />For in late<br />June the said."}