{"Dozens shot dead and injured near Gaza aid hub, as Israel denies involvement | CNN": "At least were killed and dozens near aid<br />Site run by, in on to... Health Defense<br />In that forces did not<br />At civilians while they... were near or<br />The aid site, how unfolded health ministry blamed<br />The deaths Some who had gone<br />To site claimed that had opened but said<br />There had been no at site<br />The health ministry said<br /><br />That more than had reached dozens with serious It<br />That all those killed had been<br />Shot in head, or chest number of killed<br />And field Red Cross said some.", "Two dead and 500 arrested in France during PSG win celebrations | CNN": "More than people were by<br />The League final in France<br />And two people were dead<br />And said as were planned on... Wild across<br />The French capital on... night crushed to<br />Win League for first time as<br />Of was that had been Paris which led<br />To placed custody of..., them in Paris There was<br />One when young man in his<br />Died in with chief told while<br />In Dax died, from stab wounds<br />French judicial will whether or not<br />It in can be linked to... At this stage<br />It appears, to be to... said On bus.", "‘Stranger Things’: Netflix announces premiere dates, plural, for the final season | CNN": "The official dates for<br /><br />Of beloved Things have been<br />And yes more than one show’s<br />Is set to hit in three<br />Chunks with Volume on Volume on Christmas Day grand<br />On New Year’s Eve debut<br />Dates were on Live Event<br />Where performed, as revealed<br /><br />In rest of, and will Season of streamer’s hit series for Stranger Things core<br />Cast Schnapp Caleb and Finn<br />Came out at, to about<br />Of show over near since<br />It premiered back in their<br />Brown and each joined for as.", "Dwindling ticket sales and cancellations: What’s behind the decline of music festivals | CNN": "Are On brink, of what should<br />Be another of music are shutting down trend<br />Has been simmering for<br /><br />Years in this last year from..., and Jam Florida like<br />Made in festival since<br /><br />This year more than have been<br />To one count These signs that<br />Is awry, in scene for<br />The year row, to that once<br />Sold out hours for months<br />And jam band has seen sales<br />More concern Some blame spate<br />Of on changing point to... lack of younger pay to<br />See bunch of acts you heard.", "French Open: Tommy Paul becomes first American man since Andre Agassi in 2003 to reach quarterfinals | CNN": "Paul became first man since<br />In reach of French he beat<br />On got off, to start when<br />His serve was, in first game<br />But he well back before<br />In set to take lead had<br />The perfect chance to get<br />Back on track straight away<br />When he went up in next<br />Game for Paul, to win three<br />Points in row, and then take<br />The set at third time of... points in this<br />Was of total nine out<br />Of break points, he faced kind<br />Of got to tell yourself<br />Still supposed, to hold Paul.", "Hailee Steinfeld marries Buffalo Bills quarterback Josh Allen | CNN": "And Josh Allen have tied<br />The knot Bills wed in on..., to who published from has<br />Reached out to, for star Allen have been<br />Linked since their year when Allen with Eiffel in Paris in pair<br />Their engagement on their<br /><br />Of bent on one knee during what looked<br />Like elaborate with dozens of candles and pink<br />This year said, in with Who<br />What Wear that made sure she<br />Was dressed up, for day still<br />Caught her by I’m so grateful that he<br />Did it way, he did so.", "Why working-class people of color may determine MAGA’s political future | CNN Politics": "The continued to shrink<br /><br />As share of stakes for whether can hold<br />Trump’s gains voters with Trump<br />White adults two new found<br />Those continued their as<br /><br />Of all voters in Trump<br />That decline by share of... men and those<br />Than he did, in his first<br />Two but polls now show Trump’s<br />Those below, his vote share<br />Them and his, for once viewed<br />Trump’s performance with voters as luxury for<br />By its margins White people but as<br />That bloc its Trump’s support.", "The ‘golden summer of cheap flights’: Now’s the time for last-minute deals | CNN": "Still pressed purchase on your<br />Some good news, for this hectic if you<br />Have yet to book peak summer to popular you<br />Can expect, to find lower and more<br />Than norm for this time of... year say of<br />In paired with are resulting in some<br />And domestic and now<br /><br />Might be sweet spot for finding deal Travel with tracking site Going says that<br />While it’s hardly for booking flights during peak travel times such<br />As It’s to lock in at... least three to<br />Months out from date you plan.", "How American consumers are feeling the squeeze, in 4 charts | CNN Business": "The effects, of high coupled with high<br />Rates have made it in recent years for<br />To get hits just keep coming raft of<br />Moves from Trump steep that could<br />Cause to rise, and approach<br />Have stoked driven down sentiment to<br />Some of lowest on That<br />Of and can be as business can have<br />On and broader who power with their<br />Have been to date but being spread thin<br />Debt loads are, as are of... strain are flashing red for<br />An are paying for their<br />In Among those squeeze are... loan who have.", "Oscar Piastri wins Spanish Grand Prix, as George Russell and Max Verstappen clash in late drama | CNN": "Led from start, to win Spanish Grand Prix<br />On and his lead at top<br />Of world while, to Max George<br />Clashed with just one lap left<br />In race when was to move<br />But held his line as his<br />To on corner two cars<br />Backed off being let through<br />And received, from as meaning he finished in place<br />Of fifth losing at least<br />Nine points for, in place while<br />Charles Leclerc out in third<br />Race began, when Mercedes’ had power and was<br />Forced Race safety car while<br />They recovered his stricken car forcing to bunch.", "‘Hacks’ star and co-creator Paul W. Downs on all those ‘surreal’ real-life cameos in his show | CNN": "As fourth season of Hacks<br />Came to wild end this week<br />One thing that stood out was... show’s list of<br />As themselves, from Bell Seth<br />The collection of on... Hacks is Apple show that<br />Like and Ron, in turns Hacks<br />Paul Downs who, in cast as<br />In on one, from this season that of<br />It surreal, in email<br /><br />With when we, of it was..., to tell story of who<br />Had paved way, for that followed them Downs<br />Said of his show which follows Vance by<br />Jean and her, as Vance vies.", "Kano State accident: 22 killed in bus crash in northern Nigeria | CNN": "And officials are people killed road<br />In as they, from Sports Festival on<br />Have said Others were left<br />By according to statement by government of<br />The were young it is with... heart that tragic news of<br />The which claimed lives of innocent left<br />Of State said, in On of..., and good people of Kano State our to families of<br />The deceased We mourn with... you and share<br />In your grief, he continued was lone<br />Road crash that might have as<br />Of fatigue, and excessive speed Federal Road<br />Corps said statement crash at... am time Saturday said.", "Commerce secretary says ‘tariffs are not going away’ as Trump’s trade plans face legal battles | CNN Business": "Said that tariffs are not<br />Court last week paused block on..., of Trump sweeping Trump has<br />So that even in weird<br />And where this was away<br />We just bring on another or said<br />On Fox News Court of Trade<br />On blocked bulk, of Trump’s global that president did<br />Not have to, for United States Court<br />Of Appeals, for to pause<br />The block levies next day<br />Trump’s trade strategy which<br /><br />Has some tariffs to more<br />Time to may face with countries trade court<br />Ruled exceeded his by.", "Nayib Bukele: Six years into his rule, El Salvador’s leader tightens his grip | CNN": "The world’s coolest will mark<br />Six years as El on period by<br />Which say have brought peace to... streets at high<br />Price his on crime in country that was<br />Once most violent led<br /><br />To arrest, and detention of people with little due government has<br />The move pointing to gang<br />But opponents say it<br /><br />Has come at cost of mass<br />And erosion of civil as time<br />Wore on to groups and journalists with<br />The gangs critics say On... May Ruth lawyer for human rights group<br />Who is also of was... by for stealing funds from<br />State still has not been charged.", "CNN Poll: A record share of Americans want the government to get more done. Few trust either party to do it | CNN Politics": "The has of its approach<br />With more than, in that neither can get<br />Things done or has strong new<br />By finds those doubts say they... see between<br />The two parties poll taken as public in first<br />Months of Donald Trump’s second finds share<br />Of that government should<br /><br />Be more to solve are evenly split<br />On which party best their<br />Views on role, of with of... does Amid<br />Wave of their own holds several key<br />Though with shrinking on which<br />Polls as top see and as.", "Ukraine conducts ‘large-scale’ operation targeting Russian airbases, security source says | CNN": "Has out drone strikes against<br />Of deep Russia planes to... source in Service are most<br />Strikes on Russian out by<br />Since war source said that Russian were burning en masse<br />At four hundreds of miles<br />That drones had been launched from... trucks More than<br />Were known to have been hit<br />To source bombers and one<br />Of few planes, in Irkutsk<br />Some from border with Russia and base<br />In about, from Ukraine<br /><br />Which is training for bomber force base<br />Near in Arctic more than.", "The US has long been a research powerhouse. After Trump’s cuts, other countries are stepping in | CNN": "Up in Beckman dreamed of..., for work so<br />In when Beckman got to... work at National at<br />She jumped on it was so<br />She recalled, to was dream<br />It was place, to be where<br />The months into Trump’s second term as<br />His war on top and Beckman no longer sees US as welcome home for<br />Her or her which on how<br />Like affect brain she told<br />She now plans, to move is... at in Germany France<br />Is part of wave of scientists what<br />Are could be brain drain country has seen<br />In decades, but loss could.", "Small businesses struggle under Trump’s tariff whiplash: ‘I’m so angry that my government has done this to me’ | CNN Business": "For some small last week brought<br />More twists turns, to past two<br />Months of President Trump’s<br /><br />The was with stops and starts<br />Of at different Then<br /><br />On court said Trump his most<br />Of those levies for court<br />On to pause court’s confusion has made<br />It for some small to plan<br />Told in certain they have<br />Had to changing their product their chains<br />Staff or products my fear<br />Is if this, to be like<br />The mass of small of pedal told Trump<br />The globe on, and since then."}