{"US consulting group terminates contract with controversial US-backed Gaza aid organization | CNN Politics": "Firm has canceled its with..., and aid set<br />Up to food, and supplies<br />As conditions in Gaza for Boston Group told<br />Work relating to Gaza lacked from<br />And was stopped on May has<br />Not and will not be paid<br />For of this work said partner who was<br />In charge of work with Gaza has been<br />Put on leave, while of firm’s<br />Is out spokesperson news<br /><br />Comes as nearly were killed<br />And were injured on Tuesday for third<br />Day near aid site by southern to Ministry of<br />Health and Nasser said its.", "Gabby Thomas: US Olympic champion followed and heckled by gambler at Grand Slam Track meet | CNN": "Gold said she was verbally at Grand<br />Slam Track meet, in last latest of has<br />This year Thomas who won<br />Gold in meters and at... Games said post<br />On that man, her around<br />The track while, she took pictures for fans<br />And signed shouting at her<br />Who enables him is... gross wrote Thomas post was<br />In response, to another on which<br />Of while she was on starting line shouting choke artist down Gabby made Gabby lose by<br />Her and it made my parlay win social wrote with<br />Of two bets on track circuit said statement Grand Slam.", "Tariffs are squeezing Americans. That could be good for Dollar General | CNN Business": "And are heading to Dollar but it<br />Could be warning sign for<br />The said Tuesday that sales<br />At stores open for at... least year had<br />Last discount chain raised its<br />For year We are well to... wide range of<br />Todd said on call with analysts Trump<br />Trade have stoked raised fears of..., and down sentiment to<br />Some of lowest on stores<br />Such as Dollar tend to... gain of strain<br />As their belts beat shares of... up said it<br />Had gained market share from... both among<br />Its core shopping base as.", "Supreme Court: Trump complains about Amy Coney Barrett | CNN Politics": "Trump has privately that<br /><br />The Supreme Court he have<br />Not stood his, to familiar with but<br />He has ire at his most<br />Appointee one of sources said grievances have<br />Been and while have been Barrett Trump has<br />Neil and Brett with said have<br />Gone on for at least year<br />The said anger said has<br />Been by allies on right<br />Who have told Trump that Barrett is weak<br />And that her have not been<br />In line with, how she Trump<br />Her to bench, in It’s not<br />Just one ruling It’s been.", "What makes Trump’s new portrait different from his predecessors’ | CNN Politics": "When Trump’s new was unveiled<br />It lacked two, his had featured in their<br />Back more than years expression and flag<br />In which earlier Trump’s<br /><br />In shows president dark<br /><br />With part of, his face by<br />The is being hung federal it<br />Now appears on White House<br />White House said Trump’s was taken and was<br />As new image was captured more recently is<br />The most person on planet and this<br />New his second term of... four years of<br />The official said portrait Trump wears<br />Red tie while, he is wearing flag pin.", "Trump’s tariffs will hit the US and world economies harder than previously thought, OECD says | CNN Business": "Trump’s trade war will wreak greater than both<br />In United States else<br /><br />To new by, for and Tuesday group of<br />Its growth for, to projected in March<br />And said growth would be even next year<br />The report, and around<br /><br />Trump’s as well, as their to... cause harm world<br />The on exports in net<br />And reduction in federal to<br />Slow to growth both this year<br />And next from its forecasts<br />Of and based on assumption that tariffs will at<br />Their it said, if starts raising we end.", "Dutch government collapses as Wilders’ far-right party leaves coalition | CNN": "The is leaving its policy for<br />Its said on signed up for<br />The asylum not for<br /><br />The told Tuesday and our for this<br />Ends here to, for most government Dutch<br />Has plunged into It leaves<br />The led by Prime Dick Schoof<br />With just out, of seats parliament Prime<br />Dick Schoof called, and but speaking with after he offered few on<br />His with he said that it<br />Was for government to... on and that<br />He would office new takes<br />Have called for Polls suggest<br />That were to be held would.", "Russian forces advance in northern Ukraine, within range of major city of Sumy | CNN": "Have continued to northern of bringing range of<br />Their drones to, and for area said<br />That in trying to city were constantly more<br />Of civilians were taking place At<br />The that enemy has<br /><br />Is about front line deep<br />Said he added that Russians were trying to town<br />Of within few of their<br />The said that troops had carried out shelling on settlements to<br />For its part claimed that its<br />Had of as, they front to... TASS news agency said<br />That with further would be.", "What are rare earth minerals, and why are they central to US-China trade war? | CNN Business": "The trade war with has major point rare<br />Earths Last month Trump said States<br />His threat to is with plentiful of<br />That rare earths its ice sheet<br />Trump signed rare earth deal with... rare earths current for years<br />Has built up, of as part<br />Of its wider what you<br />Need to know rare earths Rare<br />Earths are elements made<br /><br />Up of yttrium name<br /><br />Rare earths is bit of as<br />The are found Earth’s crust they... are more than<br />Gold but they are and costly to also Rare earths<br />Are in we on day from... wind to LED.", "The McDonald’s Snack Wrap is returning next month | CNN Business": "Is back cult food Snack Wrap<br />It’s back said, in words of..., his fax wrap<br />Will return, to McDonald’s on as<br />The start to year It’s simple cheese fast<br />Food removed Snack Wraps from... its in after they were<br />Too to make some locations to serve<br />The wraps when, in snack wrap<br />To jump such, as grilled chicken ranch wrap<br />In time its chief told chain<br />Want to mess with snack wrap<br />But fans never Snack Wrap<br />To bring item back to... has with fans<br />On as recently as.", "Jonathan Joss: Nick Offerman says he and ‘Parks and Recreation’ cast ‘heartbroken’ over shooting death | CNN": "Nick has spoken out shooting death of<br />His Parks costar Joss cast<br />Has been it all day we’re... just said statement to People was such<br />Sweet guy we loved him as<br />Chief Ken terrible has<br /><br />Reached out to reps for Offerman for<br />On Parks Joss played of Native tribe owner of he<br />Was shot near, his according to San<br />Were dispatched, to location on Dorsey Drive San<br />For in where found Joss near<br />The location and life<br /><br />Said was dead by responders has been<br />On suspicion of murder and is<br />Said Joss’ husband Kern de.", "Gene mutation in the bacterium behind the Black Death helped plague conquer the world | CNN": "One of bleakest in Europe was plague<br />Known as Black Death which killed<br />At least million in just<br />Five years but stop there plague<br />To keep its hosts alive<br />So it could spread and keep<br />For and researchers now<br /><br />Say discovered how is... caused by which<br />Has been human for at... least years pathogen has<br />Three plague since first AD though<br />Its years to be behind<br />Us plague Cases still few<br />Times year Asia South States<br />And more commonly parts.", "Rare 19th-century condom with erotic etching goes on display at Dutch museum | CNN": "Rare with etching nun three<br />Is on at, in Believed<br />To be made, from sheep’s dates<br />Back to is, from according to statement from on<br />Joyce curator of prints<br /><br />At museum told that<br /><br />Would have been sold at time<br />This example is mint<br /><br />She said with that it been<br />Used This fact, as well as<br />The print length, of which is... long suggest<br />That this was It makes it<br />More of object to laugh<br />With your friends than to use<br />She said etching nun can.", "Lee Jae-myung: South Korea’s opposition leader wins election as ruling party’s Kim concedes | CNN": "Lee is on course to be<br />South next president snap<br /><br />On poll showed, him ahead<br />And his main Kim of ruling race to<br />Lee in speech on time him<br />On his victory that<br /><br />He decision Lee’s victory comes<br />Six months after law plunged<br />The joint exit poll from..., and that Lee<br />Of will win, of vote while<br />Kim is to win According to national of<br />Votes have been are yet to... be announced<br />But in previous was..., in line with<br />The Addressing crowds of... Seoul Lee to<br />As with very high chance.", "Ukraine strikes bridge connecting Russia to Crimea with underwater explosives | CNN": "Said on Tuesday that it<br />Had hit bridge, and Crimean<br />With explosives in its<br /><br />Third attack on supply<br /><br />Line for forces since war<br />In said on that its agents had mined<br />The piers of road and rail<br />Bridge called Bridge, and first at... am whole took<br />Months it added said it<br />Had used of which severely bridge Traffic on bridge<br />Was suspended then shortly time scale<br />Of was not clear attack<br />Is example of that<br /><br />There are costs, to its war.", "Lost dog returns home after swimming to island in 100-mile trip | CNN": "Dog who went, for more than<br />Month and covered miles swim<br />Has been to, her home after at sea<br />In late April day after in London from where<br />She was rescued from streets<br />Sam of Rescue told Tuesday that Amber was to<br />An New Forest on April from garden fact they<br />Had surrounding their property News<br />Of escape was on social and local were pictures and video clips<br />Sent to rescue which them<br />To map Amber’s first three<br />Weeks she was miles from where<br />She had gone, but in different said.", "Judge blocks Trump from cutting off gender-affirming care for federal inmates | CNN Politics": "Judge on Tuesday Trump to..., for in federal blow<br />To by president to... pull back federal for<br />Health care All seem to that<br />The named plaintiffs do fact<br />Need Judge Royce wrote from Lamberth means that<br />The enforce this year President Trump’s<br />Which directed to its<br /><br />To ensure that no Federal funds<br />Are expended for any or drug<br />For of that, of sex Lamberth of former said group<br />Of who had been with gender and who<br />The were likely to on..., their claim that<br />The procedures they will.", "Dozens of Palestinians killed near Gaza aid distribution point, health officials say, in third day of shooting | CNN": "On their way, to receive<br />Aid from site, in have come<br />For third day with killed dozens to Ministry of<br />Health and Nasser said forces on as<br />They made their way to site<br />In Tel early said its<br />Times suspects, them from routes<br />The troops carried out warning and after failed to<br />Shots were near few suspects<br />Who advanced troops Defense<br /><br />Said in statement which also said they<br />Are reports, of At least<br />Were killed dozens to health<br />And director of Nasser in Gaza by showed.", "Peru’s plan to drastically reduce Nazca Lines park size sparks concerns over environmental and heritage risks | CNN": "To shrink its park home to... Lines by area size<br />Of fields has sparked alarm<br />And say paves way for mining and weakens of cultural while<br />The says studies and does<br />Not World Heritage or<br /><br />The site’s core not removes<br />It does so where is said<br />Vice of adding that could<br />Cause risks damage as it<br />Zones with active or pending claims Castro that for<br />The are limited This<br /><br />Is made worse by of culture’s to dozens or even of mining on sensitive zones<br />He said area forms.", "Laura Loomer meets with Vice President JD Vance at White House complex, sources say | CNN Politics": "The who once was job was... back at White<br />House where she met with Vice<br />Vance three sources with meeting tell sources would not<br />Share of meeting which Office or what<br />Was discussed did not meet<br />With Trump has, since departed White House<br />One of sources said after last known<br />To White House, in White House<br />Whom she labeled as also and deputy of<br />The who has been in Trump<br />She has line, to and has<br />Been known to, though she has<br />Not been able to White.", "Andrew Cuomo campaigns for New York’s redemption – and his own | CNN Politics": "In New York, in disgrace<br />Could end up less than four<br />Years with mayor left wing<br />And that city is on... brink way It’s<br />The soap opera of New<br />York On heels, of resurgence from brash<br />Guy from Queens, and with loud<br />Streak sees as man for moment as he<br />To be next, of New York<br />If that moving his daughter’s to be<br />To run public has kept<br />To surprise where he stays<br />Few and he gets protested or takes<br />From reporters in private to several who<br />Know him has been about.", "Man admits to attempting to frame migrant accused of threatening Trump, prosecutors say | CNN Politics": "Man who framed with to kill<br />Trump in order to have<br />The deported has now<br /><br />Been charged matter to state<br />That man Scott, to Ramon<br />Whom Scott stabbed, and robbed who<br />Was set to case against<br />Scott in with Scott admitted that he<br />Wrote on letters and charging say when<br />Asked what was through his head<br />At time of has reached out<br />To Scott’s for court has been<br />For That legal Scott could<br />Be too late, for who faces he was<br />By and Customs by false.", "Musk blasts Trump’s agenda bill as a ‘disgusting abomination’ | CNN Politics": "Musk on Tuesday lashed out<br />At Trump’s bill which is pressuring to<br />It disgusting I’m sorry but just<br />Can’t stand it This outrageous bill is<br />The tech posted on Shame<br />On those who, for it you<br />Know you did wrong You know<br />It he added in subsequent post<br />Is This is not first time<br />He has bill, in was passed<br />By in House Musk said that<br />He was massive bill adding that it<br />Would not just it and work<br />That DOGE team is White House<br />Press was asked post while briefing Look president knows.", "2 key findings on Democrats’ brand problem from the new CNN poll | CNN Politics": "New that is, in bad place<br />That mean party is doomed<br />Of doubt that lots of history its<br />In elections thus far<br /><br />But it is, for path forward and new<br />Poll conducted by into It’s worth<br />The poll which was released<br />Asked of questions how people view both<br />Most was that were more likely to view<br />The than as with strong leaders to even of change<br />To won close, to but former is notable there<br />Is such gulf two and latter is notable out<br />Of is viewed, as of change.", "These Americans are done with Trump. So they’re moving abroad | CNN Business": "And had just, in December to make<br />An enormous who both<br /><br />Work as teachers had to..., if they should<br />Take job offer to teach<br />In Morocco and leave<br /><br />North with their two but say<br />Their decision was made<br /><br />By election just weeks<br /><br />We will get, from feel like<br />The we knew it up is... fast told are<br />Part of growing of moving or making to move<br />Or to rights that would them<br />To do so Tax and told<br />They have seen, in requests<br />From help with web of needed to since.", "Job openings unexpectedly increased in April, a sign of US labor market resilience | CNN Business": "The jobs US in April new data showed Tuesday that labor yet buckling Job openings at<br />The end of up from million in March<br />To new data by Bureau of Labor Job Openings showed<br />How job openings quits<br /><br />And such as is adapting as President Trump’s<br />Kicked gear April and fears<br />The showed that not much churn<br />At all jobs, as and federal to<br />Have in their tracks with site<br />Told in Businesses are... bit more of<br />Deer in not what direction to take<br />She said were that job openings watched.", "China’s grip on the global pharmaceuticals industry is exposed by Trump’s tariff threat | CNN Business": "It’s most States used by tens<br />Of year to treat pneumonia and strep<br />Throat yet it that of that<br />Has been chronic short has<br />One in US or that<br />Of raw for its production as US Trump threatens to tariffs on throwing on critical drug<br />From abroad trade or more<br />Could to or used to make<br />It should its chain Rick Jackson and of<br />Which owns sole told Last year<br />Of pain of kinds of pain<br />All came from based on trade<br />From With US already of many warn that<br />Could this as, in trade war.", "Macron wax statue stolen from Paris museum for anti-Russian protest | CNN": "Took of French, and placed it<br />The on Monday to business ties two<br />As well as said they of... which contains<br />Of more than at am local time am<br />To he does not deserve<br />To be this, he has French<br />With and Europe reads statement took to<br />The west of French where they... placed it front<br />Of decrying trade with..., in such as<br />Gas and chemical One<br /><br />Held sign which read is business which smiling his hands<br />Read Ukraine is goes on..., to end their<br />On have struggled to end."}