{"Scottie Scheffler admits that bettors forced him to delete his Venmo account | CNN": "The strong favorite to... win golf tournament to<br />Bear Just ask who has that<br />He was forced, to close his<br />Of on his, of this week’s<br />At Club for which is strong<br />The world No, how he often hears from<br />Fans who have, in where he<br />At why had, to get rid<br />Of my was paid by people or people me bunch<br />Of when win, he told It<br />Good Asked biggest sum he<br />Had been sent, as thank you<br />The most that would send me<br />Bucks here or there That happen as much<br />As requests did has never won US but he.", "John Lennon’s ‘smutty’ love letter to first wife up for sale | CNN": "The wrote some, of world’s most<br />Love songs John love on other hand different type<br />Of and take swipe at Paul<br />For good measure One of... these is now<br />Up for auction at Christie’s in London on when<br />It is to fetch up to..., his wife Cynthia while<br />In then Lennon wrote love<br />Love you I’m you like mad<br />Wish was on way to your<br />Flat with papers and Oh<br />In complained Paul’s about<br /><br />On my head, in bunk on... top of me<br />And for Thomas head of... books and something quite poignant of letter It shows<br />Us and Cynthia as.", "Newsom and California confront Trump with a potential blueprint for Democrats | CNN Politics": "Have spent last few months talking up to<br />Trump in his term Gov Gavin is first<br />Faced with figuring out<br /><br />What up looks like and how<br />The Trump’s calling in National Guard<br />And in over will far<br />And long after this week<br />How is what has become<br />Fight on streets, and in courts<br />Few days after he was..., to Trump effort to federal grants<br />To state that can be canceled have been<br />In through their minds of how<br />What’s in could play out at... home for them<br />To briefed on signed Trump’s of... Guard alarming of power but they<br />Have been treading since then.", "Group tracking Russian abductions of Ukrainian children prepares to shut down following Trump admin funding cut | CNN Politics": "The alleged war crimes war<br />With Ukraine, of has its<br />To and US State as<br />It prepares, to shut down<br />In weeks after Trump its<br />Right now we are on fumes<br />We have two weeks of money left mostly through from<br />As of we lay off all<br />Of staff other teams our work tracking kids ends<br />We are waiting for our for to<br />Come us so that we can<br />Go attempt, to help rescue kids Raymond of Lab<br />At Yale School, of Health told<br />The Ukraine led by Lab<br />Has collected more than.", "Members of Congress reported flurry of stock trades in the days around Trump’s trade war announcements | CNN Politics": "In days President Trump<br /><br />Paused most of on he had<br />In more than were tied to... worth of stock<br />As stock market of filings shows Seven and three<br />Stock transactions made on... two days Trump<br />The pause to by Trades by<br />The financial firm which<br /><br />Tracks financial That day<br /><br />Post on pause was already stocks sending state of<br />The next day on eve of... Trump’s reprieve<br />And four were tied to filings show White<br />House that day it would hefty on China and closed<br />At its lowest so far.", "As Trump’s ‘two week’ deadline for Russia expires, he faces a series of unresolved foreign conflicts | CNN Politics": "Two weeks after Trump set<br />For of his, to end conflict in he<br />Says he is, to believe<br />Care about cost of his<br />War I’m starting to think<br />He Trump said, when asked whether of his<br />In Ukraine week admission made New<br />York Post this week Trump to... face in brokering deals<br />On he once said could be<br />He now less, in deal with... days ago<br />He believed talks were right<br />And to end war in Gaza have been<br />With Trump’s Prime, while Trump did<br />Find success this week working out with<br />To roll back some of punitive each.", "USMNT can’t seem to win a game with the 2026 World Cup one year away | CNN": "With exactly one year<br /><br />To go start, of World Cup<br />Things are not, to plan for<br />The Men’s National Team<br /><br />The by US and is..., to new era of men’s<br />In United States chance<br /><br />To prove on world stage very best teams<br />On but if are to go<br />By World Cup, in months could<br />End up bleak was laid bare<br />Night was thrashed by in Nashville game was<br />With its fourth goal Those fans<br />The let their be heard with... boos around<br />Park Make no is side with..., of top class.", "US citizens and legal immigrants would be impacted by bill to keep ‘illegal aliens’ from benefits | CNN Politics": "House are touting that their<br />Tax and spending cuts package would kick<br />Off assistance one of... Trump’s top House<br />Mike has that bill would stop<br />From tax portion of package has section on benefits from<br />And House crafted to food<br />Stamp for aliens won’t<br /><br />Be as heavily by<br /><br />The they can’t all assistance say Those<br />More in danger of losing some benefits are<br />Of as well, as who are..., but whose parents may be<br />Or have various It’s<br /><br />Part of said, of health justice at National Law.", "AerCap, world’s largest aircraft owner, can now claim over $1 billion in insurance over jets stuck in Russia | CNN Business": "The world’s largest can more<br />Than in jets stuck in Russia since of<br />High Court ruled, though that is... less than roughly it sought<br />The court ruled, in dispute<br />With in one, of disputes<br />Heard in London which had<br />On jets some with of up<br />To though settlements on... first day of<br />The October have whittled down Judge<br />Said in summary of..., his that were<br />Lost and that loss occurred<br />On March when piece of Russian banned export of Russia That meant<br />The could money lost from..., their war risks.", "Musk called Trump Monday night before expressing regret for harshest criticism of the president | CNN Politics": "Musk called President Trump<br /><br />Night two sources told saying that he<br />Some of his posts about<br />The their very last week<br />The call with which just moments came after Vice President Vance<br />And White House chief of staff<br />Wiles spoke by phone with Musk<br />On when which three discussed<br />The feud Trump, and tech two<br />With discussion told Musk<br /><br />Backed off from, his attacks<br />The phone calls, his most critical posts<br />The one to, and another with that<br />Trump should be On Musk went.", "US foreign aid cuts threaten decades of progress on driving down malaria | CNN": "Cuts to are, to host of... whose is at<br />The run by have child who<br />Is sick he has had for<br />Week and few days now told<br />Of her son whose she is... caused by illness she is<br />Of disease, she said I’m<br />Cold feel bitterness my<br /><br />Mouth is out, of work said<br />She can barely food much<br />Less for her, and her baby is curable but<br />It still claims, of lives world<br />Each year Infants five pregnant are most<br />To die from It’s cause of... death in Congo which bears<br />The world’s burden to World.", "UN launches a rescue operation after 8 migrants die off Djiboutian coast | CNN": "The UN agency said<br /><br />That eight migrants died others were missing they were<br />Forced off boat near coast for<br />Or in statement said migrants were part<br />Of group of who were forced<br />By to boat, and swim to... shore on June<br />The were found, in by teams<br />And to migrant and are... with search rescue to find<br />The life lost at sea is... that should never said Frantz<br />For East Horn, and Frantz said<br />That were forced by who show<br />No regard, for life Thousands of migrants from African South<br />Life in Europe year Smugglers pack vessels full of<br />To risk their lives to reach.", "Macklemore’s Seattle home reportedly burglarized | CNN": "Are break at home belonging to rapper to Times<br />The linked of home which said<br />To has reached out to for<br />For as nanny for children in house<br />Told that she had put kids<br />To bed when, she saw two<br />Men from door one of them<br />Doused her with bear spray to... there were two<br />Males suspects, and one of..., them held her<br />To ground while, they of dollars of items were for<br />The was able to get<br />Free and call states suspects<br />Fled was able to three<br />In home were Times that incident man.", "Trump is hyping a case to use American troops on domestic soil | CNN Politics": "As Trump is case to use<br />Troops not foreign but at... home to bolster his mass<br />Sweeps but Gov who heads state<br />To with taste, for unchecked<br />Says of peril is at... hand for US in with<br />Stark Trump is, of and looting and Los<br />And that to keep safe ready to soldiers Trump falsely claimed on<br />That if failed, to dispatch<br />The Guard US Marines<br /><br />To Los Angeles it<br /><br />Would be burning to ground<br />The warned that, he was looking Los Angeles as<br />And states those run by brace.", "Kristina Khorram, former chief of staff to Sean ‘Diddy’ Combs, takes center stage in trial testimony | CNN": "The Sean Diddy Combs trial is shedding new light<br />On who worked with him is... known as former chief of<br />Staff of Combs known as Combs<br />Who last week, to court as<br />An Combs has been name his<br />And in by, for she has<br />As who knew Combs well crimes<br />In has been, of Combs drugs<br />State Combs’ Cassie for helping of Combs<br />Has not been called to thus<br />Far in trial has not<br />To as to, she will has<br />Reached out to, for regarding made her<br />In court to, her called Combs’.", "Trump says he plans to phase out FEMA after 2025 hurricane season | CNN Politics": "Trump said Tuesday that he<br />Plans to phase out this year’s<br />The his plans, to dismantle and shift<br />For response, and recovery states We<br />Want to wean off of FEMA and we<br />Want to bring it down to... state Trump told<br />In should be, to it frankly if they<br />Can’t it then, they be governor Trump<br />That will start less aid for<br />And that funding will come<br />From and projects this year’s<br />Which ends on, to be deadly for months<br />Trump and Kristi whose FEMA have vowed<br />To it as, and those plans.", "Children swept away in school bus among at least 49 killed in South Africa flooding | CNN": "At least people are dead<br />Hit South Africa whose<br /><br />School bus was swept away<br />The extreme said cold front<br />Has ripped parts, of South Africa rain<br />And snow triggering floods<br /><br />In Cape one, of have forced<br />Out of their homes and road<br />To provincial on Wednesday state that<br />School bus was swept in village on Tuesday while en<br />Route to school said that people their driver and his<br />Were on bus four of those<br />Have been to be deceased<br />With and of Cape premier.", "Miley Cyrus ‘lost everything’ in her ‘Bangerz’ era | CNN": "Does not look back on parts<br />Of her past, while appearing on recently of<br />The Reclaiming with Monica pop<br />Star talked how, her persona her album her life<br />At time Having been as<br />Child star on hit Montana her more<br />Caused she said That was time<br />Where just got hit so hard<br />She told was, so embarrassed It got<br />To be so bad she said<br />Her and sister want to... go to school<br />Of how they were to be<br />To her Cyrus said that<br />Caused her guilt, how hard it<br />Been to be, my or my.", "Inflation rose less than expected last month despite Trump’s tariffs | CNN Business": "Rose less than, in May month<br />When effects, of were starting to more<br />Rose last month, while rate to... notched in April to latest Price Index by Bureau of Labor is welcome news for<br />Worn down by cost of living and who<br />Are of whether will drive<br />That while tariff in latest was lightly with of<br />Price hikes weaker May’s readings came better than had<br />That gas prices would keep<br />The rate check, while became<br />Less Forecasts called for monthly rise for<br />The on annual to... was good said.", "Trump can revoke national monument designations, Justice Department says | CNN Politics": "Trump has broad, to revoke<br />Land as national by<br /><br />Past Department said new<br /><br />The May legal from Justice found that<br />Can move broadly to cancel Act cannot be from<br />The could serve, as to vast<br />Of land from Trump’s wants to..., and such as<br />For oil gas, and for coal<br />And on federal lands<br /><br />For Act power to carries with it<br />The revoke states if President can<br />That his was wrong regarding of one<br />Such on given there is..., him from that<br />His was wrong all such objects on given two national by.", "Nintendo Switch 2 sales set a record in four days | CNN Business": "That it sold more than million Switch marking new for<br />The said that it’s sales level for any first four<br />Days of puts, in good shape<br />To meet its goal of selling Switch by<br />The end of next March We<br />Are for their, and to see<br />The fun they are already with Switch<br />As they new, and games that<br />Bring friends family new<br /><br />Ways said Doug, of and chief<br />In press has swirled device<br />It’s first major launch since<br />The Switch eight years ago<br />The Switch ended up selling since its.", "Police seek answers as Austria mourns victims of one of the worst shootings in its history | CNN": "In were hunting for clues<br />On at his high school day<br />Nine and teacher in deadly spree that<br />Stunned Scores of shocked near scene<br />Of crime to one of worst<br />School in history they... had searched home<br />Of who school, in police<br />Told that officers had<br /><br />Bomb note video at... home We have<br />Out search at home of district of have<br />Been to that there was note<br />Both in digital form<br /><br />And in form told that items had been<br />To assess, of who died.", "Trump’s China ‘truce’ is nothing of the sort | CNN Business": "At long last States has reached<br />Trade agreement with China war of<br />Words that into on key<br />And Chinese this week met<br />In United with singular goal<br />Find way to what they had<br />To month earlier It<br /><br />The top trade have accomplished that On<br />Night both Trump said they had<br />To consensus they reached<br /><br />In May trade truce would be<br />Sent to their, for their Businesses Wall<br />Street will no doubt breathe sigh<br />Of relief have raised easing trade barriers world’s<br />Two should lower costs help.", "Trump tells Netanyahu to end Gaza war and stop Iran threats, source says, as US ramps up pressure on Israel | CNN": "Trump told Prime, to end war<br />In and stop talk of on..., to source with<br />The two leaders spoke on... phone on Monday Trump later said call<br />Went well very smooth call<br />For to change course comes as<br />For deal with, and engages in talks<br />With in Gaza has reached<br />Out to White House for comment his top<br />Night there was some in deal<br />To his office of meeting was to<br />Give updates on and next<br />Steps in day Sa’ar said there<br />Had been recent in talks<br />That aim to bring back hostages held.", "Summer McIntosh: Teenage swim sensation continues blistering form with second fastest 200m butterfly in history | CNN": "Was away, from third world<br />In week at, in time of... race just off<br />Liu world of set back no<br />Had within, of mark which<br />Was set just ban on super suits had<br />Long been who more than seven of swimmer in second has set<br />World records, in and medley this week<br />It’s fair to say is putting one of<br />Great meets rate this race higher than my<br />Ones said per would rate it<br />Than IM just this world is... one to get<br />In my personal with... low tonight<br />Know if it was because.", "If you annoy Trump, he can annoy you back equally, Howard Lutnick says | CNN Business": "Back in Washington two<br /><br />Days to trade, in said Wednesday that Trump<br />Gave his team, to back off<br />Its aggressive stance China to get<br />Deal done told, in his first<br />Since announcement of trade<br /><br />Late night that, of two days<br />With his world’s two are better place now<br />Of past month Both accusing one of<br />The terms of deal agreed<br />In Geneva last month<br /><br />Had restrictions on various goods<br />The Chinese had these magnets and they<br />Were it when, they deliver we put.", "Aaron Rodgers says continuing to play football was ‘best for my soul’ as he reveals he’s now married | CNN": "Months of Aaron signed deal<br />To become last week set<br />Up another in his<br /><br />Hall of Fame with in bring<br />Bowl success back to which<br />Has gone years Vince Lombardi and years<br />Since their last, in it was..., and Green Bay<br />Who beat Steelers in their<br />Last Bowl On, his first day<br />Of on Tuesday said that<br />The league still it’s what he<br />Wants to do need it for<br />My need it, to keep playing told lot<br />Of decisions that made<br /><br />My career, and life from..., if they turn.", "Federal appeals court wrestles with Trump effort to fight hush money conviction | CNN Politics": "Court in New York with President Trump’s<br />Claim that his hush conviction should be<br />By courts seemed, to idea that Court’s<br />May weigh favor It seems<br />To me that we got very big case<br />That created whole new<br /><br />World of US Judge Myrna who was<br />To bench by Joe said at... one point during are not<br />Clear at this point At issue is whether Trump can<br />Move his state court case on... counts of business to federal court<br />Where he hopes, to that Court’s<br />Last year by, him from former White House.", "The New York Times is changing the recipe behind its iconic Dining brand | CNN Business": "The New York Times on Wednesday to its<br />Beat appointment of two<br /><br />And expansion is also more turning its gaze<br />Point for section that has<br />Long been of New York City scene Times<br />That Rao will be its new<br />Chief in naming two top<br />Food first for Times ambitious growth for<br />The beat as it tasks pair<br />With this moment in dining news comes<br />One year after Pete Wells<br />The Times’ food who served up<br />For years shared that he was... down from his<br />Role beat has long been major draw for.", "Americans voted for deportations. They didn’t necessarily vote for this. | CNN Politics": "There is wisdom Trump troop<br />That scenes Los It holds that<br />Want to immigrants that<br /><br />Means they with, and won’t care<br />That Trump is steps in National Guard<br />For first time, in years to..., for mass White<br />House adviser on he<br /><br />That in Los are to It’s<br />Worth this premise in fact<br />It seems that set off could<br />As could Trump’s move to troops<br />In and Customs for when<br />Backed Trump spoken his plans<br />On trail last, but they vote<br />For this We saw quite on... all discussion of Trump’s.", "Brian Wilson, music icon and creative force behind The Beach Boys, dead 82 | CNN": "Of Beach Boys, and creative force group’s<br />Surf sound harmonies has<br /><br />Died his family on..., he was We<br />Are to that has passed his<br />Wrote in statement shared on..., and his We<br />Are at loss, for words right<br />Now Please our at this<br />Time as our is grieving We that<br />We are sharing grief with... world has reached<br />Out to for life was marked<br />Just as much by with substance and mental as it<br />Was by talent and timeless songs that<br />Still across, their release.", "Trump is expected to sign resolution this week reversing California’s ban on gas-powered cars, GOP congressman says | CNN Politics": "Trump is to sign set of... this week to<br />Ban on sale, of new cars<br />Said On President Trump<br /><br />Will sign my, to reverse<br />Ban on cars Rep said Tuesday post on<br />To set its own emissions and would<br />Be another blow to... state’s to cars<br />And trucks has had to set<br />Its own for Trump reversed<br />It in his first term Biden it move<br />Could have broad, for rest of..., as more than<br />States are following rules<br /><br />The three waivers in May<br />With Gov Gavin last month."}