{"What is the Strait of Hormuz and why is it so significant? | CNN Business": "While there have been no major to global oil so<br />Far attacks on by Israel then<br />The have rattled oil futures by since<br />The start of fears could by<br />In Strait of there are few<br />As between Gulf and Gulf<br />Of Oman is miles wide<br />At its narrowest point<br /><br />It’s way to ship crude from... Gulf to rest<br />Of world its side About<br />Of oil of flow through strait<br />Day according to US which called<br />The oil On three of nuclear Brent<br />Crude surged per, to first time<br />Since before had between.", "145 people pricked with syringes at France street music festival | CNN": "French police on pricked with... street according to France’s took place<br />France with Paris at least<br />In According to ministry it<br />The which use, to arm leg<br />Or drugs such, as or which<br />Can leave to is this very from ministry told<br />On tests are done and is..., of took to<br />The streets over for de<br />La with crowds, in as Speaking to French<br />The police chief said there<br />Were three to four times as<br />In as normal of festival like<br />Warned that calls had been made<br />On for women to be.", "Inside Sean ‘Diddy’ Combs’ all-star defense team | CNN": "Nine attorneys five men<br /><br />And four women fill two<br />In for Sean Combs Some are... cross take softer to witnesses are<br />On to try, to get certain in others out but<br />They all answer to one<br />Combs himself Steel was to..., his cross of<br />Kid last month, when he paused<br />And walked over to Combs<br />At defense two men whisper Steel said<br />He had no, as another Combs’ former whose are<br />At of criminal case<br /><br />Combs on notes, and passed one<br />To his lead Marc stakes are... high Combs has.", "Minjee Lee wins third career major at Women’s PGA Championship, joins rare company with victory | CNN": "Lee won her third career<br />At on joining rare her<br />In so Lee showed to clinch<br />The at windy Fields Ranch<br />East at Frisco out her<br />With to win by three shots<br />Kim and Tour marked Lee’s win<br />And her first on Tour since<br />The It also means she<br />Just third golfer to win<br />Three Webb Jan It feels pretty Lee said<br />Feel like really this one<br />Put lot of hard work into it feel<br />Good four days, in were tough<br />For all tricky dealt with... strong wins high<br />With Lee Kim, and three players to finish par Lee.", "Brands brace for a MAHA food fight | CNN Politics": "Steak Shake chain best known for<br />Paired with burgers is not<br />The first food that comes to... mind that would<br />To by Make, or supporters led by<br />Health and Human for clean<br />Out and saying no to... food dyes seed<br />Oils among things yet Steak<br />Shake has managed to earn<br />The health blessing it would<br />Shift to using beef tallow to fry<br />Its food This spring it even at least<br />One lunch day at according to signs<br />Seen by building food groups<br />Are themselves, as fans of... with brands of<br />All stripes rushing to seize.", "Supreme Court agrees to hear case of Rastafarian man seeking to sue prison officials for cutting his dreadlocks | CNN Politics": "The Supreme Court agreed<br /><br />To take up case of man<br />To sue prison in who<br />Cut off his, while he was... case is latest that rights<br />To catch high court’s attention and it<br />Could have by, to sue government for<br />When their rights are law years<br />Who began, in for drug<br />Had religious vow years<br /><br />To not cut, his locks but<br />His took turn, for worse after at new<br />Weeks before, his release<br /><br />He officials of court<br /><br />From that prisoners to... have guards tossed.", "Inside the Bezos-Sanchez wedding plans, Venice’s best-kept secret | CNN": "Plagued by looming threat of... Jeff and former news anchor and licensed which is<br />To be lavish may be<br />One of most, and events<br />To be held, in love for<br />The remain, and guests have<br />Been required to sign<br /><br />But lid cannot be kept<br />On about, of event<br /><br />That is to take place this<br />Week At Bar that once counted its customers are<br />Some of guests mix of powerful might<br />Stop in for one of their<br />Or not will bring his there<br />As George Clooney did when.", "Who is Zohran Mamdani, the democratic socialist running for mayor of New York? | CNN Politics": "Could walk few feet at recent in Queens<br />Crowd of trying to stop<br />Him is state, and surged for<br />New York City with mix<br />Of and to on progressive with Andrew New York<br />With in one, of his videos he<br />New York voting in Hindi and likens to villain Now running as top<br />In rise has caused from his<br />His is too far to left<br />For and certain to be<br />By and national to... paint as out<br />Of touch also faced how<br />The war That was hard to... find at Thursday’s in Queens<br />Stood but joyfully side.", "Jakob Ingebrigtsen is on a mission to be ‘recognized as the best runner to exist’ | CNN": "Up and down, in pool his<br />Head above, of is being forced to<br />Take things slowly as he<br />Moves at snail’s pace around<br />The pool at, his home is..., his return<br />To track injury has<br /><br />Kept him out, of late which<br />The Olympic is on..., his seems arduous as<br />Well as small pool might work<br />Up sweat on, or his with... some calf lifts<br />It’s position he wants<br /><br />To be with World Athletics less than<br />Three months but still hopes to... gold and silver he won<br />Two years want, to do that.", "Kroger is closing around 60 stores in the next year and a half | CNN Business": "Is set to close about<br />Of its grocery stores<br /><br />To locations next year<br /><br />And half closures come few<br />Months plans for with that would<br />Have created chain That<br /><br />In two legal fight Kroger in earnings that it<br />Was charge on, but that they... would provide<br />In long term did not say<br />Which specific stores were..., for and adding will be<br />At stores Kroger said it<br />Will use money saved to... at remaining has roughly stores spanning states grocery chain<br />Said it is, from consumers back spending on dining out lifted its sales.", "Extreme day trips: These travelers are willing to make trips between countries for a day | CNN": "Fare on from Earl his wife<br />And their two flew to Sweden for day<br />This past May, to theme park<br />The caught early flight from... grabbed ride share<br />To park after in Gothenburg just<br />As gates opened at am<br />They spent day rides and shows<br />With their daughters and meal<br />At before, for at to... catch their flight<br />Home Earls’ flights cost each Add<br />To that four theme park tickets and other for day<br />And came out, to same as<br />What would have spent for entry to park<br />Near their home on South Coast.", "Health insurers promise to simplify care preapproval process, six months after UnitedHealthcare CEO shooting | CNN": "Months of top health unleashed<br />Of care industry that<br /><br />It will take, to and Dozens of health<br />Who committed to six<br /><br />Steps to make it for patients to get<br />Care according to news<br /><br />From two major trade groups<br />The Blue Cross Blue Shield formerly known<br />As Health Plans, to those with..., and care coverage for<br />These commitments will faster more to<br />And with fewer health system said for<br />These commitments will prior for more<br />And transparent while care.", "Rubin Observatory’s first images showcase millions of galaxies, over 2,000 asteroids | CNN": "The first test, from named for<br />Have light from stars and galaxies on<br />An scale thousands of while<br />The Foundation of images brief<br />Clip of Vera first imagery more<br />And built were shared on channel is jointly by National of<br />Of new images just<br /><br />Of test offering brief<br /><br />Of explore, of like never will capture more our than all<br />Said Foundation Chief of... Staff Stone who<br />Is performing of is... was of seven that have<br />Been seen our None of... found pose risk<br />To according to scientists at<br />The can be seen below.", "Supreme Court rebuffs effort by R. Kelly to overturn conviction | CNN Politics": "The Supreme Court on Monday to hear<br />An appeal, from recording who claimed<br />Stretched law sex, him Sylvester is serving for those<br />Was convicted and Act<br /><br />With to take down but that<br />Can give to seek in different types<br />Of defense told Supreme<br /><br />Court that stretched use of act<br />In how they term for purposes of<br />Told high court, if its members share common to conduct to hold<br />Would mean that rogue bad actor could be<br />As occurred here This stretches and contrary to<br />Its Court of ruled against.", "Tesla finally begins long-promised robotaxi service | CNN Business": "This but only in one<br />In for group, of fans only with Tesla in front<br />Seat It was far more modest for than<br />Musk had promised while other have this<br />Test fans still cheered launch as<br />First step Musk has since that<br />Was on verge, of providing that would<br />Change way riders get promise that Tesla would profit from renting their cars<br />To Last fall Musk debuted<br />For without wheel or pedals and he<br />Said would greatly change for<br />It most valuable on..., but start of<br />The was only of any of that.", "MGK makes rare appearance with teen daughter for whom he is a ‘cheerleader’ | CNN": "The known as Gun is fan<br />Of one of, his fans was... by his daughter for his<br />At Kids’ Choice pair made rare<br />That on red where teen talked<br />Her dad’s gives lot of she<br />Told more like hype man though<br />Yeah I’m chimed, in shares teen<br />With his ex, he spoke with... what means to<br />Him It opened up side<br />Of that needed to stay<br />To this point, he said during his date<br />With for show, her it’s easy you recently his<br />Blade with actress Fox eldest is pleased<br />With her think just good to... told Now we.", "Oklahoma City Thunder cap off incredible season with a hard-earned NBA title | CNN": "On night City what they... back in late<br />And put rest, of on notice that new<br />In town With age capped off<br />One of winningest league<br /><br />With team to win O’Brien It was<br />Tight affair, in entire and then<br />Struck for Star point guard who<br />Had been string, of wins for<br />The this went down with injury to<br />His right leg, he writhed pain<br />The floor mixture of physical his<br />To what many had it<br />Was Achilles for With..., to throw towel their injured Led by<br />And defense took surprising lead into as to<br />Wear off though, to their will.", "Supreme Court prepares to release major opinions on birthright citizenship, LGBTQ books, porn sites | CNN Politics": "From Trump’s battle with courts<br />To can be, to themselves<br />Porn Supreme Court in coming days will<br />Its most of year With most<br />Of its pending are now<br />The opinions that could<br /><br />Have profound, for Trump First<br />And of people Court has<br />States to ban care for minors that could<br />Have with Food, and Drug of..., and upheld<br />That will make it to track<br />Ghost guns Here are some of... most first argued Trump’s second term has<br />As most case will in coming days Justice claims that<br />Three courts vastly their by.", "Fed officials are starting to break rank and join Trump | CNN Business": "Some Reserve are Trump calling for lower rates as<br />Soon as Fed Vice Chair for<br />On potential of Trump’s<br /><br />On and said bank should swiftly rates to<br />The health It is time to... rate said Should<br />Would support rate as soon<br />As next meeting in order to bring<br />It to its, and to healthy is second Fed to<br />Join Trump calling for lower costs On<br />Fed said tariffs will likely in Both<br />And are Trump appointees<br /><br />For months Fed have said they..., to wait to<br />See how Trump’s shifts affect.", "Bride shot dead at wedding party in French village | CNN": "Bride was shot, to death as<br />She left her, in small French<br />In have not name her husband and child<br />Were in which took place at... am time ET<br />To were married on Saturday with<br />Guests before car to leave<br />The east of France pulled them<br />Their way with, of on board<br />The said These then got out<br />Of and started in victims with what<br />To be have been kinds of... it continues One of<br />The assailants died while<br /><br />The rest fled scene on foot<br />To which adds that another guest was<br />Said are scheduled to be.", "Is AI changing or threatening to take your job? Tell us about it here | CNN Business": "Some of Silicon top<br /><br />Have warned recent weeks that<br />Is for people’s jobs fast<br />Warned last month that could cause<br />As much as, in next one<br />To five years, and last week<br />Told his that would reduce<br />The near future Those comments have made<br />It and time, for but experts are split<br />On just how, and will job<br />Some believe these are largely hype from<br />To sell product so we<br />Want to hear, from you Is... way you work<br />Or tasks at your if AI at work<br />Is it making you more.", "Make Alberta Great Again:                         In this Canadian province, separatists see Trump as an ally | CNN": "It’s night June, and have braved<br />The haze of sports in city of Red<br />Deer Alberta team Edmonton are<br />On in National League<br /><br />Game tonight is with but<br />These here for This is rally for It<br />Might be hard, to believe<br />Sports fans’ recent of Star<br />But not all took offense<br />To Trump’s questioning of..., their in where<br />For from Canada to... be steam many see Trump<br />And whose of, their Prime Minister was<br />As his calls, to drill baby drill though<br />Some see US as step.", "Jay-Z surprises audience by joining wife Beyoncé on her Paris tour stop | CNN": "Closed out portion of her<br />Tour with extra guest joined<br />His wife Paris on night<br />To perform, in Love Drunk<br />In Love with, her as well<br />As his single in Paris and music thrilled Stade<br />De France crowd with his as<br />Tour stops had not performing and Chitlin’ Tour has<br />Been affair Blue and have<br />Joined their mom, in each show<br />The have son named Sir who<br />Is twin brother some other hits to<br />Her in Paris Last week<br />Joined in concert to their<br />Most off Carter tour kicked.", "Buy Now, Pay Later loans will factor in to Americans’ credit scores | CNN Business": "How well or, how are managing their<br />Buy Now Pay loans soon could<br />Be reflected in their<br /><br />Scores plans to launch suite of... scores this year<br />That providing what’s been<br /><br />Big blind spot on these popular loans<br />Loans can serve, as to credit cards are<br />Used by who are more flexible who<br />Want to tight spot or who<br />Are to smooth out some bigger to better meet their<br />For some of Score and FICO Score models could help<br />Serve as or lot of users are often young people who have<br />Long Ted Rossman chief credit at told.", "Trump’s bombings present major constitutional and legal questions. But it’s up to Congress to force the issue | CNN Politics": "Trump’s to bomb new test of..., and extent<br />Of war lack, of approval is on<br />The two senior told which<br />Says he has, to direct<br />In engagements to national White<br />House and Justice were both<br />In for strikes, in part on... war by Office of Legal of both<br />The is clearly well his<br />Here one former told End<br />Of but not view held by<br />Or endorsed by and who<br />Point to statement that only can war<br />The law to, for Use of... Force and lack<br />Of threat to States in war.", "Trump floats Iran ‘regime change’ even as the true impact of US strikes is far from clear | CNN Politics": "Trump’s on nuclear plants<br /><br />Was most violent of..., his two terms<br />And with Flush with spoils of..., he already seems to<br />Be with of change but of... Trump destroyed<br />And of his are far more<br />Than his bullish claims of... would suggest<br />The that damage to three<br />Sites struck by was he posted on social that hits<br />Were hard accurate raids<br /><br />By stealth bombers out of... bombs unique<br />Reach of US and its<br />Trump at if Trump’s or set<br />It back years, or decades.", "Visitor damages Uffizi painting while posing for photo | CNN": "Has at Galleries back<br /><br />It while posing for told<br />In was visiting on..., when he damaged of Tuscan prince de’<br />Which was painted some time<br />By museum said on..., in man can<br />Be seen posing in front<br />Of oil painting back then<br />Up as he touched it Pictures by local showed small<br />Tear in painting of ankle who been<br />Was to painting was from..., for repair<br />Works museum said damage was light<br />And it will be displayed<br />Soon Simone, of condemning of visitors who<br />Come to make memes or take.", "Antonio Rüdiger: Real Madrid manager Xabi Alonso backs defender’s claims of being racially abused during Club World Cup match | CNN": "Real Madrid said he claims<br />That his was, to abuse<br />The game Club World Cup on... that is Cabral clashed near<br />The end of match at Bank<br />Of North with Los two players came close<br />To one spoke, to Ramon<br />And towards was seen crossing his arms<br />In what is part of racist to gesture is made<br />When observes, or receives<br /><br />Of abuse, and is part<br />Of its to game with Real<br />Its first win at Alonso said that<br />Had told him that had racially him<br />We support, and we’ll see."}