{"Hulk Hogan’s son Nick pays tribute to his ‘hero’ | CNN": "Nick the son<br />Hulk the tribute to his<br />Died last week<br />Age of his son began<br />Post who has<br />Reached out to me and comforted last<br />Few days over means lot<br />Nick wrote caption of series him with<br />Years I’m sorry to have<br />Not responded to This<br />Has been difficult so<br />Kind words stories my dad’s<br />Life and Hearing has been<br />And my dad<br />Most known will<br />Be my hero he was<br />Most kind loving and father could ask<br />For he wrote<br />Feel so blessed.", "Keshia Knight Pulliam mourns the death of her ‘big brother’ Malcolm-Jamal Warner | CNN": "Knight has made<br />Late Knight Pulliam who<br />As child star<br />Played on Cosby Show posted to Warner the actor who her<br />Show died drowning in Costa he was<br />Knight of Warner at concert week lost<br />Big but gained<br />Love miss We<br />Got girls playing wrote caption Just prior to his<br />Death released<br /><br />Not All Hood<br />Which him Candace and Knight<br />Got about<br /><br />End of Cosby Show We<br />All to just<br />Kind of move<br />So was cool<br />Last and saying bye Warner said was<br />So cool had.", "Jean Smart signs a ‘Hacks’ fan’s arm as Deborah Vance… and it became a tattoo | CNN": "Jean Smart had<br />Write stuff when<br />Came to one<br />Fan’s unique<br /><br />Showed the Hacks<br />Star fans of the where her<br />Show Call Me<br />When one fan<br />That she sign<br />Arm with name<br />Vance of course<br />Smart’s brash character on<br />Hacks Smart looked<br />Stunned when fan<br />Told her planned<br />Arm what seemingly Smart<br />Asked her she you the that<br />And Smart worried that she<br />Might mess up<br />Vance mess up<br />Heard Smart clip<br />Then gave look.", "Haitian immigrants fear Trump’s efforts to send them back to a country in crisis | CNN": "Eight months pregnant is of<br />Who asked immigrant be<br />By out Haitian fear of<br />By came to the United States with<br />Gang in Haiti that made<br />Such as walking to dangerous One<br />App launched for<br />Truck and other in seekers to schedule at southern the country her sister for under which has<br />Live and work<br />Since struck Haiti in said<br />Still awaiting Trump’s has<br />Since revoked<br /><br />Who the country through One<br />Press in April of Kristi has sought<br />For on August with the<br />Date of This.", "Kim Jong Un’s powerful sister says South Korea remains the ‘enemy’ and there’s ‘no interest’ in talks | CNN": "South remains<br /><br />North despite<br /><br />Moves by Seoul<br />Ease along<br /><br />North Kim Jong<br />Un said state<br />North has no<br />Talks with South<br />No what is Kim Yo Jong<br />Said in statement by Central News Agency Kim’s<br />Mark North Korea’s first<br />Since the new<br />South took office on June<br />Months of over the former Yoon Suk<br />Law in Yoon<br />Said the martial law which<br />Six was leader fight North<br />South made since<br />Lee Jae how<br />South alliance with States."}