{"Indian coast guard battles massive fire on container ship listing off Kerala | CNN": "Coast guard is blaze aboard<br />Ship to sink miles off coast<br />Of as search, for four missing crew members showed flames<br />And plumes of smoke from Wan<br />That was tilting to water to Indian Coast<br />Guard Explosions were still<br /><br />Heard on Tuesday more than<br />The Coast Guard, to distress<br />Call Around time ship’s crew<br />Caused by said, though it’s not<br />Clear what caused blast Eighteen<br />Were from stricken ship with... some according to Port<br />Of Four crew Wan is managed by Wan.", "Ultrarunner Will Goodge endured hallucinations and sleepless nights during 2,387-mile run across Australia in 35 days | CNN": "The first nine days Will says<br />Felt like cycle of running and eating and eating it was<br />Time to sleep, when he did<br />Try to close, his eyes sleep<br />Would feel only and restless and regular kind<br />Of like dreaming but at... same time says<br />And deep aching had settled his muscles and bones<br />At this point, and had barely scratched surface of his<br />To run Thousands of miles<br />Of still lay, in front of..., him and felt<br />Like it would last forever was having what was<br />And just felt trapped tells Sports.", "Gunman opens fire in Austrian school, killing 10 and throwing country into shock | CNN": "At high school, in on Tuesday in one<br />Of worst history death<br /><br />Toll from earlier of... nine told that<br />The between, and years old<br />Said at news that six victims were three<br />Were male Twelve were in incident some<br />Of them Karner said one<br />Of adults died on Tuesday male who<br />Had attended school but<br /><br />Not used two, and to carry out killing spree fatally said<br />At news conference would<br /><br />Not give motive for gunman who they<br />Say alone, he obtained.", "Astronomy show accidentally reveals unseen structure in our solar system | CNN": "An might change, how we think<br />One of most, in Cloud large<br />Of revolving sun at... times than orbit of Neptune is widely thought to<br />Be it has been directly but during of show<br />In Way which at in New<br />York projection on dome<br /><br />Strange within Cloud were testing out scene<br />In September that view<br /><br />Of Earth’s from sun to solar and were<br />When they saw which looked similar to<br />Such as our own We<br />Hit play on scene and we<br />Saw it was just there Jackie at of<br />And curator of show.", "Europe heaps harsh sanctions on Russia, saying ‘strength is the only language’ Moscow understands | CNN": "The announced new of sanctions on Tuesday that daily show that<br />It is not, in peace recent new package since Russia launched its<br />Its in is, to make money from its<br />Oil and gas price cap on... oil from per<br />And full ban on banks third<br />That help Russia said it<br />Is proposing ban on... use of Russian from or<br />In transactions that Nord<br /><br />Stream new package will need<br />To be by states That could<br />Be concerns raised by some<br />More such as, and about<br />While both those have to block.", "Justin Baldoni and Blake Lively’s legal fight isn’t over | CNN": "While suit Blake, and her husband has been<br />She done fighting her claims<br />Her It Ends With Us done<br />Back attorney in her<br /><br />And against told to her<br />In with Jake on said Lively is to<br />See her claims through and to..., them to have<br />Full of what, to her statement came same<br />Day judge million and her<br />As well as, their dismissed<br />Claim from New York Times who<br />First that power feels by<br />The well as, to and that<br />Have stood by Ms as these<br />Claims think that is that these.", "Hegseth defends military involvement in LA protests as defense secretary faces questions over costs and authority | CNN Politics": "Of Defense Pete on Tuesday Trump to<br />In Los Angeles his<br /><br />First appearance in series of hearings next week<br />That are likely to be<br />Test of his what has widely been viewed<br />As first few months on job<br />The which started in front<br />Of House mark first time is..., to since his<br />In and negative spring<br /><br />And dysfunction at Chairman of Joint<br />Chiefs of Staff Gen Dan Caine<br />As well as Bryn MacDonnell to duties of Under of who<br />Said of US Marines.", "Mark Zuckerberg is reportedly recruiting a team to build a ‘superintelligence’ | CNN Business": "Mark is team, to achieve<br />That are capable of... is so with<br />In space that, he has taken it to<br />Meet with experts in field<br />At his homes, in Lake Tahoe and Palo and did<br />Not respond, to request<br /><br />For has AI tools that<br />Are and other apps as<br />Well as its, and but AI continues to be<br />Led by Llama has faced<br />Some plans to, and has shifted of Menlo Park to<br />Put new AI team near<br />His that asked, to remain<br />Has on this task because<br />With of Llama large language to Bloomberg New York.", "Los Angeles officials say ICE keeps them in the dark on raids. That hurts protest response, police say | CNN": "As stage raids Los police<br />And officials say they... are kept dark<br />Lack of leaders blame for<br />Their response, to while has<br />Laws that limit from helping tell no<br />And Enforcement raids with..., or officials We do<br />Not know where, and when next<br />Raids will be That is LA<br />Bass said on, when we find<br />Out when where raids are going to happen that will<br />How police That kind of... is in other parts of<br />The ICE actions found Experts said those<br />Can help for kind of violent that.", "A family thought the sculpture on their piano was a ‘fake’ Rodin. Now it’s sold for nearly $1 million | CNN": "By French artist that had<br />From view for years and was... thought to be<br />Has sold for at Le which<br />Shows sat on rock one foot<br />With her knee hugged to her<br />Chest was at end of after last being sold said<br />House in statement on Rodin who lived<br />From made several of... Le This sculpture was sculpted from marble in Measuring just<br />By was to form part of... work Gates of<br />Hell which features more than<br />And groups previous from... France had no<br />Of its value and had.", "UK, Canada and Western allies sanction two far-right Israeli government ministers | CNN": "The United and other on two<br />For against, in stark joint<br />Move that comes, of West Bank<br />And Ben Minister will<br /><br />Face ban freeze said Ben Smotrich both lead<br />That help keep Prime afloat<br />Both men have faced for their<br />The West Bank, as well as<br />Their positions on war<br /><br />In are being by Canada New<br />And according to joint<br /><br />By five countries’ We are..., to solution which is<br />The way to, and for long<br />Term in region but it<br />Is by settler joint.", "Trump’s aggressive moves on immigration protests put Democrats in a political bind | CNN Politics": "Trump’s deployment of troops<br /><br />To is forcing back onto turf as<br />They look for ways to his<br />Drawn broad over or tying to scenes<br />From Los Angeles are... fight that from<br />Their debate tax and spending and messy of Trump<br />And Musk what, they view as<br />Law enforcement and public Sen John<br />Warned his fellow from where<br />And Enforcement raids into of violence Some<br />Have thrown objects at law<br />Blocked and set cars ablaze<br />While police, in gear fired to crowds<br />While much of has been peaceful of burning cars chaos have been.", "Summer McIntosh breaks another world record, smashing decade-old 200m individual medley mark | CNN": "Made for second time three<br />Days at Swimming on Monday to break<br />The world front, of crowd at... Place in finished with time<br />Of record, of set by<br />In It’s been one of those<br />Been in back, of my mind<br />Since two years who won gold<br />In at Paris Games said<br />Been on door on this one<br />Just tried to chip away<br />Chip away at it to... do it it’s<br />Kind of like got that done’<br />The sees swimmers leg of... all four stokes<br />And in one race her speed<br />For clean leg which gave her.", "Several dead after wave of explosions hit southwest Colombia, authorities say | CNN": "Wave of rocked on said killing in be<br />The police At least three<br />Were killed more were police<br />Told Explosions in city of Cali and several towns<br />In departments of Valle<br /><br />Del on It that police<br />Were direct, of attacks<br /><br />In said three were on Tuesday said were<br />In Los area near<br /><br />The police, and another at Center is now<br />Said on Tuesday that he<br />To deploy, they want us<br />To go back, to we won’t<br />For said period of... said that driver and two<br />With van that was to be.", "Analysis: Trump is acting like an authoritarian; California’s crisis now rests on what he does next | CNN Politics": "Trump is talking and acting like as<br />He clash with, his migration Much now<br />On tough or, if to take<br />An across line in his<br />Zeal for rule, in on Monday of States<br />The seen as world’s top steward of for<br />Years endorsed, of most populous state<br />Think it would be great thing<br />Trump convicted to serve<br /><br />As told as, he strode South<br />Lawn of White House Trump hundreds of Los<br />And arrival of more<br /><br />Guard reservists of that<br /><br />Saw with burning cars areas of<br />The were triggered by Customs sweeps seeking in city and state.", "Bob Costas: Trump’s attacks on the media are unlike anything in my lifetime | CNN Business": "The free press is attack<br />Bob said at, as we know<br />It is under famed sports<br />Was at Edison New<br /><br />York accepting for his<br /><br />And unique, to What as<br />Speech reflecting in sports<br /><br />The state of sports and threats<br />To free press, from Trump happening now<br />Are not matters of small<br />Said of Trump on and on... press in kind<br />To my maybe in history of<br />The reviewing George Costas said of<br />The Trump’s brought it star anchor said that<br />Trump had been found for rape.", "ChatGPT was down for some users | CNN Business": "Is degraded on Tuesday to parent and which<br />Tracks of major web services said<br />It began at am on..., and began<br />To spike am, to addition to video for<br />Are affected At its<br /><br />Peak received on is seeing on its<br />Tools and but said full all<br />Could take hours worked normally am<br />ET when asked it but as<br />As and service is problems On Tuesday said it<br />Was observing rates latency post<br />On that it’s root case is..., as fast as<br />To fix issue to its<br />Page and post, when asked for.", "Greta Thunberg departs Israel on flight to Paris after detention aboard aid ship | CNN": "And rights activist on... flight to France<br />On detained by aboard<br /><br />An aid ship bound for Gaza just Israel on<br />Flight to Sweden wrote post<br />On two of young aboard<br />Plane is climate who has<br />Long air travel to climate in New<br />York in Freedom which aid<br />Ship said that four of activists who<br />Had been on board left Israel on<br />Two French citizens French<br /><br />Of remains, in detention with seven from Turkey France Germany it<br />Said last days, and of Parliament has<br />Been in constant with safety and of<br />The Hassan who was one.", "June’s full strawberry moon will be the lowest in the Northern Hemisphere in decades | CNN": "June’s full moon will shine brightly on Tuesday night Wednesday moon will<br />Be at its at am ET<br />But will still bright and low<br />In east after on Tuesday as well<br />As low west on per summer falls this<br />Month occurring on June<br /><br />Which means that sun appears<br />In sky moon seems to bodies are on<br />Sides of Earth, but this will<br />Be full moon, from decades<br />Due to called, to when moon<br />Is at its, or point moon’s<br />Is dragged cycle by pull<br />Of sun is, to as moon.", "Smithsonian says it’s committed to being free from ‘partisan influence’ after Trump tries to remove gallery director | CNN Politics": "The on Monday its stature and said<br />All decisions are made<br /><br />By its more than week after Trump said<br />He would of said in statement on Monday that all<br />Are made by, and subject<br />To direction of with... by Board It<br />Comes amid, in months several art<br />And who has tried to put<br />In place his own Trump claimed<br />In late May that he was... Kim as of<br />The who has led since is... first to serve<br />In that role, her and for<br />And though his did not cite<br />Or provide, of she is..., and strong of<br />Which is totally for.", "Rare earths shortage could cause pandemic-era disruptions, experts say | CNN Business": "Call it chip on how one<br />Told is possible of... that are now<br />Stage in global trade war<br />Low on those could chip shortage that jacked<br />Up car prices used new<br />Has on those which are critical to<br />From cars to jet to like<br />And for contrast dye used<br />In machines, and some cancer drugs recently made<br />It to get, them new licensing on<br />The flow of most of world<br />The United States from..., and are meeting in London this week<br />To talk new trade deal rare<br />Earths are certainly part.", "Whole Foods empty shelves: Cyberattack plagues store shelves | CNN Business": "Whole Foods say on has left<br />Some store shelves, and is empty bread hearth<br />Is bare customers are... one and bakery at<br />Whole Foods told who requested she was<br />Not to speak, to complained<br />There is lack, of about<br />The disruption and that<br /><br />Has been heavily Foods<br /><br />The food to Whole Foods damaging to<br />Its on Monday its stock<br />Shares another on Tuesday It’s how<br />The supply, to Whole Foods<br />Are but from on suggests<br />The said it’s, to on limited Whole<br />Foods would not on how many of its.", "How the $1,000-per-baby ‘Trump accounts’ would work and who would benefit most | CNN Business": "On face of it Trump which<br />Would provide, of with to... on behalf<br />Of their child’s would be plus<br />For It’s that will help millions of harness strength of<br />To lift up next and really be getting big jump<br />On life President Trump<br /><br />Said at White House event<br />The which is, in bill also known as<br />The One Big Bill Act now<br />In could give leg up to... new to build<br />For their while has its merits it may<br />Not do as much as it<br />Could to help tens of millions of families who<br />Will to save, for their children This meets.", "What to watch in Tuesday’s primaries for New Jersey governor | CNN Politics": "New will their, for on Tuesday of parties in state<br />That towards Trump in has<br />Jack who led race before<br />He secured Trump’s endorsement last month<br />The side has slate of moderate though<br />Some observers see Rep<br /><br />As of field Trump of Garden State has<br />Played role both, for his while<br />As against, him Both will<br />Have to with Trump in general though<br />He lost New by six points<br />To Vice President Trump<br /><br />Made gains state, his of by<br />Points compared, to are running to Gov.", "Judge denies Sean ‘Diddy’ Combs’ second request for mistrial, likens cross-examination to ‘Perry Mason moment’ | CNN": "The judge Sean Combs’ has second for over their claims<br />Of misconduct for Combs<br /><br />Filed renewing their for<br /><br />The presenting false from... close friend of<br />Who last week that Combs once<br />Her floor balcony at... home in Judge<br />Ruled on Tuesday that was... not by they<br />Were to conduct cross of... tense from Combs’<br />In which they with hotel<br />That showed Combs was in New<br />York at Trump on date that<br />She was dangled in Los<br />That it was not for Combs.", "France says Palestinian Authority makes ‘unprecedented commitments’ to reform ahead of conference on statehood | CNN": "France said it has received<br />From that to, as prepares<br />To on New York which France<br />Said was signed by Abbas<br />Of October on Israel call<br />On to all, and to hold<br />And reform, to shared with... will no longer rule Gaza and must<br />Hand its weapons and to... which will their<br />The with Arab and Palace as writing France says<br />It received comes as builds<br />Might State of at next week<br />Aimed at building for at... France is summit with Saudi has reached<br />Out to PA, for Its news."}