{"Cologne evacuates 20,000 people after three World War II bombs discovered | CNN": "The Cologne is in its<br />Since World War three bombs two<br />And another that weighs<br /><br />Tons were found, in on Monday said causing huge danger zone to<br />Be sealed off on two centers and second train station were emptied out Schools<br />And two of Dome and Hall<br />Fell within zone of weapons is frequent in which<br />Was by bombing World War<br />But no of this size has<br />Been out since end of war<br />The said hopes that defusing can be<br />By said statement This will<br />Be if all those affected leave their.", "Welcome to limbo, courtesy of Trump’s trade war waffling | CNN Business": "Here we are through months into Trump sky<br />Where is all those if it<br />Feels like nothing has changed<br />Then you do not work or<br />Or run business that on... There are few<br />Why it feels like some early were but<br />The most is this Trump blinked<br />And blinked few more times as<br />Things stand we’re, in state of... which have learned<br />To not president when<br /><br />He makes bold, and are mode<br />The costs of Trump’s on while<br />They can for three months row<br />Has according to for.", "Who is Lee Jae-myung, South Korea’s new president tasked with Trump’s tariff war negotiations | CNN": "At age he was On Wednesday he leader of one<br />Of most powerful but<br /><br />To decisive Kim on... Lee task South<br />Lee’s declared law in power grab leaving state of<br />Their Six months, of entrenched<br />Rifts with both, for and former Suk his<br />The streets of Seoul conditions have US Trump’s global have hit<br />South hard with no at helm<br />To steer with Lee’s election door of<br />The past might some said Cho<br />Law professor at Seoul<br /><br />We have who could engage<br />With Trump on war and for.", "US-China trade talks: Trump calls dealmaking with President Xi ‘extremely hard’ as frictions rise | CNN Business": "Trump says leader Xi is... hard to make<br />Deal with comment that comes<br />As rise two weeks they reached<br />An agreement to trade<br /><br />Like XI of have and will<br />But he is TOUGH and HARD<br />TO MAKE DEAL Trump wrote post<br />On his Truth, in time Tensions have ratcheted up<br />The United States China as trade<br />Talks between two sides to... stall just weeks<br />Truce agreed, to last month<br />In Geneva That truce<br /><br />Hit pause on, of sparked by<br />Of on into Trump has.", "Erin Patterson: Woman accused of triple murder says foraged mushrooms may have been added to meal | CNN": "The accused, of three guests<br />With meal laced with death cap<br />Told her trial on Wednesday she may<br />Have to lunch, her bland On... third day of<br />On was taken through of..., when accused<br />Of death cap, to Beef Wellington meal<br />She cooked for four guests her<br />At her house, in small town<br />Of has three counts of murder death of<br />Her Don Patterson Gail<br /><br />And she also to kill<br />Fourth lunch guest, her back to... days before<br />The lunch lawyer asked where<br />She’d bought Patterson said.", "Jessie J says she’s been diagnosed with breast cancer | CNN": "Has said been with breast cancer star said<br />That she will soon though she<br />Was keen to stress that cancer has been<br />Caught Price Tag whose real name<br />Is broke news, in on saying that she<br />Has been out tests was with... breast she Wednesday I’m word<br />Sucks in any form but<br />I’m on to word she said<br />Am to for bit Ball she<br />Will be on June to have<br />My and will come back with... tits and more<br />She said that, she about<br />But to go just to be<br />And share it One because.", "As US companies scramble to move supply chains, this small island could be the answer | CNN Business": "At start of Carr of World<br />Booked plane ticket to President Trump<br />Had just duty on Canada what<br />Would be first, of on other World Emblem world’s largest of clothing which counts<br />The Department of UPS<br /><br />And as customers of... its in It<br />Just came really fast lot<br />Than expected said Carr<br /><br />Of were to say this is... nuts We need<br />To change this right now while<br />Trump his tariff to goods<br />That comply with free trade<br />With and Canada trade<br /><br />Was enough, to start moving his chain.", "Coal miners backed Trump. He’s dismantled their safety net | CNN": "Of coal deep, of West David Bounds now<br />To milk to, for breath black<br />Lung disease that forced him<br />To retire may kill him<br />Bounds believes proud of being coal miner but he<br />Want else to face his fate<br />Or confront on job It’s<br />Worse and worse, and worse as<br />Go along want to see<br />In that shape, if it can<br />Be prevented he told<br /><br />So Bounds has watched in as<br />The Trump of have slashed for<br />Coal has found that in just<br />Five months President Trump<br /><br />The net that has for years.", "The White House is approving disaster relief funds without notifying FEMA, leading to delays and confusion | CNN Politics": "In Trump millions of dollars in Federal for<br />Which was reeling from winter storms flooding Gov Glenn<br />News release, to sign his<br />And news that would soon be<br />To state but key been FEMA at agency which<br />Is tasked with that aid were... caught off guard<br />When they saw, of officials told given such news<br />Would come from White House It<br />At least four days that word<br />Reached alarming in urgent in forced<br />To wait extra week or<br />So for critical said<br /><br />The said this, in Trump’s second term It’s.", "Meghan, Duchess of Sussex shares rare photos of Lilibet in birthday post | CNN": "Of has shared rare of her<br />To mark princess’ fourth one<br />On can be seen whose face<br />Is behind, her hand arm<br />To Four years, she came into lives each<br />Day is brighter and better of it<br />Thanks to all, of those sending love her<br />Day wrote Meghan in caption in post<br />Shows whose face is in shortly her birth<br />The was born on June year<br />The Duke Duchess of Sussex stepped back<br />From their roles, as and moved<br />To United States Meghan and husband Prince Harry are known<br />To guard privacy of..., and Prince Archie did Christmas card last.", "French Open: Coco Gauff comes from a set down to beat fellow American Madison Keys and reach semifinals | CNN": "Showed tremendous to come<br /><br />Back from set down to beat<br />Her Keys reach French on Wednesday lost opening set<br />At in nervy to Keys<br />But bounced back, to win ending Keys’ grand<br />Slam win streak will now face<br />No seed Mirra or world<br />No and crowd, in last four<br />Changed at that first set after that had<br />To win set said on court<br />Was well so was just trying to get<br />The ball deep, and be but<br />It’s tough she was ball so<br />Fast and so low was just<br />To fight for point she is... great and her.", "Trump administration takes hundreds of migrant children out of their homes, into government custody | CNN Politics": "The Trump is, of already in States<br />Out of their homes and into at times<br />Them from their, and it more<br />For them to be released<br />To familiar with matter Trump his<br />Top aides have, of who at..., or as of<br />His and his, of Trump argue that hundreds of thousands of those<br />Went for are, in while former that surge<br />Of kids placed on they several field<br />Claims that there are large numbers of children from system Still notion that there<br />Are of such has served as<br />The campaign by Trump to... set up war.", "Justice Department drops lawsuit against Trump adviser Peter Navarro | CNN Politics": "The Department is dropping that it<br />Filed against White House trade<br />Case in which, he was of..., for work wrongfully first<br />Trump according to Tuesday court filing joint filing by Justice and for<br />Why they are case that was... filed in during Joe term<br />In says each side will bear<br />Their own fees, and costs of... at least one<br />To send legal comes just<br />Weeks Navarro was on..., to with into on Capitol served<br />Found of charges that by<br />The email failed to turn<br />To and government court.", "Pornhub exits France over age verification law | CNN Business": "The has to its in France<br />Of its to new French law<br />Sites to age, of their users said Tuesday said statement that had<br />To shirk of by suspending to its<br />In France for on age to... be while of<br />Their runs several sites<br /><br />And is by firm for Tuesday as saying that had<br />In France to its sites France<br />For on daily States to... Last year France<br />Law that sites That could asking to their<br />Bank card said, in October of law’s<br />To French Monde has that users’ should be<br />Checked from their such as their.", "Imane Khelif: World Boxing apologizes after naming Olympic champion in mandatory sex testing announcement | CNN": "World has after was named<br />In their on sex for all<br />In their saying gold medalist’s should<br />Have been global which will<br />In Olympics by made<br /><br />The announcement last week<br /><br />Less than year won gold Paris row said<br />The had sent, to may not<br />In World Boxing she test<br />Source said World van der had<br />To Abbas, to for name<br />Van der said World should have<br />Made to privacy last<br /><br />Week’s announcement World Boxing said all<br />The age of will have to... chain genetic test which.", "Did you rush to buy a car, appliance, or make any other major purchase ahead of Trump’s tariffs? | CNN Business": "Have stepped up, their on cars<br />And in recent months rushing to get<br />Of Trump’s stiff say rush spending has put<br />The more if, to Already racked by<br />Who bought items now have<br />To pay hefty bill or<br />Take hit to, their On top<br />Of that it’s more to find<br />Job accounts that are newly are rising and Trump’s<br />Trade war could, of growth rising known as<br />So if is that Trump’s tariffs are going to jack<br />Up it could make sense to... shock as many did earlier spring<br />To Department was much.", "As Ukraine batters Russia with daring assaults, firebrand pro-Kremlin pundits rattle nuclear sabers | CNN": "How will to drone strikes on... its fleet of<br />So far Kremlin has stayed<br />That it is, for results<br />Of attacks which struck air<br />Of miles from, but is being with pundits and bloggers with calls<br />For This is not just but<br />To launch nuclear strikes<br /><br />On Ukraine Two said on..., their which has<br />The cloud you can think who<br />Lied made so on they added to Kremlin search for<br />For fiasco At least<br /><br />One Sergei urged in social post that<br />Would lead to real but popular should.", "The Trump administration just doubled the tariffs on steel and aluminum imports. Here’s what that means | CNN Business": "On steel doubled to as<br />Of am ET on move cheered<br />By beleaguered steel industry but<br />To that heavily use<br /><br />The car makers to can<br />The jump taxes is latest in President Trump’s<br />Trade war part, of broad range<br />Of since but steel are to..., him and his<br />Base of US that has<br />Since on hard times leap tariffs won’t hit<br />But say that on construction car lots<br />And are all, but from higher and while<br />The could steel jobs they could<br />Hurt employment in much.", "‘I think he just wanted snacks’: Thai shopkeeper caught off guard as wild elephant visits store | CNN": "An forgets where snacks are... stored large wild<br />Caught off guard at convenience store on<br />When it into shop search<br />Of food hungry can be<br />Seen on footage store helping to snacks<br />Was bit slow that day elephant just<br />Walked right up came out tried<br />To shoo it told it not<br />To come closer shop owner told it<br />Go on’ but it was like<br />It came on store in province of capital is<br />Near Park so are We see<br />It pass by, and watch from... house but it<br />Came shop or hurt she said.", "Google’s DeepMind CEO has two worries when it comes to AI. Losing jobs isn’t one of them | CNN Business": "Of research arm and Prize<br />Too about, of replacing jobs worried wrong hands<br />And lack of keep control<br />Both of those risks are challenging ones<br />He said with at in London which takes<br />Place this week Last week of... lab had stark<br />The job claiming that AI could wipe<br />Out half of jobs but said<br />Most concerned, of what AI call general type<br />Of that would match bad actor could those<br />Same for harmful end he<br />Said and so one big thing<br />How do we, to these systems to bad."}