{"New Zealand government sued over ‘inadequate’ plan to reduce emissions | CNN": "Are New Zealand to court<br />Its plan to holes which will<br />Have huge for Two groups Lawyers for Climate and Law<br />That plan to reach net zero is neither nor capable of<br />The groups which filed for Wellington High<br />Court on Tuesday New Minister for<br />Change Watts claim, they that contrary to<br />New law government has<br /><br />Slashed of climate and is... on such as<br />Tree to We’re this case it’s<br />Is held to, for said statement world’s leading have made<br />Clear that this is decade.", "Nintendo Switch 2 sales set a record in four days | CNN Business": "That it sold more than million Switch marking new for<br />The said that it’s sales level for any first four<br />Days of puts, in good shape<br />To meet its goal of selling Switch by<br />The end of next March We<br />Are for their, and to see<br />The fun they are already with Switch<br />As they new, and games that<br />Bring friends family new<br /><br />Ways said Doug, of and chief<br />In press has swirled device<br />It’s first major launch since<br />The Switch eight years ago<br />The Switch ended up selling since its.", "Newsom and California confront Trump with a potential blueprint for Democrats | CNN Politics": "Have spent last few months talking up to<br />Trump in his term Gov Gavin is first<br />Faced with figuring out<br /><br />What up looks like and how<br />The Trump’s calling in National Guard<br />And in over will far<br />And long after this week<br />How is what has become<br />Fight on streets, and in courts<br />Few days after he was..., to Trump effort to federal grants<br />To state that can be canceled have been<br />In through their minds of how<br />What’s in could play out at... home for them<br />To briefed on signed Trump’s of... Guard alarming of power but they<br />Have been treading since then.", "Trump is hyping a case to use American troops on domestic soil | CNN Politics": "As Trump is case to use<br />Troops not foreign but at... home to bolster his mass<br />Sweeps but Gov who heads state<br />To with taste, for unchecked<br />Says of peril is at... hand for US in with<br />Stark Trump is, of and looting and Los<br />And that to keep safe ready to soldiers Trump falsely claimed on<br />That if failed, to dispatch<br />The Guard US Marines<br /><br />To Los Angeles it<br /><br />Would be burning to ground<br />The warned that, he was looking Los Angeles as<br />And states those run by brace.", "US foreign aid cuts threaten decades of progress on driving down malaria | CNN": "Cuts to are, to host of... whose is at<br />The run by have child who<br />Is sick he has had for<br />Week and few days now told<br />Of her son whose she is... caused by illness she is<br />Of disease, she said I’m<br />Cold feel bitterness my<br /><br />Mouth is out, of work said<br />She can barely food much<br />Less for her, and her baby is curable but<br />It still claims, of lives world<br />Each year Infants five pregnant are most<br />To die from It’s cause of... death in Congo which bears<br />The world’s burden to World.", "Elon Musk says he regrets some of his social media posts about Trump | CNN Business": "Musk said Wednesday that he<br />Some of his posts about<br />Trump regret some of my<br />Posts about last week they... went too far<br />Musk said post on with Trump<br />In last week, as two men<br />Jibes on their Musk was Trump’s<br />Close in government of..., his Department of Government where<br />The tech mass, of but their<br />When Musk slammed Trump’s tax cut<br />And domestic bill labeling it<br />For its negative on... stepped up his<br />By from Trump, and that raised<br />And Shares of rose on rising in trading posts on<br />Last week was claim that Trump.", "USMNT can’t seem to win a game with the 2026 World Cup one year away | CNN": "With exactly one year<br /><br />To go start, of World Cup<br />Things are not, to plan for<br />The Men’s National Team<br /><br />The by US and is..., to new era of men’s<br />In United States chance<br /><br />To prove on world stage very best teams<br />On but if are to go<br />By World Cup, in months could<br />End up bleak was laid bare<br />Night was thrashed by in Nashville game was<br />With its fourth goal Those fans<br />The let their be heard with... boos around<br />Park Make no is side with..., of top class.", "Trump’s China ‘truce’ is nothing of the sort | CNN Business": "At long last States has reached<br />Trade agreement with China war of<br />Words that into on key<br />And Chinese this week met<br />In United with singular goal<br />Find way to what they had<br />To month earlier It<br /><br />The top trade have accomplished that On<br />Night both Trump said they had<br />To consensus they reached<br /><br />In May trade truce would be<br />Sent to their, for their Businesses Wall<br />Street will no doubt breathe sigh<br />Of relief have raised easing trade barriers world’s<br />Two should lower costs help.", "US citizens and legal immigrants would be impacted by bill to keep ‘illegal aliens’ from benefits | CNN Politics": "House are touting that their<br />Tax and spending cuts package would kick<br />Off assistance one of... Trump’s top House<br />Mike has that bill would stop<br />From tax portion of package has section on benefits from<br />And House crafted to food<br />Stamp for aliens won’t<br /><br />Be as heavily by<br /><br />The they can’t all assistance say Those<br />More in danger of losing some benefits are<br />Of as well, as who are..., but whose parents may be<br />Or have various It’s<br /><br />Part of said, of health justice at National Law.", "Rare Labubu sells for more than $150,000 at auction | CNN": "Rare has sold, for in at... held for toys<br />That have taken world by<br />Storm mint green with appearance sharp teeth<br />And grin went, for yuan<br />At house that, in and modern art to<br />The on world’s such one said<br />The at center in on... are trendiest<br />Plush toys on by Hong Lung<br />And by toy Pop Mart recent months creatures parts have<br />Soared in sparking world some<br />Brawls among fans shops selling them Even in China where Pop<br />Mart is based, and most of... its toys are<br />Made are struggling to... get their hands.", "Aaron Rodgers says continuing to play football was ‘best for my soul’ as he reveals he’s now married | CNN": "Months of Aaron signed deal<br />To become last week set<br />Up another in his<br /><br />Hall of Fame with in bring<br />Bowl success back to which<br />Has gone years Vince Lombardi and years<br />Since their last, in it was..., and Green Bay<br />Who beat Steelers in their<br />Last Bowl On, his first day<br />Of on Tuesday said that<br />The league still it’s what he<br />Wants to do need it for<br />My need it, to keep playing told lot<br />Of decisions that made<br /><br />My career, and life from..., if they turn.", "Police seek answers as Austria mourns victims of one of the worst shootings in its history | CNN": "In were hunting for clues<br />On at his high school day<br />Nine and teacher in deadly spree that<br />Stunned Scores of shocked near scene<br />Of crime to one of worst<br />School in history they... had searched home<br />Of who school, in police<br />Told that officers had<br /><br />Bomb note video at... home We have<br />Out search at home of district of have<br />Been to that there was note<br />Both in digital form<br /><br />And in form told that items had been<br />To assess, of who died.", "Trump says he plans to phase out FEMA after 2025 hurricane season | CNN Politics": "Trump said Tuesday that he<br />Plans to phase out this year’s<br />The his plans, to dismantle and shift<br />For response, and recovery states We<br />Want to wean off of FEMA and we<br />Want to bring it down to... state Trump told<br />In should be, to it frankly if they<br />Can’t it then, they be governor Trump<br />That will start less aid for<br />And that funding will come<br />From and projects this year’s<br />Which ends on, to be deadly for months<br />Trump and Kristi whose FEMA have vowed<br />To it as, and those plans.", "Summer McIntosh: Teenage swim sensation continues blistering form with second fastest 200m butterfly in history | CNN": "Was away, from third world<br />In week at, in time of... race just off<br />Liu world of set back no<br />Had within, of mark which<br />Was set just ban on super suits had<br />Long been who more than seven of swimmer in second has set<br />World records, in and medley this week<br />It’s fair to say is putting one of<br />Great meets rate this race higher than my<br />Ones said per would rate it<br />Than IM just this world is... one to get<br />In my personal with... low tonight<br />Know if it was because.", "Lesley Lokko is on a mission to transform architecture, fostering a new generation of ‘more dynamic thinkers’ | CNN": "When was young, in was place<br />Of and yet, she felt discipline was<br />Of beyond, of space We<br />Were in very way difference or<br />Things like family said<br /><br />The renowned now in her<br />She between, her up family small<br />Homes among, in her way<br />Of about was at odds<br />With in tropics rots metal rusts way<br />You think weather and is... told call from<br />Fast three is now her African is<br />An what should look like for<br />The based was, to be school<br />Of but soon, and to start.", "Scottie Scheffler admits that bettors forced him to delete his Venmo account | CNN": "The strong favorite to... win golf tournament to<br />Bear Just ask who has that<br />He was forced, to close his<br />Of on his, of this week’s<br />At Club for which is strong<br />The world No, how he often hears from<br />Fans who have, in where he<br />At why had, to get rid<br />Of my was paid by people or people me bunch<br />Of when win, he told It<br />Good Asked biggest sum he<br />Had been sent, as thank you<br />The most that would send me<br />Bucks here or there That happen as much<br />As requests did has never won US but he.", "Members of Congress reported flurry of stock trades in the days around Trump’s trade war announcements | CNN Politics": "In days President Trump<br /><br />Paused most of on he had<br />In more than were tied to... worth of stock<br />As stock market of filings shows Seven and three<br />Stock transactions made on... two days Trump<br />The pause to by Trades by<br />The financial firm which<br /><br />Tracks financial That day<br /><br />Post on pause was already stocks sending state of<br />The next day on eve of... Trump’s reprieve<br />And four were tied to filings show White<br />House that day it would hefty on China and closed<br />At its lowest so far.", "Federal appeals court to hear arguments in Trump’s long-shot effort to fight hush money conviction | CNN Politics": "Five months after Trump was..., in New York<br />Hush case his will square off<br />With in one, of first major tests of<br />The Supreme Court’s decision Trump is<br />On high court’s, from bid to... get his by<br />Courts convicted on counts<br /><br />Of records Trump in first<br />To ascend, to Trump was..., and courts flooded with tied<br />To his second term hush<br />Case have chugged, in courts panel of US Court of<br />All named to bench by will<br />Hear in one, of those cases Trump will<br />Be on Wednesday by Jeffrey Wall private and Court.", "Starbucks is entering the protein wars with a new topping | CNN Business": "Is its toes, in for with... new for its<br />Drinks is testing new cold<br />Foam at five, as part of... plans to into and sagging sales trial pairs foam<br />Packed with grams, of with Tuesday at Las<br />Is part of plans in its<br />And food to build that will<br />With according to statement is cutting of menu but also new foods<br />And drinks while its said it<br />Has to test some in stores<br />Than shipped warmed up first test<br />Is new buttery seems<br /><br />Like for shake is according to Beverage It’s<br />By like Core, and Milk by.", "CFPB enforcement lead resigns, slams ‘attack’ on core mission in departure email | CNN Business": "The Consumer from agency on<br />In email, to announcing her Petersen slammed<br />The Trump efforts to agency which<br />Was established as banking have served<br />And Director in Bureau’s and never have seen<br />The perform core so under wrote seen<br />By It is clear that Bureau’s has no<br />To enforce law in any way which<br />Is tasked with banks and other play fair<br />With consumers has been<br /><br />Thrown since President Trump<br /><br />Took this year has faced several mass<br />And abruptly to cases was early of Trump."}