{"Antisemitic posts appear on Elmo’s X account after hack | CNN Business": "Was hacked on Street to post<br />And posts have, since been but<br />Show for violence Jews<br /><br />And for of files related to Jeffrey case was<br />By unknown who disgusting and racist posts spokesperson for<br />The Street told, in We are..., to restore<br />Full control, of account<br /><br />Has for comment was jarring from usual posts<br />And with other Street characters or<br />Some of posts, his of third<br />The posts came week froze its<br />It began, and White talking points later that system caused to<br />To existing when such.", "Tesla shareholders want a full-time CEO. That’s not how Musk works | CNN Business": "This is crucial year for<br />Just ask Musk, in he as<br />The most history with... goals of its<br />And but was by role Trump<br />As at Tesla to mount<br />Far away, from that role<br />Musk remains on wide range<br />Of third party and trying to fix<br />At his social That leaves<br />The most valuable on... one thing every has<br />Boss on its has chief who<br />Is so its sales and likely to talent while board<br />And to show, him door they... should to have<br />One of biggest in world<br />Not have is, of said Ross.", "Painter Lucy Jones puts her life with cerebral palsy on canvas | CNN": "Jones her first nude at she<br />Was in New York with her<br />Leach she said, when he took<br />Of my thought look too bad<br />From back so I’ll paint Jones<br />Is on wooden chair middle of gallery space<br />By collection of her<br /><br />Own works spanning for opening of<br />New show London while piece<br />In is absent from it<br />Is enough, to remember off by<br />Heart black canvas split two<br />With Jones’ tilted gait rendered nude two<br />The front is flat and painted her right<br />Arm bent backwards at awkward right angle was with<br />Brain disorder that body and muscle as young.", "Obama’s blunt message for Democrats: ‘Toughen up’ | CNN Politics": "Call to action for at..., in New Jersey on Friday those by<br />The state of Trump to stand<br />Up for things that you think<br />Are right think it’s to little bit less<br />And less whining and being in fetal and it’s<br />To just toughen up said<br />At according to excerpts of his<br />By You know tell me but<br />Kind of right now so not<br />No now is time that you<br />Get in there, and do something he said<br />Say that you care about<br />Free speech then No you stand<br />Up for free speech when it’s.", "Deputy Director Dan Bongino’s position at FBI still in limbo, sources say, following fallout with Pam Bondi | CNN Politics": "Of Trump’s top went to work<br />On with key would Dan show<br />Up director did not<br /><br />Go and largely from most<br />Of his colleagues with General Pam<br />The files as, of no one<br />In at Justice had spoken to since<br />When he that, he could no<br />In his as long as Bondi was there<br />With said threat Trump who spent<br />The both Kash told Most of..., his was at<br />Aides to that would depart<br />His job coming days but<br />Vice Vance spent, to at times<br />Calls from Bondi said It.", "Former Israeli leader says planned ‘humanitarian city’ in Gaza would be a ‘concentration camp’ | CNN": "Planned to hold, of would be<br />Camp Prime Minister has<br /><br />Warned Defense Katz said last<br />Week he had told to plans<br />For zone which would contain<br />The entire of Gaza would be<br />Built on ruins of city of southern and once<br />The zone they would not be<br />To leave Katz vowed to implement plan<br />For of Gaza It is... camp am sorry told Guardian on<br />If they will be deported new city’ then you<br />Can say that this is part<br />Of response, to Prime Minister’s called<br />Him convicted on statement said We.", "Tesla to hold shareholder vote on whether to invest in xAI | CNN Business": "Will hold vote on should his<br />The said if it was up<br />To me Tesla would have<br />In long Musk said in post<br />On his social which is... part of We<br />Will have vote on Musk has<br />Been from his, as he seeks<br />To compete with like Meta and Google in March<br />Which it used, for and to... its and on<br />The Wall Street that space is... set to billion for from<br />Could be more that it is..., and one whose<br />Have already been antsy in recent months Tesla with scale<br />Of as well, as his role.", "Cornyn outraised Paxton in kickoff quarter of Texas Senate primary upended by AG’s divorce | CNN Politics": "Sen John his Ken by million first three<br />Months of one, of most hotly of raised<br />To between month launched his<br />To unseat, and end of... June their said<br />Their come as race is by<br />Wife state Sen who sent through<br />Last week with, her announcement that she<br />Had filed for, her divorce<br />Of and said, they had not<br />Lived together for more<br /><br />Than year state court on Friday in sealed<br />News which could spare from having to that<br />The proceedings in midst<br /><br />Of his Paxton who built.", "Trump announces novel plan to send weapons to Ukraine and gives Russia new deadline to make peace | CNN Politics": "Trump on Monday laid out<br />Pair of steps, to end its<br />War in funneling new<br /><br />To and threatening on..., if peace reached<br />In days as, he grows with..., his together moves to<br />New approach, to which Trump<br />Has worked to, since in Even as he<br />The announcement from Oval he to<br />Blame for war Still he fed<br />Up with Russian and he<br />It is would be if is..., to stave off<br />Felt we had deal about<br />Four times Trump said referring to peace<br />With but it just kept going on plan.", "A frequent flyer needed a kidney transplant to live. This Delta worker gave him one | CNN": "Bruce has been out of since<br />The late for, his job as<br />For car way, he got to... know Air Lines<br />At well making point of..., his Jill Hickey been with<br />The four years got used to... stop by customer to<br />Get his flights did of them<br />Know those would save his life<br />Said she crossed paths with Gamble for reason knew Bruce<br />Had been having some health<br />But know how it was what<br />It was that, he said Gamble now he<br />Has been Type, since and noticed his kidney was he<br />Was told his blood type had.", "Ellen Degeneres shows support for Rosie O’Donnell after Trump says he’s considering revoking her citizenship | CNN": "Is her for, she responded to President Trump’s<br />Post that he was to US Good for<br />You wrote on, her page who<br />On made comment New York<br />Who moved to Trump was to... on Truth Social that feud<br />With because, of fact that<br />Is not best, of Great Country am giving to taking her Trump<br />Wrote she is Threat to should<br />In if they want her GOD<br />BLESS reached out, to White House<br />What but drew last she posted to her<br />Page Trump to floods in central to post<br />On her page you call me.", "Mamdani win sends jitters through NYC luxury real estate market | CNN Business": "In days after won for<br />Of New York last month Jay<br />Real estate, in felt his<br />Take hit Two with to buy<br />In Manhattan told Batra they were<br />Their plans on pause about<br />New York’s he told lot of..., and have little more cautious in their<br />Said more traction gained it<br />Went from little to where<br />Is since socialist won<br /><br />New York’s mayoral late<br /><br />June real told that have pausing their of<br />They said his has some wealthy New Yorkers who with<br />His to their plans to leave.", "AMC’s 50% discounts are here. Will it help revive the movie industry? | CNN Business": "With of streaming and costs<br />Of attending from tickets to movie has suffered is trying to change<br />That with ticket on most<br />Day as well, as on Adam guest for<br />The discount, to press lot<br />Of have seen, of discount<br />Day and right now it’s very to see<br />The No chain, in and world<br />One director at Pro<br /><br />Told that other chains could<br />Suit to customers can<br /><br />Cost as low, as far less<br />Than in New York or Los<br />But for still comes down to... price of movie with other said Loria to<br />The can be, and than sports.", "Could Trump convince MAGA to support Ukraine? | CNN Politics": "Trump made Monday him more<br />With defense than before<br /><br />The will send, to Ukraine<br />Through said during in Oval with NATO Mark Trump<br />Laid out new, for trade sanctions if peace<br />Deal reached days which had last<br />Week hawks were Sen of South<br />The announcement as turning point added game of<br />Is about, to change Trump’s<br />With much more than two weeks<br />He this summer days of..., him expressing of after years of<br />And approach, to but timing is also far from<br />For Trump speaking he is... with from base.", "Under fire for cost overruns, Powell asks watchdog to review the Fed’s $2.5 billion renovation plan | CNN Business": "Chair Jerome has asked central bank’s general to<br />An that has drawn from President Trump<br />And according to source<br /><br />With made few weeks ago<br />The source said has come up<br />As new line, of attack<br />From Trump who has railed Powell for months<br />For not lowering rates<br /><br />At stake is Fed’s which value for role<br />It plays shepherding world’s<br /><br />At his policy last<br /><br />Month was grilled by some Senate what they<br />As upgrades, to Fed’s Washington said<br />Some of those such as are... not part of<br />The then Fed head has been.", "MAGA media’s conspiracy theories put Trump in power — and now they’re coming back to bite him | CNN Business": "The that President Trump<br /><br />To is now, for him Some<br />Of most voices in media are<br />Trump’s call to stop time energy on<br />Trump said cares late convicted sex but<br />The replies, to his Truth<br />Post showed for Trump and structure of this<br />In short it’s that keep people and playing as lurid as sex<br />So it makes sense that many are on<br />And his to, and have long<br />And want they want engagement and asking stokes host<br />Steve said over that he<br />Sensed at work It’s clear wants.", "Paul Biya: Cameroon’s president seeks to remain in power until almost his 100th birthday | CNN": "Paul who has held grip on..., for years has<br />Launched bid that could keep him<br />In his Much, to be done<br />Said who is, in his seventh term office best is<br />Yet to come, in on is... fresh term scheduled for that<br />His health has, he said his<br />To extend, his grip on..., from and from<br />The his comes months his office pushed back<br />On he was, or had died<br />From eye his health were later banned media with<br />The declaring it national for<br />Years about health and have<br />Been points where, he has rarely been seen.", "Trump’s 30% tariffs on Europe would effectively knock out transatlantic trade, says EU trade chief | CNN Business": "The has warned that its trade<br />With United States could<br /><br />Be wiped out, if makes good<br />On its threat, to slap tariff on goods<br />From bloc tariff of or<br />Has more or less same so<br />It prohibits trade said<br /><br />As he of on said it<br />Will be for bloc to its<br />Of trade with, if that new<br />Rate is on date by US Trump his<br />To on Saturday if<br /><br />Stays plus simply as we<br />Know it will not continue with huge<br />On both sides, of Atlantic he added will do<br />Can to this, in press conference said.", "Sony is giving NFL’s coaches headsets a major makeover | CNN Business": "And game can be so Sony are listening to<br />To design new that can<br />Best tough league it was furthering its<br />With creating new for<br /><br />Out this season That ends<br />Of its deal with Bose ended in for<br />The new rigorous hot<br /><br />And conditions and that<br /><br />The voice their which took year<br />To build were clubs and people who use<br />The on game day Fields senior vice president of<br />Told There was loop from coaches what was<br />To them was, since some games<br />Are played high heat and tried.", "German tourist describes 12-day ordeal, lost in Australian wilderness | CNN": "Who survived days lost has<br />Said she is, to have her<br />First since being found on... said she hit<br />Her head when, she crashed her<br />Car and lost it in state<br />Of confusion was found<br /><br />On two weeks, she in Press<br />The crew of, her in wilderness Hill<br />North of town, of Some people might wonder why even left my<br />Car though had food and clothing there she<br />Wrote in statement by Western Force on<br />The is lost, of car rolled<br />Down slope crash hit my head<br />As result, of left my.", "Americans could pay more if Trump makes good on his tariff threats | CNN Business": "Trump expanded his tariff threats over for levies on two<br />Of and Those are set to... take effect<br />Inks trade deal, or takes other that cause<br />The reverse course if that<br />Does not happen could get<br />Stuck more for list of goods<br />But as is case with various Trump<br />Has already and tariffs on goods<br />From and that with his own<br />Deal known as it can take<br />Time for tariffs to into for instance from last<br />Three months have shown have stable Trump that<br />The cost of will be borne.", "GOP infighting over Trump’s DOGE cuts to take center stage as deadline looms | CNN Politics": "Are their next big fight this<br />Time DOGE spending cuts for<br />Aid and public that risks<br />The wrath of Trump if they... fail With just<br />Days to go Trump himself<br />Is applying to his<br /><br />The threat of, his endorsement to those<br />On fence what would be major win for<br />The White House, in on Capitol Hill<br />Are with one, of their own<br />Still to keep, from block of... firm to sign<br />Those cuts into law that<br />Push is being watched by<br />The hawks many of whom<br />At for forcing them to... tax cuts earlier this.", "Donald Trump’s eventful day at the Club World Cup final: Being booed, celebrating with Chelsea and a winner’s medal | CNN": "While stole show on pitch masterful Trump<br />Was of at Club World Cup<br />On Trump first Trump were at..., in New Jersey to witness Blues’ dominant as<br />Two goals from Cole and one<br />From new Pedro gave Chelsea to winners of newly but for<br />Trump it was, from his very first front<br />Of fans he, and first lady were cheered<br />Their arrival at Stadium but<br />When he was shown on video screens<br />The Trump scattering of... boos he was<br />Booed again on game when<br />He was medals on field.", "Researchers may have found first Mercury meteorites | CNN": "That two found, in Sahara in may<br />Have come from which would make<br />Them first fragments of solar least studied and most<br />Of is so close to sun<br />That exploring it is..., for probes Only two have<br />It to date launched in MESSENGER launched<br />In third is en route due<br />To around, in late Scientists know<br />And they have been to study of planet that landed on Earth<br />As in contrast there are... more than known<br />From moon Mars, in that catalogs all<br />Known These as flung from surfaces of<br />The moon Mars, their way to... Earth through space.", "Epstein fallout poses a loyalty test: Trump — or MAGA? | CNN Politics": "It’s Trump versus in days<br />Since Trump Jeffrey at odds<br />With pushed by, and some of..., his top Trump’s<br />And most ardent are Justice and last<br />Week concluding there was... no that had<br />List of powerful men<br /><br />Who in his, of sex trafficking It<br />Said disgraced died by was... not in his<br />New York jail cell yet after years of<br />Big to base failed to smoking gun Trump<br />And his team’s own words world<br />The against one another With Trump<br />The has set up test president he."}