{"The Trump administration revives an old intimidation tactic: the polygraph machine | CNN Politics": "When White House, of officials with to<br />To control press his of... State George Shultz<br />To resign White House backed<br />Down and to tests for those<br />Of according to New<br /><br />York Times terms, of spies tests<br />Failed in key More on that<br />In First second Trump which<br />Is in on, to out leakers but also as method of has<br />Been and is used against<br />Who have never had whether or their<br />Said Mark Zaid who in people who work<br />In slew of threats throughout<br />The Trump tests are used to... not leaks of<br />But regarding or that.", "Nine injured after Ryanair flight hits turbulence | CNN": "Flight was forced, to make landing in southern late on<br />Due to heavy from with... nine police<br />Said flight from west of Munich bad weather to landing said statement were woman who head<br />Her who suffered and woman of back<br />Pain police said All three<br />Were in while were at scene<br />Said in statement on that<br />The flight’s captain had medical of<br />The that flight had been to... take to those<br />Had said their that was bus<br />.", "Procter & Gamble will slash 7,000 jobs as tariffs fuel uncertainty | CNN Business": "Said it would cut jobs or<br />Of its total next two<br />Years as part, of new plan<br />To uneven and higher costs due<br />To world’s largest goods also plans to<br />Some and brands, in said at... Deutsche Bank Conference had<br />As of June It said job<br />Cuts would for, of its Pampers plan comes<br />As consumer is to... this year global goods makers and brace<br />For hit to This is not<br />New approach, of win challenging which<br />We compete said Trump’s sweeping on trading have roiled<br />And led to fears of States.", "Between Combs and Weinstein, #MeToo is back in the spotlight. Its founder wants to highlight a few important things | CNN": "At one point Sean Combs’ federal sex<br />And defense Steel asked witness who was<br />If she counsel in order to join<br />The grab Mr Combs question came during one of<br />The three days, to on stand<br />As about, of and sexual by<br />Combs though question was by<br />The judge moment speaks to... that looms large<br />Two that are place in courts<br />Mere blocks from one another in New<br />York Combs has not to charges of sex<br />And to state court disgraced<br />Whose fall from grace was impetus for<br />In will soon face in his.", "Japan’s annual births fall to record low as population emergency deepens | CNN": "The Japan is decreasing than with<br />The births falling to low<br />Last year to health said babies were born<br />In Japan, in drop of... on year first<br />Time of fell, since records<br />In It’s straight year of It’s<br />Of peak of births in during boom data in country of rapidly adds<br />To concern, of and national at<br />Time it seeks, to defense<br />Prime has as, and has promised to more<br />And that would help to balance work parenting where<br />Tend to be more and harder on women is one<br />Of east Asian with falling birth rates.", "‘Wicked: For Good’ trailer: Ariana Grande and Cynthia Erivo are back for more musical magic | CNN": "On unveiled, for to hit<br />Based on musical clip<br /><br />For new film which is titled for Good<br />Picks up just where last year’s<br />First left off with in tower high up<br />In at night, for her friend<br />And de facto to make<br />Known from there are to fleeting of working her magic with glittering crown<br />And peek at some stakes were... set by end<br />Of first film with now branded as Wicked Witch by<br />Both and Wizard of Oz<br />Who are both seen in her<br />In new trailer back for.", "Marina Tabassum: Designing the Serpentine Gallery Pavillion is an architect’s dream job | CNN": "On grey drizzly in London this year’s<br />The be Kensington will<br /><br />Bathe you warm glow Packed curved<br />Beams translucent square panels weak into more summer hue try<br />To work with light Marina told of<br />On day it’s, but when it’s<br />Not you get, to see softer of light<br />Through since chance, to design<br />Space in center of London is by<br />The each year, to who built<br />In before, as has very with music and art<br />Said Hans Ulrich who has<br />Been on project since video call<br />It’s has so who but has.", "With its shoot-first style, Trump team often shoots itself in the foot | CNN Politics": "In Trump’s second term how<br />The is often now at..., in late Musk<br />Said Department of Government had<br />We will make We won’t be<br />But when we make mistake<br />We’ll fix it Musk said so<br />We restored, and there was... no It first<br />Time Musk who has since left<br />The had he, and his team<br />Would make but it was striking is matter of life<br />And death but Musk it as<br />If it were just some growing pains claim<br />That there was no has also been called<br />In months since, though that has.", "What are stablecoins? Everything to know about the crypto being debated in Congress | CNN Business": "Are on verge, of say as<br />Bill makes its way through Congress is GENIUS Act which<br />Would provide, for bill last<br />Week passed major in Senate from some<br />Are type of that is tied<br />To another such as<br /><br />The gold they were created as way<br />For to store, their but have<br />Grown in recent years for<br />Their use digital bill<br /><br />Would provide boost of crypto and is<br />Of how have had revival Trump’s second term of<br />Have on yet have to Trump<br />Ties to crypto for World.", "Gabby Thomas: Betting site bans individual over heckling incident with Olympic champion sprinter | CNN": "Sports who heckled Grand Slam<br />Track event, in has been<br />Banned by betting site statement sent to<br />The Press on wrote it strongest terms Threatening or<br />Is and has no place sports<br />This is no, to with Last<br />Fourth in race won by bettor wrote post<br />On that he made lose by<br />Her and it made my parlay win he<br />Of his parlay that had<br />The at Paris Games last<br />The on she wrote This grown<br />Man me track, as took pictures and signed<br />For fans shouting who him.", "Bodies of two Israeli-American hostages recovered from Gaza in joint military operation | CNN": "The two hostages by<br /><br />On October were from..., and Shin Bet<br />And were killed near their home<br />In Kibbutz Nir Oz during on southern in with<br />All of Israel my<br /><br />Wife and our to dear<br />Prime said statement prime minister thanked<br />The commanders in vowed<br /><br />To return all remaining held Gaza We will<br />Not rest we will not be<br />All both living and fallen are brought<br />Home he said, for kibbutz<br />Nir Oz said, of two hostages had<br />Been returned, to and would.", "NBA Finals: What to know as OKC Thunder and Indiana Pacers battle for title | CNN": "The have been ones to with... shock results<br />Big and struggling at... end of thrilling it is<br />Two teams with, in and Pacers will face<br />Off in series for Larry and chance<br />To lift banner in their<br />Home arena Both have<br /><br />Had to reach this spot so<br />You need to know begin<br />With Game on, in with Thunder of their<br />All games will be on full<br />Game at ET Game at ET<br />Game June at ET Game Thunder June at<br />ET Game Pacers June at... ET Game Thunder June at<br />ET Game Pacers June at... ET and Pacers’ route to<br />The have been more spent of..., and were many picks for.", "New Zealand Parliament votes for record suspensions of 3 lawmakers who performed Māori haka protest | CNN": "New to Parliament for<br /><br />Three who to law received<br />Ban and leaders of her<br />And were barred, for days Three<br />Days had been ban for from... New before<br />The Te Party dance of... last November to widely bill now<br />That they said would reverse<br />Rights but drew, and provoked<br />Months of fraught what for actions should be<br />And New Parliament or<br /><br />Or felt threatened by it<br />Of peers April in that<br />Said were not, for but for<br />The floor of, their opponents while they<br />Did it that where have left.", "Friday’s jobs report could show how much US employers will bend before they break | CNN Business": "Last June after full year<br />On job hunt role at brand<br />That was looking to build<br />Out its US was for<br />The with others and Williams was for<br />The ride April Day Williams said nodding to moniker Trump<br />To his tariff on April was from<br />The went from growth to its<br />Threat for every of..., and that landed in US from countries such as<br />And was for, of said statement pause of<br />Its lost his job on April have warned<br />Like could be first signs of... Trump’s steep tariffs which have<br />Up of businesses of... all jobs will.", "EU sounds alarm to China over rare earth export controls | CNN Business": "The has urged, to ease on... rare earth critical for<br />From cars to, and production in Europe and Union’s trade said<br />The was his with Chinese<br />Wang on of, for and conference my<br />The alarming in car<br /><br />But would say, as such clearly rare earths<br />And are for told reporters on Wednesday At height<br />Of its trade spat with April its global in rare<br />Earths supply chain and new<br />On types of rare earth minerals for<br />From and vehicles to... such as fighter jets China of global of rare<br />Earths but trade truce with States.", "Hooters abruptly closes dozens of restaurants | CNN Business": "Has abruptly closed dozens of just<br />Few months after wing chain<br />Filed for bankruptcy it<br /><br />Of what is, to best our for future made difficult to<br />Close locations said statement to list<br />Of released, but reports<br /><br />That about were affected in Florida North<br />South and Texas said that<br />It’s here to stay and by<br />In support, of goals Hooters will be<br />To continue pure business chain best<br />Known for its wait staff filed<br />For in March is all of... its to two<br />Groups that Hooters in Tampa and areas since.", "America’s skies may soon open up to supersonic travel. But there’s still a big problem | CNN": "The skies over States could<br />Be wide open for much<br />Air in near Not just passenger planes<br />Of sound barrier are..., in for first<br />Time they could be allowed<br />To do it soil days of... plane that flying at speeds<br />Mach was strictly due to... noise pollution from sonic booms Now<br />Moves are to lift that with... bill in Senate and similar House<br />Of That means, if Son of... gets here it<br />Will have more routes than its<br />There are several jets<br /><br />In that aim, to reach speeds.", "Germany’s straight-talking new leader is meeting with Trump. Here’s why it matters | CNN": "Merz will take seat in Oval on for<br />His first meeting with US Trump meeting comes as<br />Of once come, to fore Trump<br />Has another round of... on war no<br />To and pressure is mounting on Israel since<br />Merz has been on tour of... with Keir Starmer and Donald Tusk they<br />All appeared, in show of... one omission has been<br />With Trump while there have been<br />Phone calls two by clicks of... will mark start<br />Of new Germany’s as<br /><br />The which to beef up its<br />And fall line with Trump’s for."}