{"Trump tells CNN he’s ‘not even thinking about Elon’ and won’t speak to him ‘for a while’ | CNN Politics": "Trump told on, he is not<br />Musk and won’t be to him<br />In near future I’m not<br />Got poor guy’s got Trump said<br />In brief phone call come after day Trump<br />And Musk traded barbs on..., as their public Trump said<br />He was very with tech<br />For his massive tax spending cuts package while Musk<br />Back that Trump would have lost<br />The election him call<br /><br />With Trump talked jobs report<br />Which has since been released<br />And gas prices Asked if<br />He had call with Musk president No.", "How ‘Trees not Teslas’ campaign in a small Australian city turned into a tirade against Elon Musk | CNN": "When friends Neon and Zane<br />To stop Tesla from building on small<br />Block in their that strong views<br />The boss might help sway local but they<br />Had no how much or how<br />Far Musk sentiment had<br /><br />Spread beyond, of his influence States<br />Where until, he caused chaos in federal as<br />The head of, and Zane who<br />Asked to use, to avoid<br />By Musk say main aim of..., their campaign<br />Trees Not was, to preserve<br />Trees on site, in south of... state We’re struggling for<br />Green and it’s just to try.", "Car prices hold steady in May despite tariffs | CNN Business": "With new tariffs on cars<br />And car parts car paid slightly less May<br />For new vehicles from... on showed that<br />The price paid, for new cars<br />Edged down to last month to... dip came higher from average price<br />Rose last month, to are good<br />News for buyers that tariffs would put<br />Out of reach with car prices near highs<br />But it could, and consumer to spend<br />Car are not set by but<br />Through between car and car<br />The on cars, and parts took<br />That sells cars, in than Tesla half of<br />Sales last year were month later in May.", "Carlos Alcaraz reaches second straight final at Roland Garros as Lorenzo Musetti retires | CNN": "Reached his second straight final at Roland in fourth<br />Set of their match on Friday lost opening set<br />But was leading when gave<br />In his injury called<br /><br />It day Having won his<br />First French Open last year<br />Seed Alcaraz will now<br /><br />Face or Sinner in with... chance to win<br />His fifth grand slam though he<br />Had already dropped sets<br /><br />In against was first time<br />Had trailed at this year’s French<br />Tight set on serve until<br />The world No who has been.", "Elon Musk’s deep dive into politics was bad for business. His breakup with Trump could hurt even worse | CNN Business": "To go all, in on Donald Trump never made much<br />Sense his to up with Trump<br />Is to square, as close Trump<br />The piece of, his and maker of one<br />Of most visible that<br /><br />Can electric First Musk<br /><br />Turned off core on coasts by<br />And his influence to... help Trump to<br />The White House Then he took<br />To Trump their has with Musk<br />The domestic bill recent days public fight on<br />On Now war, of words with... risk off same<br />Trump who may have considered this week<br />Not that but, for approval that no.", "The US economy added 139,000 jobs in May, slightly more than expected | CNN Business": "The slowed down, in May adding jobs to<br />Of Statistics Last month’s<br /><br />Job gains which came in slightly more than<br />Marked retreat, from which was..., to rate held<br />At and wage gains continued to Those<br />Two on their own gain rate<br />That is cooling and not<br />The guts of that may be<br />Some warn want, to play Debbie by just<br />The concluding to worry chief told<br />In my we are to see<br />An were to have jobs last<br />Month and that rate held at..., to consensus of steady but cautious in face<br />Of said Doyle, for North at... firm Trump’s sweeping moves to<br />Have consumer and clouded lines of<br />Sight This is not freeze but.", "‘Harry Potter’ actor Tom Felton to reprise role as Draco Malfoy – on stage | CNN": "Tom best known, for in Harry film will<br />His role as this time on... stage announced<br />His role of, and Cursed Child<br />On in joint post with Harry and Harry on pages in joint<br />Reel Guess back, in familiar black suit<br />With wand pocket rings long<br />Blonde wig saying scared blonde<br />Hair came back on and started for some<br />Told Today show on It’s<br />Such huge part, of my It’s<br />Like me going back to... high school he<br />The portrayed, when he was... child described<br />His return, to as pinch.", "Trump preparing large-scale cancellation of federal funding for California, sources say | CNN Politics": "The Trump is, to large swath<br />Of for effort which could<br />As soon as, to are being told to<br />Start grants can, from On Capitol Hill<br />At least one was told recently by<br />That all grants, to state were..., to be cancelled to one<br />Of familiar with matter has reached<br />Out to White House for comment Trump has<br />Long made target Just last<br />Month he threatened to federal from<br />In event, of use funding as leverage to<br />His agenda cut million in flood<br />And Trump went state’s of earlier this.", "Gyaltsen Norbu: China-appointed Panchen Lama vows to make Tibetan Buddhism more Chinese in meeting with Xi Jinping | CNN": "Young Tibetan by atheist as<br />The Tibetan has pledged<br /><br />To make more was by as<br />The defiance of highest whose pick<br />For role boy has since vanished from public view China has yet<br />To reveal on of missing boy Lama is as<br />An by many at home<br />And in but, he is often in media line<br />And its policies rare<br /><br />With Chinese Xi in on... vowed to make<br />His own to, and advancing of state<br />News remarks, to campaign<br /><br />By Xi with aim to purge<br />Faiths of foreign and them.", "‘Good Night, and Good Luck’ revisits history and is set to make some on Saturday. Here’s how to watch | CNN": "Will be made, for first time<br />Of production will stream<br /><br />Live on Add, to or Google play Good<br />Night and Good Luck stars George<br />As he takes stand against<br />The witch hunts, of is based<br />On film of same name with... drew through line<br />From which Murrow to was... bad it near<br />As pervasive as it<br /><br />Is right now kind of fear<br />That you see kind of stretching through law<br />Firms and actor and said<br />The McCarthy used fear<br /><br />Of spread of foes in government as.", "What exactly is Trump’s new travel ban about? Not national security | CNN Politics": "Could ask what Trump’s new travel ban which<br />Is about Is it from..., as Trump said<br />Or small countries for modest of students who their<br />The drive for Trump’s ban was... clear he was<br />To deliver on ugly to ban<br />All from entering That<br /><br />Morphed course of years as to... court ban on<br />To by people from certain most of<br />Which were It was by to... Trump’s campaign<br />And on language in his<br />Third attempt at ban that<br />The Supreme Court gave its<br />To that ban We must not.", "Trump’s big bill includes an ‘unprecedented’ tax credit for a national school voucher program. Here’s how it would work | CNN Business": "Part of massive bill currently through<br />Known as Big Bill school voucher have long<br />For school choice, but have labeled tax cut<br />For to private schools has<br />Long been of, and It has<br />Most who served Trump his first<br />Term and it has fierce critics on left<br />But proposal known as<br /><br />The Choice for Act goes any not just<br />By creating first but<br /><br />By creating tax credit for wanting to cause<br />Up to area would<br /><br />Be to for, and receive<br />To use private school books.", "Billy Joel documentary reveals he attempted suicide twice and was in a coma after affair with friend’s wife | CNN": "At one point, to end it<br />All according to Billy and so<br />It Goes new film which at..., in New York<br />This week some, of two following with<br />His wife to first part of... told of Joel in band<br />With his best friend Jon Small<br />Whom went to live with home<br />By Small his wife and their<br />Son said film that there was... slow burn her<br />And said he felt about<br />Their resulting which ended in fight<br />And band splitting he to... Small that he<br />Was in love with they had<br />Child felt like told was just.", "Trump’s attacks on international student enrollment could ultimately shake the economy | CNN Business": "The Trump statements and actions aimed at<br />The have sent chill of through<br />These schools have more reliant on higher paid by<br />As state federal has<br /><br />Waned Now their could be shaken That could<br />Have on students and researchers warn<br />That effects could extend<br /><br />Well beyond lawns of college in students could through<br />The years to come skill premium as<br />We call it is large which<br />Is why highly earn so<br />Much more said, and professor at School<br />Of and Labor he added not only to through.", "Jay Emmanuel-Thomas: Former soccer player sentenced to four years in prison after orchestrating the smuggling of around $800,000 worth of cannabis | CNN": "Jay has been, to four years<br />In for his role in smuggling of over pounds of<br />Worth around, to both Chelmsford Crown Court<br />And Crime Agency whose<br /><br />Clubs Premier League side Arsenal Town<br />Two to cannabis from..., and transport<br />It back to said in statement two women were stopped<br />By in after at having flown from<br />And were charged with pair that<br />They were gold, in two each<br />To and their were dropped said<br />Last month to plot and was..., in and drug<br />In Appearing in court.", "Remember Angelina Jolie’s bombshell leather Versace dress? | CNN": "When wore plunging black gown<br />To red carpet of Mr and Mrs Smith leather years June<br />In Los Angeles as<br /><br />Of real with Brad Pitt reached<br />Pitch in as at film gown<br />With sheer black trim and lining that billowed from slit<br />As she exited walked<br /><br />The Mann Village in With..., her hair styled<br />In and her kept star was... streak of polished and glamorous year’s<br />White silk Oscars gown from..., her dress codes<br />Of pants muscle tees gothic gowns conversely dressed<br />Down for jeans brown and bleached.", "Hunter Biden drops lawsuit against Fox News | CNN Business": "On dropped Fox News that of..., him This is<br />The time Hunter has filed<br />And then Fox News stemmed from... that mock trial his dealings for former Joe son<br />Claimed Fox News porn laws him<br />They did not, in court filings why they<br />Dropped case though, they lost effort to move<br />The case from New York state<br />Court has reached out to Hunter in statement sent to<br />Fox News Media said<br /><br />We are pleased, to move on... now that Hunter has finally this<br />Case which proved, to be nothing more than.", "Stocks rise as Wall Street tries to cope with trade war, Trump-Musk spat | CNN Business": "Stocks rose on jobs report<br />Soothed nerves how has been holding up during of President Trump’s<br />The Dow was up by points<br />Or rose Nasdaq gained three<br />Were all trading their highest of day<br />The climbed points which is level it had<br />Not touched since was set to... end week green<br />Stock jumped higher from Labor showed added jobs last<br />Month which was, from month prior but better than Wall<br />Street has been, for sign of... that might be<br />Through stoked by Trump’s from on... showed in hiring though Friday’s helped while<br />Job growth May came in it.", "An exoplanet called K2-18b is highlighting the complexities of finding life beyond Earth | CNN": "Sign revealed, in seemed like<br />It might change, as we know<br />It had just hint of two<br />In called that on Earth are... by things It<br />Was most promising yet<br /><br />Of or traces of life<br />Linked to but weeks new findings search must<br />It was but it raised several red<br />Flags because that claim of... would be but<br />The strength of seemed to be<br />Too high for said Dr scholar at State<br />School of Earth, and Space while<br />The on by, or and or<br />Are with on point out that.", "The killing of Jonathan Joss – and a long neighborhood conflict | CNN": "Who moved to San six years<br />Said that they were warned right<br />An man who lived across<br />The street they were told they... said that Jonathan Joss<br />Would play drums on his roof<br />At all hours of night<br />And would yell, and slurs at..., they said that<br />When confronted Joss would<br /><br />Say that he was rehearsing for role<br />He was actor though he<br />Played role of John in show<br />King of Hill, for more than<br />In show’s neighbor said she<br />Lived next door, to Joss her.", "Israel confirms it is arming Hamas rivals in operation opposition calls ‘complete madness’ | CNN": "Is militias in Gaza in effort to counter in say<br />As warned that move endangers Prime Minister on<br />It good thing, in on social said Israel had<br />Clans in Gaza which that<br />It was done, of defense<br />And divulged move on News<br />On that Israel was..., to extremist groups Gaza and as<br />We’re about, of said one<br />Day on Army that Israel is<br />To crime families on... No one can<br />That these weapons will not<br />Be directed he said<br /><br />By one of who spoke with... Prime is acting to various ways<br />The heads of was by cabinet two.", "How has Fox News, Trump’s biggest media ally, handled the Elon Musk feud? | CNN Business": "The most powerful on... with Trump Musk<br />Barbs and personal at... each from their<br />The pair’s biggest at Fox<br />News on planet viewed as<br />For agenda seem to... be with since<br />The opinion have largely mourned feud<br />And appeared torn between<br /><br />Their two central at times<br />Them through screen, to Will Cain<br />That feud is not that we<br />For Greg pair knock it off<br />And make up Trump Age he<br />Said with this feud Trump ally and personal friend<br />Musk whom she called to see.", "Roland Garros: A visual guide to the iconic clay court grand slam | CNN": "It’s crunch time, in as we<br />Reach end of French World No<br />Came through battle and champion to<br />Make where she will face star<br />Who in men’s draw Alcaraz star to<br />Make it to, while grand slam<br />Is set to clash with world<br />No We look set for of... on red clay<br />Of you need, to know one<br />Of world’s oldest out as<br />The French only from France<br />To compete French was when<br />Were first new was built for<br />Of its Davis Cup title and named<br />Not but French who was killed.", "Patti LuPone’s drama is dividing the Broadway community ahead of the Tony Awards | CNN": "May have for some remarks<br />But that mean has dropped on... sparked she made<br />Stars and recent with New<br />To as said was not friend<br />Of performers from other then wrote<br />In which they, as degrading and is<br />Act of It, they wrote It<br />Is of that, in this industry have<br />For far too long too often group called<br />For to be, from events<br />Last on social in which<br />She said she hoped to be<br />To speak with pair to make<br />Am for words used New Yorker which were<br />And wrote my, and responses this which.", "Trump urges Supreme Court to allow mass layoffs at Education Department | CNN Politics": "Trump’s urged Court on to gut<br />The Department of key<br /><br />For that has been by series of lower court landed at high<br />Court days after Court of... court that halted mass firings at which<br />Was created Trump has<br /><br />Filed more than at Supreme<br />Court since he, to its to... Court its effort at management that<br />In view are left to states<br />Though Trump has vowed to get<br />Rid of lawyers told Court<br />In its filing on Friday that government has<br />Been clear that can Department of Trump.", "Army preparing for largest military parade on the capital’s streets in decades, featuring 7 million pounds of hardware | CNN Politics": "Of pounds of are expected to roll<br />Down streets less than two weeks<br />Dream of President Trump<br /><br />But concerns, how roads of... will fare under weight of<br />Tanks and fighting has seen<br />In decades is expected to bring<br />Pounds of vehicles as<br /><br />Well as price tag in tens<br />Of and this week has started roads that<br />Will and route on June will<br />Of tanks Bradley and Stryker through streets<br />Of as well, as and other said Nearly are set<br />To Most of tanks and are... en route to<br />From Fort Texas and will."}