{"Satellite images show damaged North Korean warship moved to drydock near Russian border | CNN": "North has moved new in botched<br />Launch to port near move analysts say<br />Could point to role for vessel by show<br />The destroyer as yet<br /><br />In port of part of North<br />Zone which its short with Russia while not<br />Like in city of where<br />The occurred has for modest and maintenance said<br />Yu director of fellow at for<br />And its to makes it key<br />Node for North, to and ties<br />With Yu said, from War at... West Point States<br />Calls zone point, of North recently North<br />Arms to Russia for use.", "Aid to Gaza hangs by a thread amid looting and starvation | CNN": "Of may have been and new<br />Plan to aid has begun<br />But there are that plight of... is Restrictions by on<br />Aid routes lack, of and of... tens of thousands of people are to<br />The UN other aid agencies that<br />Do get risk, in are starving This urgent of all<br />And allowing for to... aid at scale<br />Through routes UN, for of said<br />In its latest One woman Umm who<br />Was to get food for her<br />On at one, of established aid sites<br />Told We’re so that we’re willing to risk<br />Shot just for, of with is... UN while lack.", "Analysis: Trump seizes on Los Angeles protests in contentious use of military amid migrant crackdown | CNN Politics": "This is White House has been<br />For Unrest sparked by federal raids<br />In Los Angeles for<br /><br />Trump to stage, of force his<br />Of Guard troops, of and LA’s<br />Both appears at this point<br />To be mostly for show<br />To create, of tough but<br />The reservists’ at fraught<br /><br />Could and even trip wire that prompts<br />More aggressive said evening that US Marines<br />Were now on, to deploy<br />Of what would be and dubious if<br />They were to show up Los<br />Trump wrote on Truth on Monday bad LA.", "Derrick Henry: Adam Sandler to cast Baltimore Ravens RB in movie if he rushes for 2,000 yards in 2025 | CNN": "Seen of sports stars make movie years from<br />In Dan Ace Pet Detective and finally of<br />Stars in Space Jam and we<br />Could see one soon thanks to... bet between<br />Back and actor who is..., of work to<br />An appearance on Dan<br /><br />Show where if, he yards season would get<br />The back film, to proposal and veteran reached<br />Out to his friend in Gems<br />And star sent, for which was... shown to at<br />Yo just woke up You know<br />That why look on top of... fact that am<br />But love ya on said to... this year not.", "Hedge funds could make billions from a Fannie Mae and Freddie Mac spin-off | CNN Business": "Stake by of hedge funds may<br />Yield returns Trump but it<br />Risks through trillion Last month<br />Trump said he had plans to... take financing Mae Freddie Mac public Such move<br />Would end years, of two which<br />Have played central role housing by to<br />The Some experts warn that<br />And from government could<br /><br />Raise rates to like fixed loan<br />At time when out of reach<br />For Last week sent to William who leads<br />The Finance, him to pause<br />To take two risk that it<br />Could costs for group of has.", "China has a valuable card to play as it holds trade talks with the US today | CNN Business": "New round of trade between<br />The United States China was set<br />To begin, in as both<br />Sides try to truce last month<br />The fresh talks were announced<br />Last week after phone call<br />Trump and leader Xi which<br />To ease tensions that over past month<br />In Geneva in May<br /><br />The two sides, to roll back<br />On each other’s goods for<br />An mood was two points over rare earths<br />And its to rare earths their<br />Are expected to take<br /><br />Stage at London but experts say is<br />To give up its strategic grip over which are<br />In wide range, of and systems rare earth.", "Warner Bros. Discovery is splitting into two companies | CNN Business": "Is two publicly one<br /><br />The Max streaming and Warner and other and other first known<br />For now as will be led<br />By and second will be<br />Led by Gunnar aims to... each with greater and focus said statement for corporate to<br />Take effect by announcement is Warner to pressure and change<br />As in streaming is offering way<br />To Max part, of without<br />To That said that are part<br />Of continue to boast<br /><br />Strong and global This from... Max and our to industry it’s<br />The full of two strong businesses told.", "Apple is about to announce updates to how we use the iPhone and its other devices | CNN Business": "From its annual past<br /><br />Two years heralded big<br /><br />Which so far have flat This<br />Year tech badly needs to... win teased with<br />The on kicks off with at... ET on Monday from its<br />In event is where to... that runs on<br />Of devices used maker is to<br />To its Apple suite of... such as new<br />As well as that will Apple and more<br />The big of two years Vision Pro Apple tools failed<br />To live up, to hype Apple tried to<br />Sell its as, of computing Pro niche<br />Since shelves last year seen as.", "Chipotle is releasing its first new dip in five years | CNN Business": "Is obsession with ranch<br /><br />June chain is Ranch to its<br />The dip on ranch is seasoned with pepper cream other herbs spices that says<br />Will give its food kick Monday of Ranch<br />Is first time has new dip<br />In five years, in chain rolled<br />Out which boosted sales is..., for same as<br />It deals with, in consumer Sales fell<br />The first three months of year<br />Which says is due to customers back<br />The chains’ shares are down for<br />The year Ranch, in is popular has<br />On more menus in recent years Taco Bell added ranch with<br />To its crispy five ranch.", "Education Department pays over $7 million a month to employees forced to sit idle | CNN Politics": "The Department of is... more than million month to<br />It has forced, to go on... leave according to Government that<br />The could for years amid<br />Long court battle cuts by<br />The Trump has paid more than<br />To employees last three<br /><br />Months has after they were..., in March when<br />The cut nearly half of... its were laid<br />Off and hundreds more took<br />The were part, of Trump’s larger plan to<br />The Department of promise to through<br />Cuts across, of have faced<br />Cuts in recent months with..., in those facing terms of<br />The affected of workers were to<br />Be paid their June their last.", "Runaway pet zebra captured in Tennessee | CNN": "Pet that was on loose for<br />More than week, in and was... said Ed Zebra was captured in pasture near central said crews<br />The Ed was, and flown by<br />Back to waiting said statement by sheriff’s shows Ed<br />Wrapped in net with his head<br />Out as he is by to... Ed arrived<br />In on May said his owner him missing next day<br />The was spotted and filmed<br />To shut but Ed escaped<br />There were several to... Ed was filmed<br />Through became, of memes One<br />Fake showed Ed at House southern had him<br />Or on side, of road of... Ed came month.", "Oleksandr Usyk: Heavyweight boxing champion pleads with Trump, inviting him to spend a week in Ukraine: ‘Open your eyes, help my people’ | CNN": "World with US Trump with... Sports to help<br />As it its fight against<br />Trump please open eyes help<br />My sports star told and champion went<br />On to say, he believes<br />Trump needs to live up to..., his campaign<br />Of war after he promised to put<br />An end to, he should be<br />For words he said he said<br />That in month, or day he<br />Would stop this war he is... not for his<br />Words Why does, he to visit to host<br />Him in his house so he<br />Could what regular are... through day night<br />With barrage, of drone missile strikes offer him home.", "Sports betting is legal and growing more popular. Harassment of athletes by angry gamblers is rising too | CNN": "At last Grand Slam Track meet<br />Was except it how often it seems<br />To be happening gold<br /><br />Said she was at meet on... that grown man<br />Me around track as took<br />And signed for fans was to... post on which<br />Has since been, of while she<br />Was on starting line shouting choke going down Gabby bragged how<br />His had his bet made Gabby lose by<br />Her and it made my parlay win of<br />Two bets on said it had<br />Banned for from its explaining it strongest terms Threatening or<br />Is and has no place sports.", "Vladislav Horay: Ukrainian opera tenor killed on voluntary mission in Sumy | CNN": "Has been killed, while on mission to region where battle for was<br />With which said, in that he<br />Was and Honored of whose<br />Voice was known globe news has<br />The entire of opera house said<br />In post on was not only he was<br />An example of strength<br /><br />And in life post did not<br />Say how died, to June post<br />On he was, for joined National of<br />And Ballet, in and Britain and many to its<br />He toured Britain and at... Hall his last<br />Was just day, he died to... house which video of<br />The song Sole we share this."}