{"Typhoon rains batter Hong Kong before Wipha weakens to severe tropical storm in Guangdong | CNN": "Rains from pounded Hong Kong<br />On as storm on coast of... trees and scaffolding to<br />Seek at shelters Hong weather to No<br />Strong wind signal at Just<br />They had lowered in Asian hub to<br />From which had been for nearly to previous like<br />And which caused much more this<br />Time was limited to... trees and scaffolding Yuen<br />Told he was, in front of... that had fallen from compound in North<br />Point near harbor and been<br />Swept road as storm passed Hong<br />Kong more than, of rain fell.", "Rubio’s quiet ascent into Trump’s inner circle | CNN Politics": "It was after in when<br />Of State Marco in call<br />Trump and NATO Mark topic was Rubio on<br />His first trip, to as Trump’s<br />Top had just met with his<br />To that Trump was and felt<br />That had put time and effort war with<br />From according to senior White House<br />With in hopeful to Rubio said<br />Had shared new, and ideas how to<br />End war though said that peace<br />Asked directly what policy on<br />Was at that was of both<br />Sides and leaving that more<br />With could be on horizon he gave.", "Sergio García forced to finish Open without his driver after snapping club in frustration | CNN": "As and Ryder Cup icon boasts that<br />Most golf lovers could only dream of<br />Yet for few at on he<br />Was to even most of... played last holes<br />Of his at, his club just<br />Five shots into his final round at<br />With par wasted time showing his when<br />His drive from tee careened<br />Left rough fluid through from..., his swing ball<br />Still in air slammed his driver turf stopped<br />There but damage was done<br />As half of club bounced Tour<br />Bag With players to or<br />Clubs except, in abuse.", "‘Superman’ continues to soar at the box office | CNN Business": "Flew past for straight week grossing to top<br />The box office this James<br />Grossed in its, to provided by It<br />Has now grossed, and according to seen<br />Strong holds that is of word<br />Of mouth taking in on... big film like<br />This that opened well said<br />Shawn director of at..., and of Box<br />Is of Superman World<br /><br />Which came at No its third<br />Week held off this Know What<br />You Did Last, and Smurfs when<br />This big they drop off their<br />And third but it seems to... be this year.", "Chris Martin gives concertgoers warning before ‘Jumbotron Song’ following viral CEO video fallout | CNN": "Chris made sure, to give plenty of notice that they<br />May appear on their video screens<br />The Song at, their show Saturday night<br />We’d like to say hello<br />To some of you in crowd<br />Said on stage at Camp Randall in Madison to<br />On how we’re, to do that<br />Is we’re going to use<br />And put some, of you on... big screen Martin still strumming his went<br />On to joke, so please if<br />You done your do your now<br />Comes last week where Song camera turned<br />To man woman as they... watched stage two.", "Indonesian passenger ferry catches fire at sea, killing at least 5 | CNN": "Of caught fire at sea<br />On off island in killing at least<br />Five officials said More<br /><br />Than were rescued and efforts were was<br />To North province from island in province when it<br />Caught in waters near said<br />Vice commander of Fleet<br /><br />He said that three ships had<br />Been deployed, and crew members had been<br />So far rescue from local who saved<br />Some survivors life jackets as they<br />Were to islands in choppy five bodies There were<br />No reports, of and no.", "Facing pressure from all sides, ICE gets a windfall of cash to ramp up enforcement | CNN Politics": "The Trump is, for historic of cash<br />The mass that is expected to likely place pressure on federal at<br />The it all, since receiving its mass<br />Trump took office in Customs has fielded from people who think<br />They enough, and who think<br />They are doing too much<br />And that some is to Trump<br />And have touted work of... ICE and agents on ground<br />These are strong tough that love<br />Trump said at White House on..., if they tough<br />They survive, while from president has<br />Been for officers is... far more tense.", "Ann-Katrin Berger: Two-time cancer survivor puts in all-time great performance to propel Germany to Euro 2025 semifinals | CNN": "In terms of that survivor has making string of<br />Saves in Germany’s France<br /><br />On night is low down on... list not to<br />Say it huge night for her<br />She put one, of great as<br />Beat France penalty draw<br /><br />Time made nine saves in open play more<br />Than has managed in stage<br />Match at since per her save<br />To prevent own goal by<br />Minge was pick, of bunch as<br />She dived backwards and clawed<br />The it looked, for back of... net but did<br />Not stop there, in she kept.", "How Trump’s trade tariffs could affect the cost of coffee in the US – visualized | CNN Business": "Love for coffee has made<br />The dark brewed most drink country drink million cups of<br />Day though coffee have doubled in past<br />Five years States is of coffee in world<br />And its biggest is Earlier this<br />Month Trump threatened to tariffs on goods<br />If Luiz Lula da Silva on former look at<br />The trade US and why<br />Your cup of could be more<br />Soon if Trump goes ahead<br />.", "As Trump pushes Texas takeover in fight for House, Democrats plot their counterpunch | CNN Politics": "House are actively for<br /><br />Trench against, in next year’s<br />With talks taking shape scenes<br />To mount President Trump’s<br /><br />Play in Texas that aims<br />To cement, of for rest<br />Of his second term House<br />And his team have begun<br />And expensive to House<br /><br />Maps in several states<br /><br />To briefed on, they are their<br />Plans in New York New Jersey and Washington state<br />In hopes of at least of... seats next It’s<br />Clear attempt, to against<br /><br />The aggressive to boot.", "New tax law increases big beyond-the-grave tax break for the wealthy | CNN Business": "The estate tax has come<br />Long way since, when exemption was set<br />At amount has past quarter who die<br />In may leave tax free to..., their heirs up<br />To That level had been<br />Set to after this year<br />And snap back, to more than<br />Per but that won’t in level will by<br />To and for year thereafter of One<br />Big Act that pushed through time<br />For Trump to sign it into law on<br />His of Keep, in mind while<br />Not new level is doubled for married from first<br />Spouse who dies can be passed.", "How Republicans are trying to sell Trump’s ‘big, beautiful bill’ to voters | CNN Politics": "The White House just spent six<br />Months through Congress with no<br />For Now comes real Trump’s aides<br />And are on bid to sell<br />The big beautiful bill<br /><br />To who are with its skeptical of<br />What they have heard about<br />The domestic in part<br /><br />On dispatching top Trump<br /><br />The bill’s benefits is... seen as critical to<br />Of next to with more than<br />Half White House aides and for<br />White House cast Trump’s agenda as boon<br />For that could course of his<br />Years in office It comes.", "UC Berkeley professor killed in Athens: Suspect claims he ‘did it all for’ victim’s ex-wife, leaked police confession reveals | CNN": "On of marketing was..., his house Athens to pick<br />Up their two young It should<br />Have been if strained had been<br />The terms of, but made it<br />To front door, in broad this<br />Of he was shot times at... close range to<br />Died where he fell police<br />Said his body with wounds<br />Seen in grim, in as rushed<br />To his aid masked fled days<br />For his new, he told to..., her did it<br />All for our so that<br />We could have life without<br />He said to, he made to..., his arrest<br />One of most, of case is... that made to<br />By alleged have been widely leaked to<br />Greek Greece statements as by.", "Imperious Scottie Scheffler clinches Open Championship to move within one of career grand slam | CNN": "For few fleeting as he<br />Stared down at ball that had<br />Off lip back, to his feet<br />Looked Then world’s down next hole<br />And resumed, his march Open Not even shock double could take<br />Shine off capture of sport’s<br />On as world No to victory his<br />Fourth career at in Northern saw him<br />Clear of Harris on par<br />It leaves Masters just US away<br />From Gene Sarazen Ben<br /><br />Jack Woods following his<br /><br />At Augusta in April in grand<br />Slam and with next year’s US at Hills<br />In New York on June Scheffler has.", "Japan PM laments ‘harsh’ election result as upper house control slips | CNN": "Is to lose its in upper house exit polls showed<br />As with States looms while ballot does not<br />Prime falls it heaps on leader who also lost of<br />The more powerful house<br /><br />In October and partner seats to<br />Of election where half<br /><br />The seats were up for grabs<br />They are to seats poll by<br />Showed would hold seats if holds<br />Less than seats it would mark<br />Its worst since was formed That<br />Comes on top, of its worst<br />In years lower house vote<br />Which has left, to and calls.", "CNN Poll: Americans largely oppose Trump’s ramp-up of deportations | CNN Politics": "By Trump’s to scale up its<br />New poll by finds with rising has gone<br />Too far carrying out<br /><br />In survey say has gone<br />Too far when it comes to... up points since<br />And has risen in that<br />Time from nearly of now<br />Say that Trump’s has gone too<br />Far while just, of adults<br />Say same also say they... plans to build<br />New detention of holding up to<br />While oppose, for and Customs by billions of dollars two White<br />House reflected in sweeping bill that<br />Trump signed into law Nearly in efforts to end.", "California mom and son used handwritten notes to lead rescuers to their location in a remote forest | CNN": "Deep in woods miles from nearest road Tami Laird her<br />Son faced no cell no help<br />In sight car stuck on rough<br />Road had set off for what<br />Was supposed, to be trip<br />To Boy Scout Camp just few<br />From their home, they packed all<br />The essentials tents bedding and plenty of water to for<br />Few days of Like Laird trusted app on<br />Her phone she plugged in camp<br />And route as it led her<br />Off down rugged dirt road<br />At first she camp director had warned<br />The drive could be rough but.", "Boy survives Vietnam tourist boat sinking that killed dozens by sheltering in air pocket | CNN": "Boy survived, of boat which<br />Killed of people by sheltering air<br />Of it has had been traveling with<br />His in famed Ha Long Bay<br />When they were on became<br />Caught in sudden storm Trapped<br />In boat as it boy found<br />In air pocket where he<br />Stayed and waited for help<br />He was found by teams he<br />Was from mental he was... warmed up to<br />So fast boy said tried to... get out then<br />The me Search, and are for<br />And crew after ship Wonder Sea squall<br />On but have been by bad.", "At least 73 people seeking aid in Gaza killed by Israeli gunfire on Sunday, health ministry says | CNN": "At least people were killed<br />And around by in Gaza while seeking aid on<br />To health ministry Some<br /><br />Were killed northern said while<br />Six were killed, in Khan Younis in south<br />Of Strip It is unclear<br />The killed northern were all<br />Killed in same place or multiple It<br />Marks one of death tolls recent in which<br />Aid have been killed Defense<br />Said that troops had shots order to threat<br />Posed to them, of was northern Strip is<br />Of claim area of... are still being said any to residents of<br />In Beit These are zones dangerous said.", "Four-year-old Gazan girl dies of hunger, the latest victim of a deepening food crisis | CNN": "Old gave up, her fight for<br />Life on she died at central from brought<br />On by hunger and to... source her skeletal was<br />Laid out on slab of stone<br />At least children in Gaza have died<br />Of since conflict in as<br />Well as ten health says to... World Health most<br />Of these since at beginning of March<br />Was one of at least four<br />To succumb, in last three<br />Days just three months past hours deaths have<br />Been recorded due to... health says deepening first<br />Met month she was already weak with<br />And thin her said then that."}