{"Trump may have broken Wall Street | CNN Business": "This past April when President Trump<br />With of firing Chair Powell stocks dollar that even such move<br />Crossed red line You can’t even joke that<br />The Wall Street told us central bank’s is<br />Too himself said it was... not permitted law choir of Wall<br />Street about, of Reserve’s<br /><br />Cut to Trump is draft of... front of Wall<br />Street is cruising Stocks near<br />Highs and bond, but recovered Trump he<br />Was preparing to fire This seems<br />To point to two is only one way<br />To find out, and that crossing red line.", "LeBron James reportedly expected to remain with Lakers | CNN": "An James is, to remain<br />With Los Angeles James<br /><br />Have not talks trade or leading is to<br />To camp with this fall per<br />The report There been any signs either that James<br />Wants out James picked up his<br />Last month to, for eighth season with Lakers he will<br />Be returning to team<br /><br />This time on which for first<br />Time in his is acquired in stunning trade from<br />The is to be for Los<br />In trade or is made by<br />James’ Rich Paul last month that<br />This line We do want to... what’s best for.", "Shimabuku: What happens when an octopus engages with art? | CNN": "When was years old he took<br />An on tour, of it from... sea with help<br />Of Akashi from capital by<br />Train he live, in tank of... show it sights<br />Of before it to its<br />Home same day thought it would<br />Be nice artist now said<br />The call from, his home started to travel when was<br />Years old but, they so much<br />And when they do they are... just to be<br />To take on trip but not<br />To be eaten it on... took to see<br />The fish market where animal to<br />On sale artist said are... smart he told.", "Senate sends Trump’s DOGE cuts package to the House as deadline to pass it closes in | CNN Politics": "Trump is one step to having sign off<br />On slice of, his Department of Government cuts<br />In aid public now to... House for final where it<br />Must pass by rules are using to move<br />The without votes if it<br />Will then head, to Trump’s desk<br />Where expected to sign<br /><br />The push to claw back federal that<br />Had already sent out<br /><br />The door while most embraced<br />The cuts are, for more some<br />The raised over White House<br />Push that it set Two measure on final vote Sen<br />Who chairs Senate and Sen.", "State Department firings will hit Trump admin’s ability to tackle its own priorities, sources say | CNN Politics": "The mass firing of State<br />Could Trump to it has said<br />It and current told Scores<br />Of on issues has said<br />Are no longer were cut<br />Last week teams with change global and but<br />In force also on issues by of<br />State drug trafficking fraud<br /><br />Has said functions will be<br />Out by other parts of... State Department and were<br />To avoid core officials warn that<br />Lack of loss, of could be<br />The loss of, so much will<br />Make it harder for States<br />To stop from on soil one.", "Pope ‘deeply saddened’ after deadly strike on Gaza’s only Catholic church | CNN": "Pope was deeply two people were killed<br />In strike on church he said<br />In on Calling strike of... State Pietro said souls<br />Of deceased, to Almighty God Holy prays for<br />The those who grieve and for<br />The recovery of injured of which<br />Has for Catholics in Gaza said two<br />Were killed after Church was... struck by Israel on<br />With deep sorrow can now<br />That two persons were killed<br />As result, of apparent strike by<br />The that hit this said statement said it<br />Was aware, of reports.", "North Carolina Democrats fight over anti-Israel resolution | CNN Politics": "When committee of North<br /><br />Passed in June, for arms on... it set off<br />In with how it war Some<br />In North said was consistent with their<br />Of rights while it as backers are talking to other states who<br />Want to take same stand top<br />State chair North have declined<br />To war still, as it did<br />The November when Harris faced threats<br />From parts of base before<br />To Trump North where Sen Thom<br />An flip seat some in party are worried will make<br />It to race, they have to... win next year.", "Trump’s tax and spending law is a short-term win but long-term headache for Wall Street | CNN Business": "Trump’s tax spending is clarity for<br />Wall Street but health of US say One<br />Big Bill which Trump signed into law on<br />Is for of it provides<br />For but bill is set to... debt time to<br />Which could put, and on shakier grounds<br />For Wall Street is not to... spur growth or<br />Much of boost, to Green chief<br />At said law is not like<br />Trump’s tax cuts, and with tariffs it’s not<br />For There are tax that go<br />Some but more are in for<br />That are kind, of Green said<br />This is very tax package some worries for it.", "China puts new restrictions on EV battery technology in latest move to consolidate dominance | CNN Business": "Has put export on critical for<br />In move to its in sector that has<br />To lead global EV race<br />Used to EV, and for batteries were<br />To control list on list<br />Means transferring such as<br /><br />Through trade or will according to statement by Commerce new mirror just three<br />Months ago on rare earth<br />And their magnets used not<br />In EV but, in consumer and such<br />As jets dominance of... rare earths chain<br />Has emerged, as among<br /><br />Its most potent tools trade<br />War with States has emerged.", "Democrats are far more motivated than Republicans for next year’s midterms, CNN poll finds | CNN Politics": "Are far more than about<br />In next year’s, but perceptions of Party and its<br />Raise about, to on that<br />Of and registered say<br /><br />They are to vote in next<br />Year’s election to new<br /><br />Poll conducted by That<br /><br />By points deep same group just<br />Weeks before, and stands points<br />The share of, and who feel<br />The same way now but just<br />Of view Party mark for<br />In back to Still hold view<br />Of which is share in polling since just<br />The Jan on poll suggests.", "Copper prices have surged to record highs — and they could jump higher. Here’s why | CNN Business": "Is at core, of It’s wires of our in walls<br />Of homes engines of cars<br />Say Trump’s plan, for on red<br />Could goal of, while Trump’s of... on beginning sent prices in one<br />Day up to high of per<br />Pound It was, in on going back to<br />To and those could just be<br />Sign of things, to come tariff would be<br />Tax on of Ole head of... at Bank said<br />In note while Trump says his<br />Is to spur due to national there<br />Is no quick fix of copper it needs<br />From South Hansen said with... no clear path.", "Mamdani’s DC swing: House Democrats take notes and Bernie Sanders offers advice | CNN Politics": "Days won New York four years<br />He was to by Pelosi to speak<br />To House caucus by chair<br />Of House arm, as for country and welcomed at Joe<br />White House trip, to his own<br />Four There were no with senior and socialist had<br />With of Congress with Sen<br />Key endorser his stunning but party and many kept their<br />From about, his ideas and plans<br />To make him foil urged his<br />To be firm, in for leaders to rally him but<br />To more carefully what<br /><br />Said about First was breakfast by Rep.", "‘I don’t think anybody takes them seriously’: The House Freedom caucus is developing a reputation for folding | CNN Politics": "White board Monday night members of House<br />Their next big press to claw<br />Back more federal line<br /><br />With Department of Government cuts<br />Draft up deficit to... Trump’s big beautiful bill<br />Said Rep Keith Self who was... those in but<br />The group’s first, since Trump’s bill<br />Passed belied, they backed that<br />In and many in now<br />View them as, to put on... show red lines<br />Then cave if what wants This<br />All time Rep Max told they... will take you<br />To nth they will make making it as.", "Connie Francis, ‘Pretty Little Baby’ singer and actress, dead at 87 | CNN": "Pop and actress whose hits<br />Such as on Your and Sorry for of<br />Teens in has died according to her<br />Post from her, and friend Ron<br />She was It is with heavy heart sadness that you<br />Of my dear friend last night<br />Wrote in post on page for<br />Know that Connie would that<br />Her fans are first to learn<br />Of this sad news was recently for<br />Pain and had, to some earlier this<br />Month according to posts<br /><br />.", "Scottie Scheffler arrives at the Open with a chance to build on a meteoric rise. That success isn’t what fulfills him | CNN": "Means another for Scottie world No<br />Who won his third at May’s<br />At Quail Hollow Golf Club<br />Is to win this week’s Open at Royal By winning would he<br />Has been on last years aided by patient to game<br />Led to Tour wins three majors and counting if he<br />Were to capture fourth major in Northern would add<br />To his growing list of... men’s four major Old Young<br />Tom that hailed, from home of... golf in Scotland and South<br />Els It would be third different has<br />Won him US shy of... grand slam Only Gene Sarazen Ben.", "Coca-Cola cane sugar: Trump takes credit for changing American recipe | CNN Business": "Trump announced what could be<br />News to some on thanks to..., him Coke is<br />Its have been, to about<br />REAL Cane Sugar in Coke<br />In United States they... have agreed<br />To do so I’d like to... thank all of<br />Those in at Trump said post<br />To This will be good move<br />By them see It’s just spokesperson for<br />The did not change but told<br />In We President Trump’s<br /><br />For brand More on new offerings range<br />Will be shared soon Trump bubbling on<br />Day consumed by in Middle East over he’ll fire chair mounting from his.", "How the renewable energy industry lost a lobbying fight over Trump’s agenda bill | CNN Politics": "In May over at Capitol Hill<br />Club hole of choice for lobbyists just<br />Steps from Hill, to up for<br />Long day of, they pins that<br />Said support, in front of... Trump to talk<br />Oil and gas, they were there<br />To cajole, to protect<br /><br />Clean tax credits from Trump<br />Who had spent, his campaign<br />To kill them first draft of... tax and spending bill had<br />Just been it made steep cuts<br />To was bullish they had<br />An Wind solar had beaten from pure<br />Cost perspective build it.", "Democrats are making 2028 moves. Here’s what to know | CNN Politics": "Who will run, for in are..., and not so<br />Moves states plans This week it’s<br />Gov in South Last week it<br />Was Gov Gavin is closely all of<br />It We talked, in about<br />The list of, their strengths weaknesses what<br />Are signs serious ring<br /><br />The length is WOLF next general Why<br />Are we paying to this<br />Right First of all because<br />Some want us, to be paying go to<br />South just as state to go<br />To he picked state so that<br />We talk it, as have done<br />Was in New at end of... Pete went to<br />Though it’s not quite state This.", "What the brutal killing of a female police officer reveals about Kenya’s femicide crisis | CNN": "Roy steps into dark dusty room its<br />Still adorned, in white lace<br />Though it has been months since<br />Guests sat here last time he<br />And his wife were in this<br />Home in town, in was little year It<br />Was last time, he saw his<br />Like her father was officer she<br />Was in capital where<br /><br />She lived with, her two children in March<br />Her passed Tiffany to..., her home to<br />The appeared, in good spirits her long<br />Life before with her husband she never made it<br />Back to next woke up to... most phone call.", "Trump’s angry, erratic behavior explains his lowball poll numbers | CNN Politics": "Trump’s wild whirling day showed<br />Why most of, him and think<br />Their key issues and why<br />His most loyal will never him on<br />The mean has numb to his<br />Style of but, for him Wednesday was reckless ride on<br />Which he only that sent<br />Him back to White House Trump<br />More he may Chair Jerome<br />At which he polled about<br />What he should do would be<br />The most by, to Fed’s role<br />Of rates could tip cliff It<br />Might be riskiest grab<br /><br />Yet of Trump’s term since it.", "Kut, Iraq: Dozens killed as massive fire rips through multi-storey commercial building | CNN": "Huge tore through large in eastern of Kut<br />On of people and At... least men women and children died blaze<br />At and dozens more were..., from according to statement from Ministry of<br />On This fire claimed lives<br />Of most of whom died from... due to heavy smoke ministry said<br />That it was that has shaken of people it said<br />By showed building by flames<br />With group of on as battled blaze People were seen<br />Helped through small by responders in video from<br />The Defense teams to rescue more than.", "Russia tightens its stranglehold on Ukraine battlefield as Trump gifts Putin 50-day window | CNN": "Trump’s pause of on gifts Kremlin to gains<br />Of weeks which say put key<br />In east peril is thought<br />To be days, or weeks from... troops officials have said<br />Are amassing near their<br /><br />Front lines but, in past two<br />Weeks has also made small<br />But advances its forces in better to cut<br />Off troops three key towns on... front line Kremlin by new<br />Trump on Tuesday days it<br />Used to be it used to... be been through<br />All of this said new time<br />Frame well for goals Keir Giles.", "7-Eleven: Canadian retail giant Couche-Tard scraps $47 billion bid for Japan’s Seven & i | CNN Business": "On pulled its bid to buy<br />Lack of by move ends what<br />Could have been, of as Circle sought to<br />Store by There has been no<br />Or constructive from that<br /><br />Would advancement of any to comments made publicly by<br />Said in letter to its<br />Board of Rather you have<br />In campaign, of and to... great of its<br />The said Seven said statement that while<br />We are by ACT’s decision and with<br />Their we are not surprised<br />Is seen as test case for<br />To withdrawal came after Steel was<br />To acquire Steel billion shares fell.", "UK plans to lower voting age to 16 in landmark electoral reform | CNN": "The said on it planned to... give and right<br />To vote all, in said changes which are<br />To approvals would voting rights with<br />And Wales where, in devolved<br />We are taking to break<br />Down to that will ensure<br />More have to Prime said statement at general was<br />The at general since<br /><br />To report, to House of... that have lowered age to<br />Shows it has had no on..., and that were<br />More to vote than those first<br />At whose has, in elected by year<br />Had said it would age if.", "They bought a house expecting mortgage rates to fall. They’re still waiting | CNN Business": "Joe expect, to keep his<br />Rate at for long when he<br />New home with, his last summer in Myrtle Beach South<br />Soon he reasoned he was... wrong We thought<br />They would go down and fairly said of<br />Rates It has caught us by<br />That it come down rates US have hovered for nearly three years<br />Who bought homes, in that time<br />Might have lower rates chance<br />To by now, but so far<br />Come Combined with home prices costs of<br />Are more than, for is one<br />Of who locked, in home loan.", "Wyndham Clark reportedly banned from Oakmont Country Club due to ‘recent behavior’ at US Open | CNN": "Clark has been banned from Country Club after he caused<br />To club’s locker room at... June’s According to letter from Country Club president John<br />Lynch sent to that Golf which<br />Like is part, of obtained<br />The decision was made<br /><br />Of Clark’s recent of you<br />Have about Clark and steps<br />In response, to his recent with Board<br />Has been made that Clark will<br />No be on said This will<br />In effect, and approved<br /><br />By Board would be contingent Clark number of full<br />For to charity of... Board’s and of<br />Has Club States Golf of golf."}