{"Summer McIntosh breaks another world record, smashing decade-old 200m individual medley mark | CNN": "Made for second time three<br />Days at Swimming on Monday to break<br />The world front, of crowd at... Place in finished with time<br />Of record, of set by<br />In It’s been one of those<br />Been in back, of my mind<br />Since two years who won gold<br />In at Paris Games said<br />Been on door on this one<br />Just tried to chip away<br />Chip away at it to... do it it’s<br />Kind of like got that done’<br />The sees swimmers leg of... all four stokes<br />And in one race her speed<br />For clean leg which gave her.", "Everyone says tech’s next big iPhone moment is here. They’re wrong | CNN Business": "In more than two years AI has gone<br />From what was once niche to..., for what some<br />Tech are calling wave that<br />Could be as life as AI is being framed as<br />The next major of how<br />Use but that shift is very from how<br />Have played out like and while<br />And release new once or<br />Twice year AI are constantly are<br />Far less than are far faster than once<br />Year These are fast and furious of<br />The nonprofit for told<br /><br />Can be difficult to..., so and way<br />Might look different from..., how web browsers and social apps have.", "Frederick Forsyth: ‘Day of the Jackal’ author dies at 86 | CNN": "The Day of, and has died<br />Brief his agent said Monday he was<br />Lloyd his agent said died<br />At home early by his<br />We mourn passing of one<br />Of world’s greatest Lloyd said<br />Born in Kent, in served as<br />Air Force pilot he covered of French<br />Charles de Gaulle, in which for<br />The Day of, his about<br />In book him fame It was... made film starring Fox as<br />The more recently Lynch<br /><br />In told that, he had also worked for<br />The years starting from when<br />He war said, he did other jobs for.", "Greta Thunberg departs Israel on flight to Paris after detention aboard aid ship | CNN": "And rights activist on... flight to France<br />On detained by aboard<br /><br />An aid ship bound for Gaza just Israel on<br />Flight to Sweden wrote post<br />On two of young aboard<br />Plane is climate who has<br />Long air travel to climate in New<br />York in At least five of..., her crew members who were<br />On board aid ship have to..., and will be<br />To on Tuesday Last night<br />Was to see six French nationals who<br />Were arrested by their<br /><br />Have been One, of them to..., and is to<br />The five will be deported wrote post.", "Who are the people protesting in Los Angeles? | CNN": "Joined Los Angeles day<br /><br />This to justice for dozens of migrants by armed<br />ICE in armored who targeted of<br />On and said Guard began<br />To push back, they threw tear<br />Gas at us, and we were... what they were<br />Us to do, she said Then<br />Just got really and angry and think<br />Where you see things to as<br />The sun set, how descended Some torched<br />Cars Some rained rocks down on... shut down traffic spray painted on federal At<br />Least were Los said raids are..., in with Trump<br />To but President Trump’s.", "Leaders of ‘orgasmic meditation’ company OneTaste convicted in forced labor trial | CNN Business": "The that have been convicted of federal forced<br />On found founder of Inc<br />And sales guilty for less<br />Than two days two each face<br />Up to years, in with sentencing due<br />The two women ran scheme<br />That groomed of, them of sexual to<br />Do their bidding they said<br />And used sexual to... force acts they<br />Found or such, as sex with..., or two told<br />The acts were, in obtain<br />And their to said pay promised to even forced some<br />Of them to take out new<br />Cards to taking in her.", "Hegseth back in the spotlight with series of Capitol Hill hearings | CNN Politics": "Of Defense Pete heads to... Hill for series of hearings next week<br />That are likely to be<br />Test of his what is widely viewed as<br />First few months on job hearings which Tuesday in front<br />Of House will be first time<br />Will to Congress since his<br />In and negative spring<br /><br />And dysfunction at will<br /><br />Have their first chance to question oath his<br />Role in which, he and other plans text<br />Chain that prominent who<br /><br />Will be Chairman of Joint<br />Chiefs of Staff Gen Dan Caine.", "Indian coast guard battles massive fire on container ship listing off Kerala | CNN": "Coast guard is blaze aboard<br />Ship to sink miles off coast<br />Of as search, for four missing crew members showed flames<br />And plumes of smoke from Wan<br />That was tilting to water to Indian Coast<br />Guard Explosions were still<br /><br />Heard on Tuesday more than<br />The Coast Guard, to distress<br />Call Around time ship’s crew<br />Caused by said, though it’s not<br />Clear what caused blast Eighteen<br />Were from stricken ship with... some according to Port<br />Of Four crew Wan is managed by Wan.", "Apple may be the only tech company getting AI right, actually | CNN Business": "Big is Silicon has<br /><br />Been it every year<br /><br />Since and more years events<br />Have become, of tech hype<br />Chance for Apple to show<br />Off its latest to folks<br />Who build apps, for those products Look they<br />Can’t all be comes around<br />Months like Super Bowl or<br />The sometimes it feels like<br />An times it feels like we’re... just through paces and putting on little show for<br />The fans This year’s was more<br />The it was far from like<br />Beats seemed totally fine.", "How the $1,000-per-baby ‘Trump accounts’ would work and who would benefit most | CNN Business": "On face of it Trump which<br />Would provide, of with to... on behalf<br />Of their child’s would be plus<br />For It’s that will help millions of harness strength of<br />To lift up next and really be getting big jump<br />On life President Trump<br /><br />Said at White House event<br />The which is, in bill also known as<br />The One Big Bill Act now<br />In could give leg up to... new to build<br />For their while has its merits it may<br />Not do as much as it<br />Could to help tens of millions of families who<br />Will to save, for their children This meets.", "Princess Diana gowns star in ‘largest’ auction of late royal’s fashion | CNN": "Ski suit given to her<br />By first lady and floral dress she<br />Wore to visit in are..., of late royal’s to auction this month<br />To Wales hats, and shoes as<br />Well as sketches and letters sale has<br />Been described by collection of royal’s to go<br />The Style Royal is bids<br />Of live sale at in Beverly Hills<br />This month highest to two<br />On occasions and during to Spain<br />And cream silk gown of Wales<br />Wore her tour, of Gulf Both<br />Are expected to fetch<br /><br />And according to auction house former dress was<br />By salon whose Sassoon.", "Ultrarunner Will Goodge endured hallucinations and sleepless nights during 2,387-mile run across Australia in 35 days | CNN": "The first nine days Will says<br />Felt like cycle of running and eating and eating it was<br />Time to sleep, when he did<br />Try to close, his eyes sleep<br />Would feel only and restless and regular kind<br />Of like dreaming but at... same time says<br />And deep aching had settled his muscles and bones<br />At this point, and had barely scratched surface of his<br />To run Thousands of miles<br />Of still lay, in front of..., him and felt<br />Like it would last forever was having what was<br />And just felt trapped tells Sports.", "What to watch in Tuesday’s primaries for New Jersey governor | CNN Politics": "New will their, for on Tuesday of parties in state<br />That towards Trump in has<br />Jack who led race before<br />He secured Trump’s endorsement last month<br />The side has slate of moderate though<br />Some observers see Rep<br /><br />As of field Trump of Garden State has<br />Played role both, for his while<br />As against, him Both will<br />Have to with Trump in general though<br />He lost New by six points<br />To Vice President Trump<br /><br />Made gains state, his of by<br />Points compared, to are running to Gov.", "The rare earths problem: Why it could soon be more difficult to get a car, electronics or even an MRI | CNN Business": "Call it chip on how one<br />Told is possible of... that are now<br />Stage in global trade war<br />Low on those could chip shortage that jacked<br />Up car prices used new<br />Has on those which are critical to<br />From cars to jet to like<br />And for contrast dye used<br />In machines, and some cancer drugs recently made<br />It to get, them new licensing on<br />The flow of most of world<br />The United States from..., and are meeting in London this week<br />To talk new trade deal rare<br />Earths are certainly part.", "Analysis: Trump is acting like an authoritarian; California’s crisis now rests on what he does next | CNN Politics": "Trump is talking and acting like as<br />He clash with, his migration Much now<br />On tough or, if to take<br />An across line in his<br />Zeal for rule, in on Monday of States<br />The seen as world’s top steward of for<br />Years endorsed, of most populous state<br />Think it would be great thing<br />Trump convicted to serve<br /><br />As told as, he strode South<br />Lawn of White House Trump hundreds of Los<br />And arrival of more<br /><br />Guard reservists of that<br /><br />Saw with burning cars areas of<br />The were triggered by Customs sweeps seeking in city and state.", "At least nine killed in Austria school shooting, authorities say | CNN": "At high school, in said Tuesday nine people in one<br />Of worst history death<br /><br />Toll from earlier of... eight told that<br />The between, and years old<br />The is also dead school<br />Has been added more people are injured said Officers first<br />To reports, of suspected at school<br />In at am time am Several were<br />To site school was and area was<br />With no further said on... at on at<br />School in is that has deeply This act<br />Tore young people from life<br />They still had, of them There."}