{"Bengaluru crowd crush: Several feared dead outside a cricket stadium in India | CNN": "Were feared dead, and more injured in crowd<br />Crush on Wednesday in southern state incident as<br />Of fans gathered in city to winners of Indian League<br />Which is world’s most Times of... at least seven had died<br />In crush Local news channels showed visuals of shifting and those<br />Who fell to chief of state<br />Told reporters that crowd<br /><br />Was event was held to... first Premier<br />League win on Crowd are common in India at<br />Least were killed, as tens of... rushed to bathe<br />In world’s largest This is..., and will be.", "Russia nears 1 million war casualties in Ukraine, study finds | CNN": "Have been killed, or in new<br />Of cost of on his neighbor will likely hit million mark this<br />Said by Center for Studies think tank<br />In It said was sign of..., for his soldiers of Russian so far<br />As are dead, to No Soviet or<br />War since World War has even come close<br />To Ukraine, in terms of... rate it said<br />Has sustained it with deaths<br />Does not its own in any and is<br />To its own are in line<br />With and States, in March British that Russia had since<br />For months it has judged that.", "Enhanced Games: World Aquatics to ban participants of controversial competition | CNN": "World for all sports has new<br />Rule that will ban those who<br />In Enhanced Games Enhanced<br /><br />Games says it is to will<br />To use drugs will not be<br />And will be no to which<br />They have taken in order to games<br />Will take place, in May from..., and athletics On Tuesday World statement new which<br />Will be Under new who<br />Or in sporting that use<br />Of advancements or other that may<br />Will not be, to hold with... World or to<br />In World or said in statement This would<br />To roles such, as coach team.", "Inside Trump’s gutting of the DOJ unit that enforces voting laws | CNN Politics": "The Department’s tasked with... laws is down<br />From attorneys to as<br /><br />Most of its staff has face<br />Of Trump mass that has whittled down to<br />Fifth of its size came after by leaders to smear<br />The work of, and career<br />The Trump who rights division which houses has joked<br />How division has emptied out More<br />Than attorneys from often called crown<br />Of department took offered by crying mass leaking group for<br />Rights attorneys told Tucker in recent These are<br />All of stages of grief.", "Hackers are using a modified Salesforce app to trick employees and extort companies, Google says | CNN Business": "Are employees at Europe and into of app<br />The steal reams, of gain to... cloud and those<br />Said on Wednesday tracked by<br />The Threat Group, as have proven at tricking of Data tool used<br />To bulk data said hackers use voice<br />Calls to trick app page to... app created by hackers to Data if app<br />The gain to, and directly from customer said<br />The gives hackers to move<br />On cloud services tied<br /><br />To campaign shares with ties<br />To and loosely known as<br />The Com known, for small disparate groups.", "Karine Jean-Pierre, Biden’s former press secretary, says she’s now an independent | CNN Politics": "Who served as White House press<br />Joe has switched, her to publishing of<br />Her book who has worked for<br />Is set to new book that<br />Will discuss, to bow out<br />Of election and voters to look<br />The description of her<br /><br />Book Look Broken White House<br />The Lines says, she come to..., her decision to be<br />An book which will be will<br />The three weeks that led to..., his bid for<br />Term and by that led to..., his decision to book<br />From Lit of Book Group That<br />Book may further should have.", "Gaza Humanitarian Foundation (GHF): Controversial Gaza aid operation pauses for 24 hours after days of deadly shootings | CNN": "The aid from new and into was paused<br />For on Wednesday en route<br />To site came, for three straight<br />Days with fatal said that<br />Its hubs would be closed due<br />To work to hope of food<br />And so could make on routes<br />To at sites is expected to Forces warned who<br />An on aid strip by meager of food<br />And supplies, in past couple of weeks<br />To stay from sites on roads<br />To is strictly as these<br />Are considered zones Arabic wrote<br />In post on, for said was..., in talks with<br />The beyond, of zone asked.", "Immigration judge says she needs more time to review case of a framed migrant accused of threatening Trump | CNN Politics": "An judge on said she needed more time<br />To case of who police<br />Say was set up and hearing for week<br />The man Judge, in Wisconsin jail currently held<br />In late May, and Enforcement to be<br />From him threatening to... kill Trump quickly and from<br />Phone calls that man who had<br />The have migrant court That<br />Man Scott has now been charged<br />With new counts theft Judge said<br />She more time, to filed by<br />The which was last night by<br />His attorney has now<br /><br />To that letter Cain told.", "As US companies scramble to move supply chains, this small island could be the answer | CNN Business": "At start of Carr of World<br />Booked plane ticket to President Trump<br />Had just duty on Canada what<br />Would be first, of on other World Emblem world’s largest of clothing which counts<br />The Department of UPS<br /><br />And as customers of... its in It<br />Just came really fast lot<br />Than expected said Carr<br /><br />Of were to say this is... nuts We need<br />To change this right now while<br />Trump his tariff to goods<br />That comply with free trade<br />With and Canada trade<br /><br />Was enough, to start moving his chain.", "Erin Patterson: Woman accused of triple murder says foraged mushrooms may have been added to meal | CNN": "The accused, of three guests<br />With meal laced with death cap<br />Told her trial on Wednesday she may<br />Have to lunch, her bland On... third day of<br />On was taken through of..., when accused<br />Of death cap, to Beef Wellington meal<br />She cooked for four guests her<br />At her house, in small town<br />Of has three counts of murder death of<br />Her Don Patterson Gail<br /><br />And she also to kill<br />Fourth lunch guest, her back to... days before<br />The lunch lawyer asked where<br />She’d bought Patterson said.", "Top Salvadoran ex-military officers sentenced for wartime killing of Dutch journalists | CNN": "In El sentenced three officers to<br />Years in prison for murder of four<br />Dutch in one, of war three<br />Were charged on, for of journalists Koos<br />Jan Johannes Jan Hans<br /><br />Ter who were, for on group<br />Of Front some, of whom were... armed UN truth<br />Years found was planned to kill<br />The was closed, and details<br />The defendants’ pleas arguments were<br />Not made public El civil war stretched<br />From guerrillas and leaving dead more<br />Was by jury in northern town of<br />Two Police chief Francisco and former All three.", "Tim McGraw and Faith Hill’s daughter Gracie marks Pride: ‘I love being queer’ | CNN": "Is embracing Pride month<br /><br />In post on, of and actors Tim Faith<br />Hill of its, in month of... June Pride love<br />Queer she wrote it up with... more extensive It has<br />Come to my that some tabloids have taken and have<br />Used it as out’ Let me<br />Be clear been out and proud<br />Queer and have it way she<br />Wrote have will be about<br />My support, of rights but<br />Thank you very much to... these for shedding light that<br />It’s pride so out there have<br />The support love or from..., their when it.", "Coal miners backed Trump. He’s dismantled their safety net | CNN": "Of coal deep, of West David Bounds now<br />To milk to, for breath black<br />Lung disease that forced him<br />To retire may kill him<br />Bounds believes proud of being coal miner but he<br />Want else to face his fate<br />Or confront on job It’s<br />Worse and worse, and worse as<br />Go along want to see<br />In that shape, if it can<br />Be prevented he told<br /><br />So Bounds has watched in as<br />The Trump of have slashed for<br />Coal has found that in just<br />Five months President Trump<br /><br />The net that has for years.", "Musk joins Trump in playing legislative arsonist | CNN Politics": "For years have dealt with president Trump<br />Who engaged, in aware<br /><br />The right up point he to... make splash gently he might<br />Get in little he waits<br />And then just blows up whole<br />Thing to scramble to his<br />Whims as far back as Trump<br />To It’s tough, for as it<br />Is but now, they have two<br />Their Musk on lit what Trump’s<br />His Big Beautiful Bill<br /><br />Which is largely to his<br />Tax cuts bill has of both<br />Who are worried it national debt<br />And who want, to protect.", "Is Kylie Jenner’s surgery revelation a setback for beauty standards? | CNN": "Has despite its long been<br />The rich famous few stars<br />Who do publicly are..., to or pressure to for<br />In their Even then often share less<br />Grande admitting that she<br /><br />Had lip fillers and offer his newly were by<br />Jaw or their with regret<br />Vogue she wished, she had kept<br />The nose of, my so when<br />Up with star, her breast on... this week it<br />Was not just that surprised<br />Fans it was tone and casual with<br />Which she did it Responding to content can you<br />Just tell what it is you.", "Sean ‘Diddy’ Combs’ connection to a famous gangster is part of his family lore | CNN": "As of Sean Combs continues parts of<br />His past are That his father’s with late<br />Frank Combs was drug who was... shot in when<br />His son Sean Combs was three<br />Years old not, but he was..., in and he<br />Was his thing Combs told journalist years<br />And we all know what that<br />Gets you only to have<br />You end up, in jail or<br />Dead It is why in those<br />In that Combs was clear that<br />His did not work for either or famed<br />Barnes but rather was as<br />Big as them, in game younger Combs shy.", "The Trump administration just doubled the tariffs on steel and aluminum imports. Here’s what that means | CNN Business": "On steel doubled to as<br />Of am ET on move cheered<br />By beleaguered steel industry but<br />To that heavily use<br /><br />The car makers to can<br />The jump taxes is latest in President Trump’s<br />Trade war part, of broad range<br />Of since but steel are to..., him and his<br />Base of US that has<br />Since on hard times leap tariffs won’t hit<br />But say that on construction car lots<br />And are all, but from higher and while<br />The could steel jobs they could<br />Hurt employment in much.", "Meghan, Duchess of Sussex shares rare photos of Lilibet in birthday post | CNN": "Of has shared rare of her<br />To mark princess’ fourth one<br />On can be seen whose face<br />Is behind, her hand arm<br />To Four years, she came into lives each<br />Day is brighter and better of it<br />Thanks to all, of those sending love her<br />Day wrote Meghan in caption in post<br />Shows whose face is in shortly her birth<br />The was born on June year<br />The Duke Duchess of Sussex stepped back<br />From their roles, as and moved<br />To United States Meghan and husband Prince Harry are known<br />To guard privacy of..., and Prince Archie did Christmas card last.", "Jessie J says she’s been diagnosed with breast cancer | CNN": "Has said been with breast cancer star said<br />That she will soon though she<br />Was keen to stress that cancer has been<br />Caught Price Tag whose real name<br />Is broke news, in on saying that she<br />Has been out tests was with... breast she Wednesday I’m word<br />Sucks in any form but<br />I’m on to word she said<br />Am to for bit Ball she<br />Will be on June to have<br />My and will come back with... tits and more<br />She said that, she about<br />But to go just to be<br />And share it One because.", "House GOP ‘big, beautiful bill’ would increase the deficit by $2.4 trillion, CBO says | CNN Politics": "House tax spending cuts package would add<br />To next to bill that narrowly last<br />Month more people would be<br />In due large part to package’s cuts<br />To found highly score which<br />Was released could John task<br />Of that his would approve<br />Have already House package’s to<br />The want to make cuts while<br />Are of major to nation’s net House<br />Bill adds to on which he<br />Wrote on Tuesday would bankrupt posts follow with Morning in which<br />Musk said bill would and work<br />Of his of I’m but just.", "‘Back to the Future’ stars reunite in plea for return of long-lost Gibson guitar | CNN": "The cast of Back to Future has not<br />For reboot, but to help<br />Piece of movie that went<br />Years ago hunt is for<br />The red Gibson which was... played by Michael Fox movie as part<br />Of Enchantment Sea school<br /><br />Dance scene tried, to production of sequel but they<br />Were in video by<br /><br />On Fox Christopher Lloyd<br /><br />Lea and Harry made plea<br />To fans to help them track<br />Down It’s lost, in said Fox<br />We need that Lloyd his character Doc<br />Brown guitar has been lost.", "James Blunt celebrates the 20th anniversary of his biggest hit that he calls ‘a bit creepy’ | CNN": "James Blunt’s song is beloved<br />Though it’s not what some people shared video post<br />On in which on his hit<br />Years ago song that bought<br />Me this house Blunt said thought<br />Song about high as kite<br />On drugs stalking would quite<br />So Thank you guys are beautiful song<br />Off his album Back to... hit in former wrote for<br />The about, and talked for<br />The tune One day was on..., in and saw<br />An with her new he wrote<br />Eyes met but we just walked<br />Past each other and went.", "US-China trade talks: Trump calls dealmaking with President Xi ‘extremely hard’ as frictions rise | CNN Business": "Trump says leader Xi is... hard to make<br />Deal with comment that comes<br />As rise two weeks they reached<br />An agreement to trade<br /><br />Like XI of have and will<br />But he is TOUGH and HARD<br />TO MAKE DEAL Trump wrote post<br />On his Truth, in time Tensions have ratcheted up<br />The United States China as trade<br />Talks between two sides to... stall just weeks<br />Truce agreed, to last month<br />In Geneva That truce<br /><br />Hit pause on, of sparked by<br />Of on into Trump has.", "Private-sector firms added just 37,000 jobs in May, the lowest total in more than two years | CNN Business": "High has hiring to halt<br />At Job growth slowed for second month row<br />At firms which just jobs May<br />To new estimates by<br /><br />May’s job gains which marked sharp<br />From jobs added that for<br />Came in for jobs to be<br />It’s since March said weak numbers we’re seeing now does<br />Not point to, but there is... chief at said<br />Call with Richardson pegged<br /><br />The loss of, and trade policy bulk<br />Of came from goods which lost<br />Jobs according to US stock futures which had<br />Been dropped after Dow futures fell points.", "Trump says Putin told him in phone call he will respond to Ukraine’s weekend drone attacks | CNN Politics": "Told Trump phone call that he<br />Was to drone Trump said setting up conflict just as<br />The hopes to end to war<br />The was their time in matter of weeks<br />Trump who call, in post on... Truth made no<br />Of applying on Russian to or<br />To his for drone attack<br />On Trump would not yield end<br />To war We on docked airplanes by also that have<br />Been place by both sides Trump<br />Wrote in post on Truth Social It was<br />Good but not that will lead<br />To Peace President did<br /><br />Say and very that he.", "Trump administration takes hundreds of migrant children out of their homes, into government custody | CNN Politics": "The Trump is, of already in States<br />Out of their homes and into at times<br />Them from their, and it more<br />For them to be released<br />To familiar with matter Trump his<br />Top aides have, of who at..., or as of<br />His and his, of Trump argue that hundreds of thousands of those<br />Went for are, in while former that surge<br />Of kids placed on they several field<br />Claims that there are large numbers of children from system Still notion that there<br />Are of such has served as<br />The campaign by Trump to... set up war.", "Iran’s supreme leader slams US nuclear proposal, says it will continue to enrich uranium | CNN": "Has denounced by United States aimed<br />At and that, his retains<br />Of become, in Despite<br /><br />Rounds of talks two sides to... thrash out new<br />Deal points with on its right<br />To enrichment first word<br /><br />Of is that should not have<br />And should on States told crowd<br />In death of is clear they... do damn thing<br />In this matter he said<br />The sent nuclear deal<br /><br />To on Saturday has<br /><br />Learned this US could nuclear join<br />That would of, for amount<br />Of time That would be to..., and Atomic said Wednesday that is<br />To allow States to give.", "Ispace moon landing: Why the spacecraft spent months, not days, in space | CNN": "Five months rocket launched out<br />Of two lunar Blue Ghost<br />From zoomed to moon and March<br />It became first commercial to land<br />On developed by is... just now at<br />Its as lunar is called<br />Is on track, to make its<br />At ET on three months after its buddy made history too<br />Out on first, and said that<br />Slow and steady path to... moon can offer some What<br />Is good this, or is every day<br />There are small things that happen we Chief<br />Told in This, to is really phase Three<br />Teams of have been in out."}