{"How Todd and Julie Chrisley built, lost and could rebuild an empire in Trump’s America | CNN": "In their to miles apart<br />Stars and Todd played voice message from listener named<br />Said she was, for and was... that this test<br />Will become who with her<br />Made their family on... brand defined<br />By and scripture said she<br />Know for fact that this is... not end for<br />Us know that doubt in my<br />Mind am very in my<br />Faith know where stand she said<br />In released, in More than<br />Two years later are free<br />Thanks to pardon from President Trump<br />Who knows thing, or two honing through couple were of<br />To defraud banks out of... more than million in loans.", "Alex Ovechkin: Washington Capitals say no decision yet on star’s future after email from sales staffer goes viral | CNN": "The knocked down that next year<br />Will be leading goal scorer last league<br />No decision has been<br /><br />Made on Russian’s jumped on... sent by member of team’s<br />Sales staff that said would be<br />Last in league, as claim went<br />On team said was sent error No has<br />Been made on team’s relations said on<br />An email was sent from... with sales that<br />To next year will be years<br />Old when next, in fall he’ll<br />Be his season in league<br />All with Capitals year<br /><br />Of he signed, in That ending with him.", "Appeals court pauses ruling that blocked Trump’s tariffs | CNN Business": "Court has paused night’s from Court<br />Of Trade that blocked Trump’s tariffs States Court<br />Of Appeals, for restores<br /><br />Trump’s to levy he earlier this<br />Year appeals court that both<br />Sides provide on of blocking of Trump’s<br />To be filed by next month<br />The pause adds, to confusion and swirling Trump’s tariffs which have<br />Been key pillar of his<br />The Court of Trade ruled Wednesday that Trump<br />Did not have Act to sweeping Trump setting course for<br />The that Trump will on but.", "National Geographic Traveller competition winning photos | CNN": "An next to, her in dark<br />Room as she works on some<br />Has won National Cai<br /><br />By Cliffe winning was from..., and described<br />By as moment that captures so much<br />And light textures work really well judges in press<br />The art of has been passed<br />Down of Red Dao in National of<br />An pool Iceland in thrilling and fox<br />In Spain annual aims<br /><br />To best travel from globe<br />By and both, and was chosen from six<br />The themes of food life Our goes from<br />Strength to strength with this year’s.", "Analysis: China thought it had a truce with the US. Then Trump dropped two bombshells | CNN": "Punch from States risks already trade war<br />Truce between, and with tech<br />And both dealt shock blows by<br />The Trump Wednesday night Viewed<br />From within things had been<br />Up world’s two, to roll back<br />Steep step trade war that had<br />The entire ports destined for US Chinese<br />The agreement as national while<br />Top officials tone two<br /><br />But two jabs, from on Wednesday will have<br />And alike, they throw into of trade<br />The truce only lasts days<br />And clock is, to reach first.", "‘Hamilton’ original Broadway cast reuniting for Tony Awards | CNN": "The cast of sings about<br />The Room Where It and that<br />Will be New York’s Hall during next week<br />And Awards that cast of... hit is to<br />At on June Those to Andrew Diggs Jonathan Groff<br />James Neil Haskell Thayne Jasperson Jones<br />Jon Smith Soo Seth Sykes This<br />The years since it first took<br />By storm cultural said<br /><br />In press musical has<br /><br />Won Awards, and star shared<br />The show’s social post captioned We’re running it back<br />The Awards film star Tony and Emmy will be<br />.", "Russian military figure killed in explosion inside the country, authorities say | CNN": "And of war, in Ukraine<br />Was killed southern on said<br />Who was to state died man<br />In blast on street in which<br />Said committed as part<br /><br />Of scene of is are being and actions are being out to<br />All of incident said<br /><br />In and on state appears<br />The show moment of blast<br />Which occurs just as meets<br />The man darkened street near<br />Row of parked cars blast footage shows lying on ground<br />While man is rocked back by<br />The explosion man who<br /><br />Died in with, in near scene.", "This German town wants to lure new residents with free accommodation | CNN": "Town in eastern is offering two<br />Weeks free to there in bid<br />To boost its which sits on... with around<br />Miles from German is offering stay<br />For potential new residents to<br />From on May is aimed at..., in as those<br />In returning to town<br /><br />Skilled or seeking change of... it said with<br />The beginning of will<br /><br />Live for free, in apartment from as<br />Part of project named Make<br />Plans Now said, they will have<br />The get to know life work<br />And of living for free.", "Budapest Pride: Dozens of European politicians vow to attend, despite ban on LGBTQ gatherings in Hungary | CNN": "At least members of Parliament are<br />On attending this year’s<br /><br />Pride in Hungary ban<br /><br />Have told Earlier this<br /><br />Year passed new which Pride country and to<br />Use to those that go ban<br />But officials from at... least six groups<br />Of are planning on annual Pride<br />March according to spokesperson for<br />Kim van of, as for Members of Parliament who<br />Wish to rights, of gay people Pride has<br />In face of Prime and his<br />Which has said it is other in country due to<br />Child protection have vowed.", "White House pressure for increased immigration arrests strains law enforcement agencies | CNN Politics": "The Trump is up and resources to<br />Meet White House’s to triple of daily push to<br />Go well efforts from previous White<br />House is putting on law<br />The meet goal, of year led<br />To surge of, and across<br />The their on, and in some<br />At of agents have been<br />To concerns that shift could<br />Threats and by, and according to people with matter Top have<br />To field offices on..., how are to<br />While their top said have been<br />Told by not, to away<br />From toward work according to one.", "Starbucks is changing one of its generous perks of its loyalty program | CNN Business": "Is one of most parts of... its by Brian to boost<br />June chain is, for that bring<br />In cup for drink they will<br />Earn stars on, their entire which might<br />In stars bonus which was... used by some<br />As quick way, to score free<br />Tea or snack at point level or as<br />To earn to, them on fancier drinks<br />Food and for more stars ranging from that<br />Perk is latest way that<br />Is back deals, in hopes of... One of his<br />First of business was offered to loyalty on<br />Its app to, as brand while.", "Diego Maradona’s homicide trial declared invalid after judge filming scandal | CNN": "The Diego team for<br /><br />Was declared by court on..., of one of<br />The three judges case by<br />An court One, of defendants had of<br />Judge Julieta due to... lack of for<br />The court hearings court’s but<br />Her is not at stake There<br />Is no of lack of there<br />Is that could that said on..., to removed<br />The judge is, of crew to... film which breached<br />Rules claims she gave and has<br />Fresh will be held with new<br />Of but it, when new trial will new<br />Court will of, and debate.", "Rubio lays out detailed plan to restructure State Department to focus on Trump’s priorities | CNN Politics": "The State on told it to... make to focus on Trump<br />To and with less on human rights globe<br />The proposed was announced<br /><br />By of State, in more than<br />Page long lays out details<br />On plan which scores of office and mergers and offices staff<br />At in Washington It<br /><br />Comes as US State its<br />Plans to US for broader cuts federal plan<br />To was of, and work by<br />Said in statement We have<br />From and plan will result<br />In more agile to interests and keep<br />Safe across world of which.", "Supreme Court limits environmental review of major infrastructure projects under NEPA | CNN Politics": "The Supreme Court on limited scope<br />Of reviews, of decision that could<br />Speed up of, and decision is latest for at<br />The Supreme Court which has<br />In years shut down to for<br />And reduce air pollution state lines<br />Trump slammed government’s as<br /><br />Too Act signed by is one<br />Of laws formed at beginning of modern Brett wrote<br />The opinion for court<br /><br />And there were no dissents<br />Both and justices with... line decision wrote that<br />The at issue in case.", "Many US families depend on immigrant nannies. Trump’s policies could upend that | CNN": "Drives to her job as nanny and earns<br />Fair wage yet, her from has<br />Worked in for years though we<br />Have same job do same thing<br />And work same pay is very tells done<br />Well because was born here<br />And pay is good when you<br />Speak has changed, her name to..., her and her<br />Time in White House considered to her<br />The on curbing to at..., and especially in its<br />Years on quick, of arrivals who were<br />To have fewer ties US lot of<br />Told her nothing would happen and nothing did says<br />Her to stay harsh of Donald Trump’s paint.", "Stocks waver as Wall Street digests tariff uncertainty | CNN Business": "Stocks edged higher on as<br />Wall Street for Trump’s agenda which limbo as federal courts<br />Its Dow closed by points or<br />The day gained, and Composite gained Stocks<br />Jumped court ruled late that Trump<br />His to sweeping core trade<br />That has threatened to raise<br />For and slow cheered but not<br />And on lost some steam as<br />The potential for Trump’s<br /><br />The White House, and appeals<br />Court on paused, from Court of... Trade on Wednesday that had<br />Blocked most of Trump’s Gains were..., as fate of<br />The remains, of Wall Street.", "‘It really fits us’: They traded South Florida for the South of France | CNN": "Geoff and Pennie spent living in Florida but<br />The spot what, for themselves<br />When they wrapped up their Nearly years they<br />Would retire, and location they recently on<br />The Nice South, of France suits<br />Them than State Nice is what<br />It was said some of most<br />Low what they call hot here<br />Is not hot, to and just<br />More was more said who worked<br />As finance, in and private lived Florida for<br />Most in Wilton just north<br />Of Fort Nice on famed no<br />One is rushing you out.", "Home sellers now outnumber buyers by largest margin in 12 years | CNN Business": "Years of bidding wars climbing home prices of power in housing may finally be<br />Home now vastly in US according to real<br />The report found that there<br />Were more home, in than buyers as of<br />The gap two groups since data in data is early that US may be<br />Not because home are more<br />But because there are fewer It’s latest sign that<br />Now compounded by trade<br /><br />And recession fears may<br /><br />Be up with, in demand<br />For new homes have continued to rise<br />The existing home sales.", "Sydney Sweeney is selling soap infused with her ‘actual’ bathwater | CNN": "Gwen sang bathing in it<br />And now it’s thing thanks to... one euphoric is partnering with<br />Soap brand Dr, to sell limited line<br />Of bars with, her Yes you<br />Read that right, to posts from... star on Bliss<br />Soap bars can be yours next<br />Month push comes ad for Dr<br />Wash last which, her in bubble bath dirty boys You<br />Kept about, my so we<br />Kept it Thursday’s post on... both and Dr<br />Read real very soap made<br />With my actual post<br /><br />Asked this new soap is being brought into and then<br />Stop and Sydney said do.", "Trump administration increases pressure on ‘sanctuary jurisdictions’ with public list | CNN Politics": "The Department of is... more than country on notice that Trump<br />Views them as it attempts<br />To on it are in way<br />Of mass on list of said<br />Each one will that has deemed<br />Them and whether to be<br />In list was on department’s These city are our law order to violent said<br />In news Trump has states that<br />It says aren’t to help<br />And Enforcement as it<br /><br />Seeks to make good on President Trump’s<br />To remove, of list was..., of or as<br />How much they have complied<br />With officials laws if.", "Far-right activist with history of anti-gay comments fired from leadership role at Kennedy Center after CNN investigation | CNN Politics": "Floyd Brown activist with..., of and theories said he<br />Was from senior role he<br />Held at Kennedy just<br /><br />Reached out with, his past statements Brown’s past<br />And condemning of gay<br /><br />Sex he has claimed that is..., and promoted his birth<br />Brown served as Vice of top<br />Role for helping raise tens<br />Of support, of most prominent arts<br />His appointment which had<br /><br />Not been formally by<br /><br />The had sparked some according to sources It was<br />The change to, since Trump was..., as new chair.", "The New York Times inks deal with Amazon to license content for AI training | CNN Business": "The New York Times on that<br />It will license from its<br />To train AI deal AI like will<br />Be to use Times from Cooking and sports<br />The Athletic to summaries short<br />In real time Jeff will use<br />Worth of Gray, to train its<br />The will make New York content more to<br />And direct links to Times<br />And shared to with news AI Times said<br />In deal is with that is... worth for New<br />York Times Meredith said<br /><br />In obtained by It with..., to ensuring that our work is<br />Through commercial deals or.", "After several meltdowns this spring, it will be the ‘cheapest’ summer to fly United Airlines at Newark Airport, CEO says | CNN Business": "Of air traffic short staffing and caused<br />Days of at be to fly<br />There in history to... we lost lot<br />Of lot more seats Scott Kirby said at<br />The Wall Street, of event<br />It’s to be it’s to be<br />In like that, but you ought<br />To book it’s, to be least<br />The slashed summer come after month for<br />The New Jersey that slew<br />Of air traffic caused by<br />Short and major of Federal all<br />While is closed, for is safe<br />And encouraged to book<br /><br />Flights On Wednesday of Sean.", "Archaeologists found a strange red mark on rock. Forensic police helped them unravel who made it | CNN": "In Spain say, they may have<br />One of most on record<br />In back tens, of years secret of who<br />Made mark help, of forensic in crime<br />Scene marked with print found San<br />Rock in hints at of art<br />To new study adds to... cave and paintings in recent years building case that<br />Who went years were more like<br />Than some might think team of... rock below<br />Feet of sediment their<br /><br />In May journal and Sciences San<br />Is site to have been by<br />To when we saw first time<br />We were looking at stone.", "Ukraine scrambles to set up ‘drone wall’ as it braces for Russian summer offensive | CNN": "And drone this month in effort to sap<br />But it is up ground many long to<br />And Some of those attacks<br />Have succeeded with units in north<br />Back from some, while some rural in south<br />Have been lost, but own use<br />Of drones several on... has helped heavy on forces with minimal its<br />Own troops they may become<br />More in months, to come are..., to expand<br />Their own drone, to create<br />Key of front line dubbed drone<br />Wall Trump’s efforts to Kremlin is strategy aimed<br />At Ukraine, to admit.", "VOS Selections: How a small, family-run wine company hit back against Donald Trump’s tariffs | CNN Business": "The court ruling that blocked<br />Most of US Trump’s tariffs is small<br />Wine run by VOS Selections small New<br />Wine was lead, in which prompted at US Court of<br />Trade to strike down Trump’s sweeping on Wednesday found Trump<br />His by powers to sweeping on China and other VOS founder Schwartz never to be<br />At of US Put it<br />This way when VOS years had<br />No idea that was... up for something like this<br />In against branch of States<br />Schwartz who runs, his told just<br />To bring these wines from world.", "Sarah Jessica Parker details her fears of book-banning, likens libraries to ‘sanctuaries of possibility’ | CNN": "Might play writer on but<br />In real life who holds books<br />Near and dear, to her heart<br />The whose series and Just<br />Like its third on spoke to... this week her<br />Love of reading and why<br />She fears of book bans funding cut Book<br />Much except it just hurts<br />Told Specific to will<br /><br />Say that many in this<br />Me were raised, in and not<br />Just with shelves, they are of... Sex and City star went<br />On describe, how are vital and free<br />For to such, as heat winter or air<br />In apply, for jobs to... learn to reach.", "Trump administration took action against China due to frustration on trade talks, officials say | CNN Politics": "The against by Trump over last few<br />Days was prompted by US officials that China has failed<br />To live up, to commitments it made<br />In trade talks this month three<br />Told This week made moves to..., for Chinese<br />And suspend sale of some<br />To Chinese said they are... that failed to<br />Through on that were meant to... trade between<br />The two countries as they... seek deal by<br />The dispute fraught between<br /><br />The world’s two, as two sides<br />From talks Switzerland to... by Trump gulf<br />To be widening on... chains that each.", "Bernard Kerik, Trump ally and former NYPD commissioner, dies at 69, source says | CNN Politics": "New York has died at age<br />Of according to source<br /><br />Close to Kash, in post on... we mourn loss<br />Of Bernard, and one of... most courageous this country has ever known Bernie passed tragically on<br />May with illness wrote Trump<br />Who once served three years federal for<br />Tax fraud lying to was... by Trump teamed<br />Up with former New York<br />And Trump lawyer in weeks<br />The election to search<br /><br />For of voter fraud for<br />Said in letter to House<br />The at US that Mr was hired by Donald Trump’s legal team to<br />Act as tasked, to look into claims of<br />Fraud was once, and for he.", "Takeaways from Amodei’s conversation with CNN’s Anderson Cooper | CNN Business": "And have long warned that rapidly will<br />Wipe out jobs, and Now that<br />Call is coming from house<br />On warned on that will spike<br />Than and businesses they..., for it AI tools that<br />And are racing to build<br />Could half of jobs and boost<br />To as much, as in next<br />One to five years he told<br />On his leading lab is... that it says<br />Can work nearly day length<br />Of World Forum found that<br />Of employers plan to..., their because<br />Of by some say will certain tasks rather than jobs<br />And say rapid growth of... tools may slow.", "Israel accepts new US proposal for ceasefire with Hamas, says Israeli official | CNN": "Has accepted new for<br /><br />With from US Steve to... told proposal calls for<br />The release, of and hostages as<br />Well as truce no details<br />The beginning of for<br /><br />End to war key demand<br />That has to said comes from..., and does not<br />To demands which is stopping war famine to Naim of militant group’s<br />The is studying with... all response<br />To proposal in light<br /><br />Of which our are being he added on has<br />To proposal with three<br /><br />To official told would.", "Kristi Noem said a migrant threatened to kill Trump. Investigators think he was set up | CNN Politics": "On sent letter to kill<br />Trump to self Thanks to our ICE officers this<br />Who to President Trump<br /><br />Is behind bars wrote social post that<br />The man also sent out<br />Press release was picked up<br />By news allies used it<br />To what they see as dangers of migrants and work<br />Of boot them out of country was victim of Law<br />The man Reyes wrote letter which was<br />Sent to Customs and other law agencies with<br />The told letter was to... who is currently case<br />In which Reyes is victim they do.", "The Vatican has held sacred belongings for a century. Now their Indigenous owners hope Pope Leo will give them back | CNN": "The home of Pope lies vast<br />Of that some say be there<br />The collection of objects rare kayak from western pair of<br />Cree gloves wampum belt baby belt from<br />The beluga tooth necklace they are<br />Of time of say by Roman Church century as<br />Of lands Pope, to return<br />The part of what he called<br />For abuses by Church<br /><br />But years on, they remain<br />In museums and storage vaults leaders are now<br />Pope to finish what Francis and give<br />The back when things were taken that else’s to take<br />It’s time to, them said Cindy Chief of<br />The Assembly of First.", "Why this leading AI CEO is warning the tech could cause mass unemployment | CNN Business": "The chief of one of world’s<br />Labs is warning that could<br />Cause dramatic spike very near future he says<br />And for it is to get<br />Than at all tasks and we’re..., to as grapple with it<br />Told in on is to get<br />At what does what do what<br />Do believes tools that other are racing to build<br />Could half of jobs and spike<br />To as much, as in next<br />One to five years he told<br />On That could mean rate growing in just<br />Few last time it neared that<br />Rate was briefly at height."}