{"Diogo Jota: What we know about the death of the Liverpool soccer star and his brother | CNN": "The world is, in death of..., and star car<br />Crash in Spain on he was..., his who was<br />Died in accident at... age of married his partner with whom<br />He has three less than two<br />Weeks before crash occurred<br /><br />Am time on road in Spain<br />And was caused by burst tire while Guardia said<br />On that his were in left<br />The road caught said It is... not known which<br />Was car which was remains<br />Based on documents at... scene of accident as<br />Well as car’s plate forensic at morgue<br />In Zamora to Portugal for.", "What’s open and closed on July 4, 2025 | CNN Business": "As years of with and many will be<br />Closed for day Fourth of marks<br />The birth of day of was..., in as federal Fourth<br />Means banks some will be closed<br />So it’s worth what’s before<br />Out This year Fourth of will<br />Fall on Friday and will<br />Be their regular Most<br /><br />Stores which Fred Food Less Ralphs<br />And will be, their on store<br />May by Whole Foods and Food<br />Will remain, as while Trader Joe’s will<br />Close at ALDI stores will<br />Close at Sam’s Club will be<br />From am to, for Plus members and from<br />Am to for Club will be.", "Social Security Administration praises Trump’s agenda bill in widely sent out statement | CNN Politics": "The this week sent out to... Trump’s domestic bill touting tax for<br />In move that said strayed from... This is step<br />For said Social Frank message By tax<br />On this President Trump’s<br /><br />To protect, and helps that<br />Can earned which was sent to... not yet for<br />Linked to blog post on noting that nearly of Social will no<br />Pay on their Trump campaigned<br />Last year on were not able to that<br />In One Big Bill because<br />Of rules Senate used to... will provide<br />With boost to, their deduction from through.", "Denaturalization: Law used to kick out Nazis could be used to strip citizenship from many more Americans | CNN Politics": "For decades, of has used<br />Tool to sniff out who lied<br />Their way into law that<br />The department to or<br /><br />Strip from criminals who<br /><br />Their records, or hid their<br />Pasts That power new Trump<br />May be broadening to... by Department last month<br />Should aim their work to target much broader swath of<br />Who may pose, to directive to be<br />Push towards that fits with... Trump These could<br />Leave some of at risk of..., their and being who have<br />Crimes are members or of... gangs and drug.", "Discovered: A Neanderthal ‘fat factory’ from 125,000 years ago | CNN": "Stone Age humans by lake<br />In what’s now, for what scientists as<br />Fat to boil bones on vast<br />Scale according to new<br /><br />The by some bone and flint<br />Tools unearthed years at site<br />Known as south, of Halle they..., in Advances found evidence of<br />Use believe that extinct<br /><br />Of known to have lived that<br />As far back, as years smashed<br />The bones into with stone<br />Then boiled them, for to fat<br />Which floats to, and can be<br />Skimmed off cooling since this<br />Feat would have hunts transporting and storing food needs.", "Why have there been so many upsets at this year’s Wimbledon? | CNN": "If crumb of, for who have<br />Been dumped out, of then it’s<br />This not Tennis’ names have<br />Been at rate first week of... this year’s tournament of<br />The men’s draws wide It has<br />Led to period of..., for world’s best<br />World No Jessica called<br /><br />Her defeat worst result<br /><br />Had all year, while said her<br />Loss against sucks Men’s third<br />Seed was even more frank<br />When he spoke, of alone<br />And trapped hole on court following his<br />To and were joined by fellow seeds Zheng.", "Trump says he had ‘never heard’ Shylock as an anti-semitic term after using it at rally | CNN Politics": "Trump said early that he<br />That some people view word<br />As term during to money heard it<br />That way to me is money at high<br />Rates Trump told off Air Force<br />One heard it that way you<br />View it differently than<br /><br />Me heard that Trump was back<br />In event, in next year<br />In his speech, he used word<br />When of major bill that<br />Had been by few Think of... that no death<br />Tax no tax no to banks<br />And from some fine and some<br />And bad people he said<br />His event, in Des Moines.", "Trump expects Hamas response to ceasefire in hours as new details emerge on proposal | CNN": "Trump has up, in war Gaza he said<br />That response, from was next<br />Day Asked by has agreed<br />To and hostage deal Trump<br />We’ll see what we’re to know<br />The next hours put forward to Israel this<br />Week and Israel it<br /><br />On says it will announce<br />Its decision with other how long<br />This might take Trump has pushed<br />Hard for saying on Tuesday that Israel had<br />To conditions to deal<br /><br />For of post on Truth Social Trump warned<br />To accept, as well hope<br />For good of East that takes.", "Behold, the epic flop that is the Cybertruck | CNN Business": "It might not come as shock<br />If you have eyes but is... flop is its<br />Sales on models so you<br />Have to squint, to get sense<br />Of just how on wheels is..., in real world<br />But we have some idea what we<br />Know based on, for released<br />This week EV, in between<br />And June this year record<br />From year earlier Zoom<br /><br />In and it gets break out<br />Sales of one, of its premium that<br />Was plucked straight, from brain It<br />Just two Model and one<br />And in second which is..., and said it.", "What it was like inside the courtroom during the Sean ‘Diddy’ Combs trial | CNN": "Sean Combs dropped, to his knees<br />Placed his hands, and bowed his<br />Head found him not of most<br />He faced giving him second chance at<br />Life he also turned to... box with his<br />Palms in nodded his head<br />In for their, as was led<br />Out of on floor of federal two<br />Rows filled with, his six children and friends<br />The was of that Combs ran<br />To promote, him and his<br />Them and forcing them to... have sex with<br />Male Combs was, of two counts<br />Of engage, in with maximum of<br />Years each prison but jury of eight.", "Lea Thompson believes the first ‘Back to the Future’ film is ‘a perfect screenplay’ | CNN": "It’s been years, since McFly<br />Hopped that up One of stars<br />Of Back to it Lea Thompson on film<br />In which she played Lorraine<br />The played by Fox in recent with People was asked<br />Which of three, in was her<br />For me it’s, to because<br />It’s just as can of it<br />And truth is that to Future and were<br />To be kind, of like one<br />And then they spread it out<br />Two she said, so it same<br />Way as to was so just<br />Think it’s to now when we<br />Made to Future’ we even think we<br />Were to make There was no.", "Katy Perry and Orlando Bloom confirm split | CNN": "And Bloom have split three years<br />Their engagement who have<br /><br />That they are no together much state<br />Of their to which was first<br />To report, for Bloom Perry in which<br />They said Katy have been<br />Their past many months to... on they will<br />To be seen, as their shared<br />Is and will be their daughter with love<br />And respect has reached out<br />To for comment news came<br />Week reports that who is... on tour did<br />Not attend, of Jeff Lauren in Venice Bloom was<br />Guest It followed that duo who had.", "Why Black unemployment just rose to its highest level since January 2022 | CNN Business": "Black last month reached its highest in more<br />Than three years, in stark contrast to broader rate for<br />Black climbed to June Department said up<br />From May’s highest since national rate<br />Ticked down to, and employers jobs June<br />To jobs Joblessness for<br /><br />Whites Hispanics and Asians Trump’s trade<br />War which business and sparked<br />Fears of higher was one<br />In rise Black, for months businesses have<br />Said Trump policy from... cuts in federal have<br />Made it difficult to... plan ahead.", "Why the GOP doesn’t want you biking to work but will spend millions on a ‘heroes’ sculpture garden | CNN Business": "The tax spending bill is..., of text full<br />Of proposals that would<br /><br />Things slash social net lavish with tax<br />Cuts It is on left for<br />Poor and on, for not going far to<br />Cut It’s hard pill to swallow for spectrum which is<br />Why it’s loaded up with... niche provisions that some<br />Of within Trump Like killing cheap that<br />At least theory would with... Make Again<br />Sect of Trump was suspended in Trump’s<br />First term but then it to... month for biking to work<br />Good for package in Congress would it.", "7 little-known items in Trump’s big agenda bill | CNN Politics": "When Trump signs, his big beautiful bill<br />Law much of will be on... its tax cuts<br />To and food stamp and boosted but tucked<br />Long list of that won’t grab<br />The tax spending look at..., of provisions of measure space shuttle parked at<br />The Air Space, in Virginia since it<br />Was in will be Its new<br />Home bill million to pay<br />For its housing at Johnson Space Center move comes<br />Push by two John and Ted<br />Cruz who argued role space<br />Should be space flight like will<br />Have to pay fees for their.", "Zohran Mamdani has big housing plans. Here’s what stands in the way | CNN Business": "New York City for mayor has to<br />The costs to Trump’s to gut<br />Aid and other may his<br />Goals New York is in grips<br />Of its worst, in more than<br />Years of rentals are typical New<br />York pays more than half of... its on rent<br />The decades have new housing who won<br />New York mayoral has<br /><br />Pledged to freeze rents on units if build<br />The next double of money spends to<br />Did not to, for more on..., his plans We<br />Need more housing says on... its that does<br />Get built is out of reach.", "China tells EU it can’t accept Russia losing its war against Ukraine, official says | CNN": "Wang Yi told top that can’t<br />Its war as this could States<br />To turn its full attention to China briefed on<br />The talks said, of admission came during what said<br />Was with foreign chief Kallas on Wednesday in Brussels that featured tough but<br />Broad range of rare earths to... trade and Middle East said<br />Might prefer war in that<br />Keeps United States from... on its rivalry with<br />They concerns, of that has<br />Much more at stake in conflict than its<br />Of On Friday at regular of<br />Mao Ning was asked about.", "Joey Chestnut triumphant in Nathan’s Famous International Hot Dog Eating Contest return | CNN": "The champ is back year from... famed on Coney to once<br />At Hot Dog by consuming hot dogs<br />And buns minutes to win<br />Belt skies weather which could<br />Be described, as conditions to spend<br />In consuming close with... next hot dogs<br />In New York came League Eating which eating barred from<br />The event, in he struck<br />Deal with food Foods in June<br />The famed eater that he<br />And had to, his return<br />To pledged his, to Oh my<br />Gosh was nervous told after win first<br />Of hot dogs was bit but.", "Trump says he is about to raise tariffs as high as 70% on some countries | CNN Business": "On Trump gave world to trade<br />Deals with States, or face higher With just<br />Five days that White House is..., to begin<br />To or so Time is up<br />And your new rate Trump early at Joint<br />Base told that, he would to... day course of<br />The next five days detailing their new<br />In that White House would sending on Friday in most<br />The new rates would go into Trump said<br />Range in value from maybe or tariffs to tariffs but going to be<br />To go out Trump said done<br />The form it’s, to explain.", "Australian police arrest two over ‘Chinese blessing scams’ targeting elderly Asian women | CNN": "Two alleged, of out of... tens of thousands of dollars in cash<br />Have been by spate of blessing scams blessing scams have<br />Been for last years or so<br />In United States Kingdom and New<br />And convince, them that member of their<br />Is cursed or, in are told<br />The way to ward off negative is<br />To have their wealth blessed It’s<br />By stealth These swarm these victims they swarm<br />Like pack of said New South<br />Wales Police Guy Magee<br /><br />Was detained at extensive by Strike<br />Force task force formed in April to scams."}