{"Eric Adams’ reelection strategy against Zohran Mamdani | CNN Politics": "Was once rising star Party his will<br />Hinge on taking down newest one Hours in New<br />York as trying to New<br />With campaign This is city not of<br />Said on steps, of Hall Adams pitched as<br />On and who wants to job<br />He set out, to do nearly four years<br />He that he, to paint as<br />And out of touch with needs<br />Of Black This is choice candidate with<br />Blue and one with suit silver spoon choice<br />And nails Adams said It’s<br />Choice between real and empty was shown<br />On Burnett, he smiled held.", "‘We’re still here. We’re still going to enjoy our game’: What it’s like being a trans sports fan in Trump’s second term | CNN": "The first six months of Donald Trump’s second term as<br />Of United States have<br /><br />Been defined by and of... that takes aim<br />At some of most in people in US have been<br />Of Trump ire have been taken to trans<br />From life from that bans women from sports<br />Trans especially have been<br /><br />In Trump over last few<br />Months There have been threats to... trans high school<br />In state track, and field March<br />The White House cut off million in federal funds<br />For of trans, as gears up.", "Inside Starbucks’ ‘coffeehouse of the future’: Its redesign to save the company | CNN Business": "The last few years pulled out<br />Seats hard wooden stools blocked<br />And turned stores, for up orders off its<br />App and customers left<br /><br />For shops other chains brewed<br />More at home Now is trying to win<br />Back to sit down for cup<br />Of by stores, of its US chairs couches and power in next<br />Year aims to make to all<br />Of its US stores next<br />Three years for price tag It’s<br />Where want to come in It’s<br />Not just quick grab and go<br />Mike Grams chief said in with... last week at<br />One of first stores in New.", "Trump is ending trade talks with Canada | CNN Business": "Trump ceased trade talks with Canada will<br />Soon announce new rate country will have<br />To pay he said in Truth<br />Post on Friday to end<br />Which have been, for months came<br />Tax Trump said it direct<br />And attack on Based on... this egregious Tax we<br />Are hereby ALL discussions on Trade<br />With effective We will<br /><br />Let know Tariff that they... will be paying to do<br />With United States of... next day period he<br />Said are way, for to tax<br />In on physical with... these can from<br />Large that even if business is firms.", "America’s incredible stock market rebound could be completed today | CNN Business": "On when stocks were on verge<br />Of bear market few Wall<br />Street were that would hit high<br />Just days later what market set to<br />Do above its record<br /><br />High of trading at if<br />It above points will reach<br />Its first closing high since<br />The Composite gained also hit high<br />The was on pace to close<br />At high its first since Nasdaq has with<br />Big Tech AI boom has<br />Tech in recent months smaller made up<br />Of top tech stocks set earlier this<br />Week Dow rose points or index dragged down.", "Challenge to panel that recommends no-cost preventive health care is rejected by Supreme Court | CNN Politics": "The Supreme Court on Friday task force<br />That preventive health care<br /><br />That must cover at turning to reach<br />The high court that or PrEP<br />Which reduces risk of... sex or drug<br />Use would some said case is..., to court where<br />The could be, though appeal<br />To take down Care Act it<br />Could have had on of their<br />To preventive cost of... care free makes<br />It more likely that people will get<br />And that are aimed at earlier stage<br />This is big win for services of<br />The Health Policy Law.", "Texas porn age verification law upheld by Supreme Court | CNN Politics": "The Supreme Court on Friday law that<br />Age for one, of most closely watched First<br />To arrive at high court<br />In years industry had<br /><br />The law as it restricted of speech<br />Wrote opinion for court<br /><br />Grounds with court’s three dissenting state’s shielding from content wrote it<br />Is because it permits<br /><br />To their ages through methods of sharing law any that publishes of<br />That is harmful to minors to age<br />Of said law, to themselves<br />Such as by ID before.", "Rubio says he wants ‘one on one’ talks with Iran – but some in Congress remain skeptical | CNN Politics": "Six days after strikes on... top White House<br />Told House they are now focused on drawing back to<br />Though of both said precise<br />To do so was not clear<br />One of things that was this<br />Is that we now need to... with us talks<br />Not through third not through other they need<br />To sit down at with us<br />Mike told Friday That message on was<br />By of State who told that<br />He to meet with and not<br />Through third party to senior Rep Michael of Texas but former was one<br />Of House who told he was..., of plan I’m.", "The ‘revenge tax’ is dead before it even started | CNN Business": "The Department and Congress on moved<br />To kill tax that was set<br />To raise taxes on foreign and had<br />Spooked Wall Street, and Scott Bessent on deal<br />With that will, from some global in for<br />The One Big Bill Act Bessent said post<br />On that he would ask Congress to Section from budget bill Senator Mike<br />And Rep Jason Smith who<br />The joint on said in statement that following they<br />Would remove, from bill Section was tax<br />Code tucked to Trump’s bill that<br />Would have raised on earned from... held by or.", "Russia has amassed 110,000 troops near strategic Ukrainian city, Kyiv says | CNN": "Has amassed troops in as<br />Part of its, to take over chief said<br />Said on Friday that area was<br />The front line which runs east<br />Have been trying to capture for year<br />One offensive but having clear terms<br />Of troops weapons has failed<br />To take over is target for Russian has made<br />It clear that, his goal is..., to seize all<br />Of and his, and its allies of stalling on peace<br />So that his can seize more<br />Not sits on key supply<br />Road and that it with other hubs area with<br />And it forms, of defenses in part.", "Where is Jodi Huisentruit? | CNN": "She was darling of local in Mason not as<br />As it might sound since that<br />Meant arriving for work<br /><br />At am daily time for<br />The had never missed show<br />Not once On June she finally I’ll<br />Be right she said when her<br />News producer called to... wake her up<br />At am lived, in small complex in Mason just mile<br />From work Long was of three<br />She excelled, in sports early and loved<br />Golf before, her career<br /><br />As she worked, as flight friend<br />That she liked, to say that.", "Oslo police announce rape and sexual assault charges against son of Norwegian crown princess | CNN": "On announced Borg son of... crown on multiple counts<br />Rape assault, and harm after of case<br />That of victims son of... Crown and of<br />The heir to throne Crown Prince<br />Has been under since he<br />Was arrested in rape<br /><br />And on charges of bodily harm<br />And Police said was during which is<br />Now complete, in case was... drawn from sources and searches said charges one case<br />Of rape two, of rape four<br />Of assault, and two cases of bodily harm<br />Said at news go detail.", "Rick Hurst, ‘The Dukes of Hazzard’ star, dead at 79 | CNN": "Rick Hurst best known for playing Hogg hit<br />The Dukes of has died at... age his death<br />Was confirmed by Ben Jones<br />His on show who on page<br />Of Place which is to show<br />On It seem right that Rick<br />Hurst passed this, when so happens it is<br />To as current goes wrote<br />Jones have known Rick for over years there<br />Of that time that he leave<br />Me or laughing Sure he<br />Was but mostly he just<br />Had heart as big as Texas he added he was<br />Fine and colleague said Jones<br />Who recalled, how clicked when.", "Lalo Schifrin, composer of the ‘Mission: Impossible’ theme, dies at 93 | CNN": "The composer who wrote<br /><br />The theme for, and more than<br />For film died, he was son<br />That died due, to pneumonia he died<br />In his home, in Los Angeles by<br />The won four, and was for<br />Six five for score for Cool<br />Hand Luke Fox, of Damned Horror and Sting<br />Has its own There are no<br />Rules to write, for told Press<br />In dictates what will be<br />He wrote grand, for World Cup<br />In which Three, and sang for<br />The first time work became<br />One of biggest in history of<br />Jazz pianist and classical had.", "Rachel Zegler is serenading crowds of people in central London almost every night for free | CNN": "Strands of music float through<br />From cars or your flat but<br />Not until this has voice<br />Of star echoed Street Soho Near nightly will walk<br />Out at just front doors her<br />Voice rendition of Cry<br /><br />For free to watch song on... live feed balcony has<br />Made Evita of moment on West<br />End behind this scene this<br />Way have sparked It is clever ploy some<br />Say up much show’s official press night<br />It is way, to make theater more<br />Say chance to see best known<br />For her starring turns West.", "Israeli military rejects report that soldiers told to fire at Palestinians waiting for food, after repeated deadly incidents | CNN": "The has new that were ordered to fire at waiting for aid<br />In were killed, while approaching food sites<br />In weeks On that in Gaza were by<br />Their commanders to shoot<br /><br />At crowds of aid sites even as it<br />Was that crowds posed no threat<br />One who spoke with described<br />The approach routes to aid<br />Sites as killing field where<br />If there is no threat to... crowds with shells<br />Which resulted in sharp<br /><br />Rise in We raised in article did<br />Not to shoot at civilians those centers said to<br />The be clear on civilians Prime Minister Katz.", "Supreme Court sides with parents who want opt their children out of LGBTQ books in schools | CNN Politics": "The Supreme Court on Friday backed group<br />Of religious who want<br /><br />To opt their school out of... with books major win for<br />At high court, in decision line that<br />Once from court said that school<br />Near First rights by refusing to them<br />To pull their, from when books<br />Are used Justice wrote for<br />An divided court court’s<br /><br />Three dissented board’s of... with its to<br />Opt outs places on parents’ rights to<br />The free of, their religion wrote for<br />The have shown that they are..., to succeed.", "Americans reined in their spending last month | CNN Business": "The May spending for first<br />Time since to new released<br />That showed heated up on... showed that spending fell last<br />Month in April when taking by for<br />The month nearly in motor sales was<br />Of May spending as rushed<br />To buy cars, in March April that President Trump’s<br />Would send those costs report<br />Showed that pulled back on spending at spending more than<br />Of and have that steep tariffs on most<br />Goods and mounting of how<br />Trump’s trade policy could<br /><br />The will from are out less.", "Earth’s oldest rock is at least 4.16 billion years old, scientists say | CNN": "In remote, of Quebec<br /><br />In its eerie on eastern shore of<br />Bay but over past two<br />This exposed, of floor known<br />As Belt has been in quest<br />To Earth’s oldest rock New<br />That site harbors known fragments of Earth’s<br />Crust back to years ago<br />It’s rock to be from first<br />Of four eons in our which billion years when<br />The world was hot and Rocks<br />Are books for, and right now<br />We’re book Belt would be at... least one page<br />Of that book, so why it’s<br />So said Jonathan of... Belt has been.", "Nike says its tariff bill is $1 billion | CNN Business": "Is it will have to pay<br />In costs of Trump’s announced<br />The new meaningful cost<br /><br />Said Friend Nike’s chief financial on call<br />With that will cost by its<br />Chain reliance on China and by<br />The costs onto with price<br />To source base, he said is..., of United States from<br />To range by end of fiscal with coming from other of tariffs and spending was on<br />Its net for fourth which fell<br />To sharp slump, from it year<br />The drop Elliott Hill<br /><br />Said he was on his plans.", "US, China formalize deal on rare earth shipments | CNN Business": "On it would, of rare earth<br />To White House said two sides<br />Had reached deal, in what would<br />Be weeks of key Rare earths<br />In jets had key of trade<br />The world’s two, in weeks as<br />Their morphed into chain struggle will export of items that meet<br />The conditions in with... law United States will<br />Of restrictive of Commerce said statement was framed<br />As response, to that referenced how<br />Will of rare earths to States<br />The Chinese, from Trump his<br />That two sides had reached deal.", "Germany charges Syrian juvenile over foiled attack on Taylor Swift concert | CNN": "Has charged Syrian with..., for to plan<br />Foiled attack on Swift concert in last<br />Year said statement on Friday as helped<br />The attacker by Arabic him<br />In with member of State<br />To against, him Police<br /><br />Made arrests plot to Taylor Swift concert in Austrian Ernst<br />The all three, of her shows<br />There in August last year<br />Has adhered, to State since<br />At said August he was..., in with young<br />Who was planning bomb on... by Swift government this<br />Month agreed on plan to... thwart attacks.", "Louisiana redistricting: Supreme Court punts case until fall | CNN Politics": "The Supreme Court on Friday in major to map<br />The step of case for second term means<br />The that added Black to... state’s will place<br />At least for time court said<br />It will hear set of arguments raised<br />In case term that begins<br />This fall Justice from hold<br />The appeal next term filed<br />The appeal that it was... caught in At<br />First court ruled that state had<br />The Rights Act by one Black<br />Out of six, when state sought<br />To comply with that by<br />Black group of sued alleging state by.", "Trade talks probably won’t be done by Trump’s July 9 deadline, Treasury Secretary Bessent says | CNN Business": "Scott on Friday said he<br />Thinks trade could be wrapped up<br />By Day more, for deals than<br />The prescribed said in on... Fox that States<br />Has that it is to make<br />Deals with if we can ink<br />Or of then think we could<br />Have trade wrapped up by Labor Day Bessent said Trump<br />So far has trade deal with..., and truce its<br />Trade war with all things they... get done end<br />You have to put on Bessent said as<br />You and know gets done Washington well<br />In advance said that he.", "Trump’s ‘shadow’ Fed chair plan could undermine Jerome Powell and weaken the central bank | CNN Business": "Trump said last week that he<br />Will announce, his pick to... Chair Jerome<br />Soon is that still has months<br />Left until end of his<br />Term Trump as with Fed it<br />Has not yet rates he has<br />For months but Fed chair this<br />Far in if, he makes good<br />On that plan would be central bank’s history This<br />Would be acting as Fed<br />Chair proposal Scott Bessent first floated last year<br />He became Trump’s Such move<br />Could Fed chief, and that has<br />The Trump took Fed officials and tell<br />It’s idea who served."}